;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Tue Dec 20 13:45:52 2022                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
;	C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\opt430.exe C:\\Users\\MCourson\\AppData\\Local\\Temp\\{7436F60F-E7F4-4A1A-B540-AF49E7A262D5} C:\\Users\\MCourson\\AppData\\Local\\Temp\\{DCB56A03-A4B5-4ACD-AEB1-9F26603B6877} 
	.sect	".text:Timer_B_stop"
	.clink
	.global	Timer_B_stop

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("Timer_B_stop")
	.dwattr $C$DW$1, DW_AT_low_pc(Timer_B_stop)
	.dwattr $C$DW$1, DW_AT_high_pc(0x00)

	.dwattr $C$DW$148, DW_AT_TI_symbol_name("baseAddress")
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$148, DW_AT_location[DW_OP_reg12]

$C$DW$149	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$149, DW_AT_name("captureCompareRegister")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("captureCompareRegister")
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$149, DW_AT_location[DW_OP_reg13]


;*****************************************************************************
;* FUNCTION NAME: Timer_B_clearCaptureCompareInterrupt                       *
;*                                                                           *
;*   Regs Modified     : SP,SR,r12,r15                                       *
;*   Regs Used         : SP,SR,r12,r13,r15                                   *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Timer_B_clearCaptureCompareInterrupt:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 4
	.dwcfi	save_reg_to_mem, 16, -4
;* r13   assigned to captureCompareRegister
$C$DW$150	.dwtag  DW_TAG_variable
	.dwattr $C$DW$150, DW_AT_name("captureCompareRegister")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("captureCompareRegister")
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$150, DW_AT_location[DW_OP_reg13]

	.dwpsn	file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 301,column 5,is_stmt,isa 0
        ADD.W     r13,r12               ; [] |301| 
        MOV.W     r12,r15               ; [] |301| 
        BIC.W     #1,0(r15)             ; [] |301| 
	.dwpsn	file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 302,column 1,is_stmt,isa 0
$C$DW$151	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$151, DW_AT_low_pc(0x00)
	.dwattr $C$DW$151, DW_AT_TI_return

        RETA      ; [] 
        ; [] 
	.dwattr $C$DW$147, DW_AT_TI_end_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
	.dwattr $C$DW$147, DW_AT_TI_end_line(0x12e)
	.dwattr $C$DW$147, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$147

	.sect	".text:Timer_B_clear"
	.clink
	.global	Timer_B_clear

$C$DW$152	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$152, DW_AT_name("Timer_B_clear")
	.dwattr $C$DW$152, DW_AT_low_pc(Timer_B_clear)
	.dwattr $C$DW$152, DW_AT_high_pc(0x00)
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("Timer_B_clear")
	.dwattr $C$DW$152, DW_AT_external
	.dwattr $C$DW$152, DW_AT_TI_begin_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
	.dwattr $C$DW$152, DW_AT_TI_begin_line(0xc8)
	.dwattr $C$DW$152, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$152, DW_AT_decl_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
	.dwattr $C$DW$152, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$152, DW_AT_decl_column(0x06)
	.dwattr $C$DW$152, DW_AT_TI_max_frame_size(0x04)
	.dwpsn	file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 201,column 1,is_stmt,address Timer_B_clear,isa 0

	.dwfde $C$DW$CIE, Timer_B_clear
$C$DW$153	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$153, DW_AT_name("baseAddress")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("baseAddress")
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$153, DW_AT_location[DW_OP_reg12]


;*****************************************************************************
;* FUNCTION NAME: Timer_B_clear                                              *
;*                                                                           *
;*   Regs Modified     : SP                                                  *
;*   Regs Used         : SP,r12                                              *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Timer_B_clear:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 4
	.dwcfi	save_reg_to_mem, 16, -4
;* r12   assigned to baseAddress
$C$DW$154	.dwtag  DW_TAG_variable
	.dwattr $C$DW$154, DW_AT_name("baseAddress")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("baseAddress")
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$154, DW_AT_location[DW_OP_reg12]

	.dwpsn	file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 202,column 5,is_stmt,isa 0
        OR.W      #4,0(r12)             ; [] |202| 
	.dwpsn	file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 203,column 1,is_stmt,isa 0
$C$DW$155	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$155, DW_AT_low_pc(0x00)
	.dwattr $C$DW$155, DW_AT_TI_return

        RETA      ; [] 
        ; [] 
	.dwattr $C$DW$152, DW_AT_TI_end_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
	.dwattr $C$DW$152, DW_AT_TI_end_line(0xcb)
	.dwattr $C$DW$152, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$152


;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
	.battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ00000000000011111100000000000000000000000000")
	.battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
	.battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
	.battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
	.battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
	.battr "mspabi", Tag_File, 1, Tag_enum_size(3)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$156, DW_AT_name("__max_align1")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$156, DW_AT_decl_column(0x0c)

$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$157, DW_AT_name("__max_align2")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$157, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

$C$DW$T$31	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$31, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("Timer_B_initCaptureModeParam")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$158, DW_AT_name("captureRegister")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("captureRegister")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$158, DW_AT_decl_column(0x0e)

$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$159, DW_AT_name("captureMode")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("captureMode")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$159, DW_AT_decl_column(0x0e)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$160, DW_AT_name("captureInputSelect")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("captureInputSelect")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$160, DW_AT_decl_column(0x0e)

$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$161, DW_AT_name("synchronizeCaptureSource")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("synchronizeCaptureSource")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$161, DW_AT_decl_column(0x0e)

$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$162, DW_AT_name("captureInterruptEnable")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("captureInterruptEnable")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$162, DW_AT_decl_column(0x0e)

$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$163, DW_AT_name("captureOutputMode")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("captureOutputMode")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$163, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$24

$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("Timer_B_initCaptureModeParam")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x03)

$C$DW$T$33	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x14)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_name("Timer_B_initCompareModeParam")
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$164, DW_AT_name("compareRegister")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("compareRegister")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x155)
	.dwattr $C$DW$164, DW_AT_decl_column(0x0e)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$165, DW_AT_name("compareInterruptEnable")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("compareInterruptEnable")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$165, DW_AT_decl_column(0x0e)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$166, DW_AT_name("compareOutputMode")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("compareOutputMode")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x165)
	.dwattr $C$DW$166, DW_AT_decl_column(0x0e)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$167, DW_AT_name("compareValue")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("compareValue")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x167)
	.dwattr $C$DW$167, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$25

$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCompareModeParam")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x03)

$C$DW$T$36	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x14)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_name("Timer_B_initContinuousModeParam")
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$168, DW_AT_name("clockSource")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$168, DW_AT_decl_column(0x0e)

$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$169, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$169, DW_AT_decl_column(0x0e)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$170, DW_AT_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$170, DW_AT_decl_column(0x0e)

$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$171, DW_AT_name("timerClear")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("timerClear")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x104)
	.dwattr $C$DW$171, DW_AT_decl_column(0x0e)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$172, DW_AT_name("startTimer")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("startTimer")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x106)
	.dwattr $C$DW$172, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$27, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$27

$C$DW$T$38	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$38, DW_AT_name("Timer_B_initContinuousModeParam")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x107)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x03)

$C$DW$T$39	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x14)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_name("Timer_B_initUpDownModeParam")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$173, DW_AT_name("clockSource")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x116)
	.dwattr $C$DW$173, DW_AT_decl_column(0x0e)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$174, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0e)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$175, DW_AT_name("timerPeriod")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("timerPeriod")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$175, DW_AT_decl_column(0x0e)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$176, DW_AT_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x134)
	.dwattr $C$DW$176, DW_AT_decl_column(0x0e)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$177, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x139)
	.dwattr $C$DW$177, DW_AT_decl_column(0x0e)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$178, DW_AT_name("timerClear")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("timerClear")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$178, DW_AT_decl_column(0x0e)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$179, DW_AT_name("startTimer")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("startTimer")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x141)
	.dwattr $C$DW$179, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$28, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$28

$C$DW$T$41	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$41, DW_AT_name("Timer_B_initUpDownModeParam")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$41, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x03)

$C$DW$T$42	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$42, DW_AT_address_class(0x14)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_name("Timer_B_initUpModeParam")
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$180, DW_AT_name("clockSource")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$180, DW_AT_decl_column(0x0e)

$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$181, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x86)
	.dwattr $C$DW$181, DW_AT_decl_column(0x0e)

$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$182, DW_AT_name("timerPeriod")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("timerPeriod")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x89)
	.dwattr $C$DW$182, DW_AT_decl_column(0x0e)

$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$183, DW_AT_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$183, DW_AT_decl_column(0x0e)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$184, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x93)
	.dwattr $C$DW$184, DW_AT_decl_column(0x0e)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$185, DW_AT_name("timerClear")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("timerClear")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x99)
	.dwattr $C$DW$185, DW_AT_decl_column(0x0e)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$186, DW_AT_name("startTimer")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("startTimer")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$186, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$29, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$29

$C$DW$T$44	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$44, DW_AT_name("Timer_B_initUpModeParam")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x03)

$C$DW$T$45	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_address_class(0x14)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_name("Timer_B_outputPWMParam")
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$187, DW_AT_name("clockSource")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$187, DW_AT_decl_column(0x0e)

$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$188, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x46)
	.dwattr $C$DW$188, DW_AT_decl_column(0x0e)

$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$189, DW_AT_name("timerPeriod")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("timerPeriod")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x48)
	.dwattr $C$DW$189, DW_AT_decl_column(0x0e)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$190, DW_AT_name("compareRegister")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("compareRegister")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x53)
	.dwattr $C$DW$190, DW_AT_decl_column(0x0e)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$191, DW_AT_name("compareOutputMode")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("compareOutputMode")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$191, DW_AT_decl_column(0x0e)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$192, DW_AT_name("dutyCycle")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("dutyCycle")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x60)
	.dwattr $C$DW$192, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x28)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$30

$C$DW$T$47	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$47, DW_AT_name("Timer_B_outputPWMParam")
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$47, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x61)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x03)

$C$DW$T$48	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$48, DW_AT_address_class(0x14)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")


$C$DW$T$59	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$59

$C$DW$T$60	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$60, DW_AT_address_class(0x14)

$C$DW$T$61	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$61, DW_AT_name("__SFR_FARPTR")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430f5438a.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x11)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$62	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$62, DW_AT_name("__int8_t")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x16)

$C$DW$T$63	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$63, DW_AT_name("__int_least8_t")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x12)

$C$DW$T$64	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$64, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/stdint.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x19)

$C$DW$T$65	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$65, DW_AT_name("int8_t")
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_stdint.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x13)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$68	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$68, DW_AT_name("__uint8_t")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
