MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:50 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
rtc_a.asm                                                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:50 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\opt430.exe C:\\Users\\MCourson\\
      13 000000               .sect   ".text:RTC_A_startCounterPrescale"
      14                    .clink

    1938                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("interruptFlagMask")
    1939                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$23)
    1940                    .dwattr $C$DW$128, DW_AT_location[DW_OP_reg13]
    1941            
    1942                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c",line 251,column 5,is_stmt,is
    1943 000000 B07D          BIT.B     #112,r13              ; [] |251| 
         000002 0070 
    1944 000004 2408          JEQ       $C$L19                ; [] |251| 
    1945                                                      ; [] |251| 
    1946            ;* --------------------------------------------------------------------------*
    1947                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c",line 256,column 9,is_stmt,is
    1948 000006 4D4F          MOV.B     r13,r15               ; [] |256| 
    1949 000008 0F5F          RRUM.W    #4,r15                ; [] |256| 
    1950 00000a E07F          XOR.B     #7,r15                ; [] |256| 
         00000c 0007 
    1951 00000e D07F          OR.B      #248,r15              ; [] |256| 
         000010 00F8 
    1952 000012 FFCC          AND.B     r15,0(r12)            ; [] |256| 
         000014 0000 
    1953            ;* --------------------------------------------------------------------------*
    1954 000016       $C$L19:    
    1955                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c",line 262,column 5,is_stmt,is
    1956 000016 B36D          BIT.B     #2,r13                ; [] |262| 
    1957 000018 2405          JEQ       $C$L20                ; [] |262| 
    1958                                                      ; [] |262| 
    1959            ;* --------------------------------------------------------------------------*
    1960                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c",line 263,column 9,is_stmt,is
    1961 00001a 0CCF          MOVA      r12,r15               ; [] |263| 
    1962 00001c 523F          ADD.W     #8,r15                ; [] |263| 
    1963 00001e 4F0F          MOV.W     r15,r15               ; [] |263| 
    1964 000020 C3DF          BIC.B     #1,0(r15)             ; [] |263| 
         000022 0000 
    1965            ;* --------------------------------------------------------------------------*
    1966 000024       $C$L20:    
    1967                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c",line 266,column 5,is_stmt,is
    1968 000024 B35D          BIT.B     #1,r13                ; [] |266| 
    1969 000026 2405          JEQ       $C$L21                ; [] |266| 
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:50 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
rtc_a.asm                                                            PAGE   39

    1970                                                      ; [] |266| 
    1971            ;* --------------------------------------------------------------------------*
    1972                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c",line 267,column 9,is_stmt,is
    1973 000028 503C          ADD.W     #10,r12               ; [] |267| 
         00002a 000A 
    1974 00002c 4C0F          MOV.W     r12,r15               ; [] |267| 
    1975 00002e C3DF          BIC.B     #1,0(r15)             ; [] |267| 
         000030 0000 
    1976            ;* --------------------------------------------------------------------------*
    1977 000032       $C$L21:    
    1978                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c",line 269,column 1,is_stmt,is
    1979            $C$DW$129       .dwtag  DW_TAG_TI_branch
    1980                    .dwattr $C$DW$129, DW_AT_low_pc(0x00)
    1981                    .dwattr $C$DW$129, DW_AT_TI_return
    1982            
    1983 000032 0110          RETA      ; [] 
    1984                    ; [] 
    1985                    .dwattr $C$DW$124, DW_AT_TI_end_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/rtc_a.c")
    1986                    .dwattr $C$DW$124, DW_AT_TI_end_line(0x10d)
    1987                    .dwattr $C$DW$124, DW_AT_TI_end_column(0x01)
    1988                    .dwendentry
    1989                    .dwendtag $C$DW$124
    1990            
    1991            
    1992            ;******************************************************************************
    1993            ;* BUILD ATTRIBUTES                                                           *
    1994            ;******************************************************************************
    1995                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1996                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111110000000
    1997                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
    1998                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    1999                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    2000                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    2001                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2002            
    2003            ;******************************************************************************
    2004            ;* TYPE INFORMATION                                                           *
    2005            ;******************************************************************************
    2006            
    2007            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2008                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    2009            $C$DW$130       .dwtag  DW_TAG_member
    2010                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$14)
    2011                    .dwattr $C$DW$130, DW_AT_name("__max_align1")
    2012                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("__max_align1")
    2013                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2015                    .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2016                    .dwattr $C$DW$130, DW_AT_decl_line(0x7b)
    2017                    .dwattr $C$DW$130, DW_AT_decl_column(0x0c)
    2018            
    2019            $C$DW$131       .dwtag  DW_TAG_member
    2020                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$18)
    2021                    .dwattr $C$DW$131, DW_AT_name("__max_align2")
    2022                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("__max_align2")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:50 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
rtc_a.asm                                                            PAGE   40

    2023                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2024                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2025                    .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2026                    .dwattr $C$DW$131, DW_AT_decl_line(0x7c)
    2027                    .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    2028            
    2029                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2030                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    2031                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2032                    .dwendtag $C$DW$T$21
    2033            
    2034            $C$DW$T$28      .dwtag  DW_TAG_typedef
    2035                    .dwattr $C$DW$T$28, DW_AT_name("__max_align_t")
    2036                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$21)
    2037                    .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2038                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2039                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x7d)
    2040                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    2041            
    2042            
    2043            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2044                    .dwattr $C$DW$T$26, DW_AT_name("Calendar")
    2045                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    2046            $C$DW$132       .dwtag  DW_TAG_member
    2047                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$23)
    2048                    .dwattr $C$DW$132, DW_AT_name("Seconds")
    2049                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("Seconds")
    2050                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2052                    .dwattr $C$DW$132, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2053                    .dwattr $C$DW$132, DW_AT_decl_line(0x3b)
    2054                    .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2055            
    2056            $C$DW$133       .dwtag  DW_TAG_member
    2057                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$23)
    2058                    .dwattr $C$DW$133, DW_AT_name("Minutes")
    2059                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("Minutes")
    2060                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2061                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2062                    .dwattr $C$DW$133, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2063                    .dwattr $C$DW$133, DW_AT_decl_line(0x3d)
    2064                    .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2065            
    2066            $C$DW$134       .dwtag  DW_TAG_member
    2067                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$23)
    2068                    .dwattr $C$DW$134, DW_AT_name("Hours")
    2069                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("Hours")
    2070                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2071                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2072                    .dwattr $C$DW$134, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2073                    .dwattr $C$DW$134, DW_AT_decl_line(0x3f)
    2074                    .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2075            
    2076            $C$DW$135       .dwtag  DW_TAG_member
    2077                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$23)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:50 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
rtc_a.asm                                                            PAGE   41

    2078                    .dwattr $C$DW$135, DW_AT_name("DayOfWeek")
    2079                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("DayOfWeek")
    2080                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2081                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2082                    .dwattr $C$DW$135, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2083                    .dwattr $C$DW$135, DW_AT_decl_line(0x41)
    2084                    .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2085            
    2086            $C$DW$136       .dwtag  DW_TAG_member
    2087                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$23)
    2088                    .dwattr $C$DW$136, DW_AT_name("DayOfMonth")
    2089                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("DayOfMonth")
    2090                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2091                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2092                    .dwattr $C$DW$136, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2093                    .dwattr $C$DW$136, DW_AT_decl_line(0x43)
    2094                    .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2095            
    2096            $C$DW$137       .dwtag  DW_TAG_member
    2097                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    2098                    .dwattr $C$DW$137, DW_AT_name("Month")
    2099                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("Month")
    2100                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2101                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2102                    .dwattr $C$DW$137, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2103                    .dwattr $C$DW$137, DW_AT_decl_line(0x45)
    2104                    .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2105            
    2106            $C$DW$138       .dwtag  DW_TAG_member
    2107                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$25)
    2108                    .dwattr $C$DW$138, DW_AT_name("Year")
    2109                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("Year")
    2110                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2111                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2112                    .dwattr $C$DW$138, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2113                    .dwattr $C$DW$138, DW_AT_decl_line(0x47)
    2114                    .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2115            
    2116                    .dwattr $C$DW$T$26, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2117                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x39)
    2118                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2119                    .dwendtag $C$DW$T$26
    2120            
    2121            $C$DW$T$29      .dwtag  DW_TAG_typedef
    2122                    .dwattr $C$DW$T$29, DW_AT_name("Calendar")
    2123                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    2124                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2125                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2126                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    2127                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    2128            
    2129            $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    2130                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2131                    .dwattr $C$DW$T$30, DW_AT_address_class(0x14)
    2132            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:50 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
rtc_a.asm                                                            PAGE   42

    2133            
    2134            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2135                    .dwattr $C$DW$T$27, DW_AT_name("RTC_A_configureCalendarAlarmParam")
    2136                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2137            $C$DW$139       .dwtag  DW_TAG_member
    2138                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    2139                    .dwattr $C$DW$139, DW_AT_name("minutesAlarm")
    2140                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("minutesAlarm")
    2141                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2143                    .dwattr $C$DW$139, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2144                    .dwattr $C$DW$139, DW_AT_decl_line(0x24)
    2145                    .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2146            
    2147            $C$DW$140       .dwtag  DW_TAG_member
    2148                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
    2149                    .dwattr $C$DW$140, DW_AT_name("hoursAlarm")
    2150                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("hoursAlarm")
    2151                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2152                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2153                    .dwattr $C$DW$140, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2154                    .dwattr $C$DW$140, DW_AT_decl_line(0x28)
    2155                    .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2156            
    2157            $C$DW$141       .dwtag  DW_TAG_member
    2158                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$23)
    2159                    .dwattr $C$DW$141, DW_AT_name("dayOfWeekAlarm")
    2160                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("dayOfWeekAlarm")
    2161                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2162                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2163                    .dwattr $C$DW$141, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2164                    .dwattr $C$DW$141, DW_AT_decl_line(0x2c)
    2165                    .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    2166            
    2167            $C$DW$142       .dwtag  DW_TAG_member
    2168                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$23)
    2169                    .dwattr $C$DW$142, DW_AT_name("dayOfMonthAlarm")
    2170                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("dayOfMonthAlarm")
    2171                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2172                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2173                    .dwattr $C$DW$142, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2174                    .dwattr $C$DW$142, DW_AT_decl_line(0x30)
    2175                    .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    2176            
    2177                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2178                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x20)
    2179                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2180                    .dwendtag $C$DW$T$27
    2181            
    2182            $C$DW$T$34      .dwtag  DW_TAG_typedef
    2183                    .dwattr $C$DW$T$34, DW_AT_name("RTC_A_configureCalendarAlarmParam")
    2184                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$27)
    2185                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2186                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\rtc_a.h")
    2187                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x31)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:50 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
rtc_a.asm                                                            PAGE   43

    2188                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
    2189            
    2190            $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2191                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2192                    .dwattr $C$DW$T$35, DW_AT_address_class(0x14)
    2193            
    2194            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2195                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2196            
    2197            
    2198            $C$DW$T$48      .dwtag  DW_TAG_subroutine_type
    2199                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2200                    .dwendtag $C$DW$T$48
    2201            
    2202            $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    2203                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2204                    .dwattr $C$DW$T$49, DW_AT_address_class(0x14)
    2205            
    2206            $C$DW$T$50      .dwtag  DW_TAG_typedef
    2207                    .dwattr $C$DW$T$50, DW_AT_name("__SFR_FARPTR")
    2208                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2209                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2210                    .dwattr $C$DW$T$50, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430f5438a.h"
    2211                    .dwattr $C$DW$T$50, DW_AT_decl_line(0x49)
    2212                    .dwattr $C$DW$T$50, DW_AT_decl_column(0x11)
    2213            
    2214            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2215                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2216                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2217                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2218            
    2219            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2220                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2221                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2222                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2223            
    2224            $C$DW$T$51      .dwtag  DW_TAG_typedef
    2225                    .dwattr $C$DW$T$51, DW_AT_name("__int8_t")
    2226                    .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$5)
    2227                    .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2228                    .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2229                    .dwattr $C$DW$T$51, DW_AT_decl_line(0x36)
