MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:52 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_a.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\opt430.exe C:\\Users\\MCourson\\
      13 000000               .sect   ".text:Timer_A_stop"
      14                    .clink
      15                    .global Timer_A_stop

    1967                    .clink
    1968                    .global Timer_A_clear
    1969            
    1970            $C$DW$132       .dwtag  DW_TAG_subprogram
    1971                    .dwattr $C$DW$132, DW_AT_name("Timer_A_clear")
    1972                    .dwattr $C$DW$132, DW_AT_low_pc(Timer_A_clear)
    1973                    .dwattr $C$DW$132, DW_AT_high_pc(0x00)
    1974                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("Timer_A_clear")
    1975                    .dwattr $C$DW$132, DW_AT_external
    1976                    .dwattr $C$DW$132, DW_AT_TI_begin_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_a.c")
    1977                    .dwattr $C$DW$132, DW_AT_TI_begin_line(0xc2)
    1978                    .dwattr $C$DW$132, DW_AT_TI_begin_column(0x06)
    1979                    .dwattr $C$DW$132, DW_AT_decl_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_a.c")
    1980                    .dwattr $C$DW$132, DW_AT_decl_line(0xc2)
    1981                    .dwattr $C$DW$132, DW_AT_decl_column(0x06)
    1982                    .dwattr $C$DW$132, DW_AT_TI_max_frame_size(0x04)
    1983                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_a.c",line 195,column 1,is_stmt,
    1984            
    1985                    .dwfde $C$DW$CIE, Timer_A_clear
    1986            $C$DW$133       .dwtag  DW_TAG_formal_parameter
    1987                    .dwattr $C$DW$133, DW_AT_name("baseAddress")
    1988                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("baseAddress")
    1989                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$23)
    1990                    .dwattr $C$DW$133, DW_AT_location[DW_OP_reg12]
    1991            
    1992            
    1993            ;*****************************************************************************
    1994            ;* FUNCTION NAME: Timer_A_clear                                              *
    1995            ;*                                                                           *
    1996            ;*   Regs Modified     : SP                                                  *
    1997            ;*   Regs Used         : SP,r12                                              *
    1998            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    1999            ;*****************************************************************************
    2000 000000       Timer_A_clear:
    2001            ;* --------------------------------------------------------------------------*
    2002                    .dwcfi  cfa_offset, 4
    2003                    .dwcfi  save_reg_to_mem, 16, -4
    2004            ;* r12   assigned to baseAddress
    2005            $C$DW$134       .dwtag  DW_TAG_variable
    2006                    .dwattr $C$DW$134, DW_AT_name("baseAddress")
    2007                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("baseAddress")
    2008                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$23)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   40

    2009                    .dwattr $C$DW$134, DW_AT_location[DW_OP_reg12]
    2010            
    2011                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_a.c",line 196,column 5,is_stmt,
    2012 000000 D2AC          OR.W      #4,0(r12)             ; [] |196| 
         000002 0000 
    2013                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_a.c",line 197,column 1,is_stmt,
    2014            $C$DW$135       .dwtag  DW_TAG_TI_branch
    2015                    .dwattr $C$DW$135, DW_AT_low_pc(0x00)
    2016                    .dwattr $C$DW$135, DW_AT_TI_return
    2017            
    2018 000004 0110          RETA      ; [] 
    2019                    ; [] 
    2020                    .dwattr $C$DW$132, DW_AT_TI_end_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_a.c")
    2021                    .dwattr $C$DW$132, DW_AT_TI_end_line(0xc5)
    2022                    .dwattr $C$DW$132, DW_AT_TI_end_column(0x01)
    2023                    .dwendentry
    2024                    .dwendtag $C$DW$132
    2025            
    2026            
    2027            ;******************************************************************************
    2028            ;* BUILD ATTRIBUTES                                                           *
    2029            ;******************************************************************************
    2030                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    2031                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111110000000
    2032                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
    2033                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    2034                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    2035                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    2036                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2037            
    2038            ;******************************************************************************
    2039            ;* TYPE INFORMATION                                                           *
    2040            ;******************************************************************************
    2041            
    2042            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2043                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    2044            $C$DW$136       .dwtag  DW_TAG_member
    2045                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$14)
    2046                    .dwattr $C$DW$136, DW_AT_name("__max_align1")
    2047                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("__max_align1")
    2048                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2049                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2050                    .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2051                    .dwattr $C$DW$136, DW_AT_decl_line(0x7b)
    2052                    .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    2053            
    2054            $C$DW$137       .dwtag  DW_TAG_member
    2055                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$18)
    2056                    .dwattr $C$DW$137, DW_AT_name("__max_align2")
    2057                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("__max_align2")
    2058                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2059                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2060                    .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2061                    .dwattr $C$DW$137, DW_AT_decl_line(0x7c)
    2062                    .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   41

    2063            
    2064                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2065                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    2066                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2067                    .dwendtag $C$DW$T$21
    2068            
    2069            $C$DW$T$31      .dwtag  DW_TAG_typedef
    2070                    .dwattr $C$DW$T$31, DW_AT_name("__max_align_t")
    2071                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
    2072                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2073                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2074                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
    2075                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    2076            
    2077            
    2078            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2079                    .dwattr $C$DW$T$24, DW_AT_name("Timer_A_initCaptureModeParam")
    2080                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    2081            $C$DW$138       .dwtag  DW_TAG_member
    2082                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    2083                    .dwattr $C$DW$138, DW_AT_name("captureRegister")
    2084                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("captureRegister")
    2085                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2087                    .dwattr $C$DW$138, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2088                    .dwattr $C$DW$138, DW_AT_decl_line(0x68)
    2089                    .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2090            
    2091            $C$DW$139       .dwtag  DW_TAG_member
    2092                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    2093                    .dwattr $C$DW$139, DW_AT_name("captureMode")
    2094                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("captureMode")
    2095                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2096                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2097                    .dwattr $C$DW$139, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2098                    .dwattr $C$DW$139, DW_AT_decl_line(0x6f)
    2099                    .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2100            
    2101            $C$DW$140       .dwtag  DW_TAG_member
    2102                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
    2103                    .dwattr $C$DW$140, DW_AT_name("captureInputSelect")
    2104                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("captureInputSelect")
    2105                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2106                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2107                    .dwattr $C$DW$140, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2108                    .dwattr $C$DW$140, DW_AT_decl_line(0x76)
    2109                    .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2110            
    2111            $C$DW$141       .dwtag  DW_TAG_member
    2112                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$23)
    2113                    .dwattr $C$DW$141, DW_AT_name("synchronizeCaptureSource")
    2114                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2115                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2116                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2117                    .dwattr $C$DW$141, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   42

    2118                    .dwattr $C$DW$141, DW_AT_decl_line(0x7b)
    2119                    .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2120            
    2121            $C$DW$142       .dwtag  DW_TAG_member
    2122                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$23)
    2123                    .dwattr $C$DW$142, DW_AT_name("captureInterruptEnable")
    2124                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("captureInterruptEnable")
    2125                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2126                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2127                    .dwattr $C$DW$142, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2128                    .dwattr $C$DW$142, DW_AT_decl_line(0x80)
    2129                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2130            
    2131            $C$DW$143       .dwtag  DW_TAG_member
    2132                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$23)
    2133                    .dwattr $C$DW$143, DW_AT_name("captureOutputMode")
    2134                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("captureOutputMode")
    2135                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2136                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2137                    .dwattr $C$DW$143, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2138                    .dwattr $C$DW$143, DW_AT_decl_line(0x8b)
    2139                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2140            
    2141                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2142                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x5d)
    2143                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2144                    .dwendtag $C$DW$T$24
    2145            
    2146            $C$DW$T$32      .dwtag  DW_TAG_typedef
    2147                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initCaptureModeParam")
    2148                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    2149                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2150                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2151                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x8c)
    2152                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2153            
    2154            $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2155                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2156                    .dwattr $C$DW$T$33, DW_AT_address_class(0x14)
    2157            
    2158            
    2159            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2160                    .dwattr $C$DW$T$25, DW_AT_name("Timer_A_initCompareModeParam")
    2161                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
    2162            $C$DW$144       .dwtag  DW_TAG_member
    2163                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$23)
    2164                    .dwattr $C$DW$144, DW_AT_name("compareRegister")
    2165                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("compareRegister")
    2166                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2168                    .dwattr $C$DW$144, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2169                    .dwattr $C$DW$144, DW_AT_decl_line(0x155)
    2170                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2171            
    2172            $C$DW$145       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   43

    2173                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$23)
    2174                    .dwattr $C$DW$145, DW_AT_name("compareInterruptEnable")
    2175                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("compareInterruptEnable")
    2176                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2177                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2178                    .dwattr $C$DW$145, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2179                    .dwattr $C$DW$145, DW_AT_decl_line(0x15a)
    2180                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2181            
    2182            $C$DW$146       .dwtag  DW_TAG_member
    2183                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$23)
    2184                    .dwattr $C$DW$146, DW_AT_name("compareOutputMode")
    2185                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("compareOutputMode")
    2186                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2187                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2188                    .dwattr $C$DW$146, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2189                    .dwattr $C$DW$146, DW_AT_decl_line(0x165)
    2190                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2191            
    2192            $C$DW$147       .dwtag  DW_TAG_member
    2193                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$23)
    2194                    .dwattr $C$DW$147, DW_AT_name("compareValue")
    2195                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("compareValue")
    2196                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2197                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2198                    .dwattr $C$DW$147, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2199                    .dwattr $C$DW$147, DW_AT_decl_line(0x167)
    2200                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2201            
    2202                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2203                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14a)
    2204                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2205                    .dwendtag $C$DW$T$25
    2206            
    2207            $C$DW$T$35      .dwtag  DW_TAG_typedef
    2208                    .dwattr $C$DW$T$35, DW_AT_name("Timer_A_initCompareModeParam")
    2209                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
    2210                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2211                    .dwattr $C$DW$T$35, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2212                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x168)
    2213                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2214            
    2215            $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    2216                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    2217                    .dwattr $C$DW$T$36, DW_AT_address_class(0x14)
    2218            
    2219            
    2220            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2221                    .dwattr $C$DW$T$27, DW_AT_name("Timer_A_initContinuousModeParam")
    2222                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2223            $C$DW$148       .dwtag  DW_TAG_member
    2224                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$23)
    2225                    .dwattr $C$DW$148, DW_AT_name("clockSource")
    2226                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("clockSource")
    2227                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   44

    2228                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2229                    .dwattr $C$DW$148, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2230                    .dwattr $C$DW$148, DW_AT_decl_line(0x30)
    2231                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2232            
    2233            $C$DW$149       .dwtag  DW_TAG_member
    2234                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$23)
    2235                    .dwattr $C$DW$149, DW_AT_name("clockSourceDivider")
    2236                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("clockSourceDivider")
    2237                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2238                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2239                    .dwattr $C$DW$149, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2240                    .dwattr $C$DW$149, DW_AT_decl_line(0x47)
    2241                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2242            
    2243            $C$DW$150       .dwtag  DW_TAG_member
    2244                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$23)
    2245                    .dwattr $C$DW$150, DW_AT_name("timerInterruptEnable_TAIE")
    2246                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2247                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2248                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2249                    .dwattr $C$DW$150, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2250                    .dwattr $C$DW$150, DW_AT_decl_line(0x4c)
    2251                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2252            
    2253            $C$DW$151       .dwtag  DW_TAG_member
    2254                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$23)
    2255                    .dwattr $C$DW$151, DW_AT_name("timerClear")
    2256                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("timerClear")
    2257                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2258                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2259                    .dwattr $C$DW$151, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2260                    .dwattr $C$DW$151, DW_AT_decl_line(0x52)
    2261                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2262            
    2263            $C$DW$152       .dwtag  DW_TAG_member
    2264                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$26)
    2265                    .dwattr $C$DW$152, DW_AT_name("startTimer")
    2266                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("startTimer")
    2267                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2268                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2269                    .dwattr $C$DW$152, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2270                    .dwattr $C$DW$152, DW_AT_decl_line(0x54)
    2271                    .dwattr $C$DW$152, DW_AT_decl_column(0x0a)
    2272            
    2273                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2274                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x29)
    2275                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2276                    .dwendtag $C$DW$T$27
    2277            
    2278            $C$DW$T$38      .dwtag  DW_TAG_typedef
    2279                    .dwattr $C$DW$T$38, DW_AT_name("Timer_A_initContinuousModeParam")
    2280                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$27)
    2281                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2282                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   45

    2283                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x55)
    2284                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    2285            
    2286            $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2287                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2288                    .dwattr $C$DW$T$39, DW_AT_address_class(0x14)
    2289            
    2290            
    2291            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2292                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initUpDownModeParam")
    2293                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    2294            $C$DW$153       .dwtag  DW_TAG_member
    2295                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$23)
    2296                    .dwattr $C$DW$153, DW_AT_name("clockSource")
    2297                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("clockSource")
    2298                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2299                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2300                    .dwattr $C$DW$153, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2301                    .dwattr $C$DW$153, DW_AT_decl_line(0x9b)
    2302                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2303            
    2304            $C$DW$154       .dwtag  DW_TAG_member
    2305                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
    2306                    .dwattr $C$DW$154, DW_AT_name("clockSourceDivider")
    2307                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("clockSourceDivider")
    2308                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2309                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2310                    .dwattr $C$DW$154, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2311                    .dwattr $C$DW$154, DW_AT_decl_line(0xb2)
    2312                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2313            
    2314            $C$DW$155       .dwtag  DW_TAG_member
    2315                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
    2316                    .dwattr $C$DW$155, DW_AT_name("timerPeriod")
    2317                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("timerPeriod")
    2318                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2319                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2320                    .dwattr $C$DW$155, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2321                    .dwattr $C$DW$155, DW_AT_decl_line(0xb4)
    2322                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2323            
    2324            $C$DW$156       .dwtag  DW_TAG_member
    2325                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    2326                    .dwattr $C$DW$156, DW_AT_name("timerInterruptEnable_TAIE")
    2327                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2328                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2329                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2330                    .dwattr $C$DW$156, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2331                    .dwattr $C$DW$156, DW_AT_decl_line(0xb9)
    2332                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2333            
    2334            $C$DW$157       .dwtag  DW_TAG_member
    2335                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    2336                    .dwattr $C$DW$157, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2337                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   46

    2338                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2339                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2340                    .dwattr $C$DW$157, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2341                    .dwattr $C$DW$157, DW_AT_decl_line(0xbe)
    2342                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2343            
    2344            $C$DW$158       .dwtag  DW_TAG_member
    2345                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
    2346                    .dwattr $C$DW$158, DW_AT_name("timerClear")
    2347                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("timerClear")
    2348                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2349                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2350                    .dwattr $C$DW$158, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2351                    .dwattr $C$DW$158, DW_AT_decl_line(0xc4)
    2352                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2353            
    2354            $C$DW$159       .dwtag  DW_TAG_member
    2355                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$26)
    2356                    .dwattr $C$DW$159, DW_AT_name("startTimer")
    2357                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("startTimer")
    2358                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2359                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2360                    .dwattr $C$DW$159, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2361                    .dwattr $C$DW$159, DW_AT_decl_line(0xc6)
    2362                    .dwattr $C$DW$159, DW_AT_decl_column(0x0a)
    2363            
    2364                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2365                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x94)
    2366                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2367                    .dwendtag $C$DW$T$28
    2368            
    2369            $C$DW$T$41      .dwtag  DW_TAG_typedef
    2370                    .dwattr $C$DW$T$41, DW_AT_name("Timer_A_initUpDownModeParam")
    2371                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
    2372                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2373                    .dwattr $C$DW$T$41, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2374                    .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2375                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2376            
    2377            $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2378                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2379                    .dwattr $C$DW$T$42, DW_AT_address_class(0x14)
    2380            
    2381            
    2382            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2383                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initUpModeParam")
    2384                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    2385            $C$DW$160       .dwtag  DW_TAG_member
    2386                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$23)
    2387                    .dwattr $C$DW$160, DW_AT_name("clockSource")
    2388                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("clockSource")
    2389                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2390                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2391                    .dwattr $C$DW$160, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2392                    .dwattr $C$DW$160, DW_AT_decl_line(0x115)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   47

    2393                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2394            
    2395            $C$DW$161       .dwtag  DW_TAG_member
    2396                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
    2397                    .dwattr $C$DW$161, DW_AT_name("clockSourceDivider")
    2398                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("clockSourceDivider")
    2399                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2400                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2401                    .dwattr $C$DW$161, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2402                    .dwattr $C$DW$161, DW_AT_decl_line(0x12c)
    2403                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    2404            
    2405            $C$DW$162       .dwtag  DW_TAG_member
    2406                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
    2407                    .dwattr $C$DW$162, DW_AT_name("timerPeriod")
    2408                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("timerPeriod")
    2409                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2410                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2411                    .dwattr $C$DW$162, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2412                    .dwattr $C$DW$162, DW_AT_decl_line(0x12f)
    2413                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    2414            
    2415            $C$DW$163       .dwtag  DW_TAG_member
    2416                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    2417                    .dwattr $C$DW$163, DW_AT_name("timerInterruptEnable_TAIE")
    2418                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2419                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2420                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2421                    .dwattr $C$DW$163, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2422                    .dwattr $C$DW$163, DW_AT_decl_line(0x134)
    2423                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    2424            
    2425            $C$DW$164       .dwtag  DW_TAG_member
    2426                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    2427                    .dwattr $C$DW$164, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2428                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2429                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2430                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2431                    .dwattr $C$DW$164, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2432                    .dwattr $C$DW$164, DW_AT_decl_line(0x139)
    2433                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    2434            
    2435            $C$DW$165       .dwtag  DW_TAG_member
    2436                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    2437                    .dwattr $C$DW$165, DW_AT_name("timerClear")
    2438                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("timerClear")
    2439                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2440                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2441                    .dwattr $C$DW$165, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2442                    .dwattr $C$DW$165, DW_AT_decl_line(0x13f)
    2443                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2444            
    2445            $C$DW$166       .dwtag  DW_TAG_member
    2446                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$26)
    2447                    .dwattr $C$DW$166, DW_AT_name("startTimer")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   48

    2448                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("startTimer")
    2449                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2450                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2451                    .dwattr $C$DW$166, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2452                    .dwattr $C$DW$166, DW_AT_decl_line(0x141)
    2453                    .dwattr $C$DW$166, DW_AT_decl_column(0x0a)
    2454            
    2455                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2456                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x10e)
    2457                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2458                    .dwendtag $C$DW$T$29
    2459            
    2460            $C$DW$T$44      .dwtag  DW_TAG_typedef
    2461                    .dwattr $C$DW$T$44, DW_AT_name("Timer_A_initUpModeParam")
    2462                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$29)
    2463                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2464                    .dwattr $C$DW$T$44, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2465                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x142)
    2466                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    2467            
    2468            $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2469                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2470                    .dwattr $C$DW$T$45, DW_AT_address_class(0x14)
    2471            
    2472            
    2473            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2474                    .dwattr $C$DW$T$30, DW_AT_name("Timer_A_outputPWMParam")
    2475                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
    2476            $C$DW$167       .dwtag  DW_TAG_member
    2477                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    2478                    .dwattr $C$DW$167, DW_AT_name("clockSource")
    2479                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("clockSource")
    2480                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2482                    .dwattr $C$DW$167, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2483                    .dwattr $C$DW$167, DW_AT_decl_line(0xd5)
    2484                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    2485            
    2486            $C$DW$168       .dwtag  DW_TAG_member
    2487                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
    2488                    .dwattr $C$DW$168, DW_AT_name("clockSourceDivider")
    2489                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("clockSourceDivider")
    2490                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2491                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2492                    .dwattr $C$DW$168, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2493                    .dwattr $C$DW$168, DW_AT_decl_line(0xec)
    2494                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    2495            
    2496            $C$DW$169       .dwtag  DW_TAG_member
    2497                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    2498                    .dwattr $C$DW$169, DW_AT_name("timerPeriod")
    2499                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("timerPeriod")
    2500                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2501                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2502                    .dwattr $C$DW$169, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   49

    2503                    .dwattr $C$DW$169, DW_AT_decl_line(0xee)
    2504                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    2505            
    2506            $C$DW$170       .dwtag  DW_TAG_member
    2507                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    2508                    .dwattr $C$DW$170, DW_AT_name("compareRegister")
    2509                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("compareRegister")
    2510                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2511                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2512                    .dwattr $C$DW$170, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2513                    .dwattr $C$DW$170, DW_AT_decl_line(0xf9)
    2514                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    2515            
    2516            $C$DW$171       .dwtag  DW_TAG_member
    2517                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    2518                    .dwattr $C$DW$171, DW_AT_name("compareOutputMode")
    2519                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("compareOutputMode")
    2520                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2521                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2522                    .dwattr $C$DW$171, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2523                    .dwattr $C$DW$171, DW_AT_decl_line(0x104)
    2524                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    2525            
    2526            $C$DW$172       .dwtag  DW_TAG_member
    2527                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
    2528                    .dwattr $C$DW$172, DW_AT_name("dutyCycle")
    2529                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("dutyCycle")
    2530                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2531                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2532                    .dwattr $C$DW$172, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2533                    .dwattr $C$DW$172, DW_AT_decl_line(0x106)
    2534                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    2535            
    2536                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2537                    .dwattr $C$DW$T$30, DW_AT_decl_line(0xce)
    2538                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    2539                    .dwendtag $C$DW$T$30
    2540            
    2541            $C$DW$T$47      .dwtag  DW_TAG_typedef
    2542                    .dwattr $C$DW$T$47, DW_AT_name("Timer_A_outputPWMParam")
    2543                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$30)
    2544                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2545                    .dwattr $C$DW$T$47, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_a.h")
    2546                    .dwattr $C$DW$T$47, DW_AT_decl_line(0x107)
    2547                    .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2548            
    2549            $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    2550                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2551                    .dwattr $C$DW$T$48, DW_AT_address_class(0x14)
    2552            
    2553            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2554                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2555            
    2556            
    2557            $C$DW$T$62      .dwtag  DW_TAG_subroutine_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:52 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   50

    2558                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2559                    .dwendtag $C$DW$T$62
    2560            
    2561            $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    2562                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    2563                    .dwattr $C$DW$T$63, DW_AT_address_class(0x14)
    2564            
    2565            $C$DW$T$64      .dwtag  DW_TAG_typedef
    2566                    .dwattr $C$DW$T$64, DW_AT_name("__SFR_FARPTR")
    2567                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2568                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2569                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430f5438a.h"
    2570                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x49)
    2571                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x11)
    2572            
    2573            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2574                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2575                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2576                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2577            
    2578            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2579                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2580                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2581                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2582            
    2583            $C$DW$T$65      .dwtag  DW_TAG_typedef
    2584                    .dwattr $C$DW$T$65, DW_AT_name("__int8_t")
    2585                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$5)
    2586                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2587                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2588                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x36)
