MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:52 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\opt430.exe C:\\Users\\MCourson\\
      13 000000               .sect   ".text:Timer_B_stop"
      14                    .clink
      15                    .global Timer_B_stop

    2211                    .dwattr $C$DW$152, DW_AT_name("Timer_B_clear")
    2212                    .dwattr $C$DW$152, DW_AT_low_pc(Timer_B_clear)
    2213                    .dwattr $C$DW$152, DW_AT_high_pc(0x00)
    2214                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("Timer_B_clear")
    2215                    .dwattr $C$DW$152, DW_AT_external
    2216                    .dwattr $C$DW$152, DW_AT_TI_begin_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
    2217                    .dwattr $C$DW$152, DW_AT_TI_begin_line(0xc8)
    2218                    .dwattr $C$DW$152, DW_AT_TI_begin_column(0x06)
    2219                    .dwattr $C$DW$152, DW_AT_decl_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
    2220                    .dwattr $C$DW$152, DW_AT_decl_line(0xc8)
    2221                    .dwattr $C$DW$152, DW_AT_decl_column(0x06)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   44

    2222                    .dwattr $C$DW$152, DW_AT_TI_max_frame_size(0x04)
    2223                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 201,column 1,is_stmt,
    2224            
    2225                    .dwfde $C$DW$CIE, Timer_B_clear
    2226            $C$DW$153       .dwtag  DW_TAG_formal_parameter
    2227                    .dwattr $C$DW$153, DW_AT_name("baseAddress")
    2228                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("baseAddress")
    2229                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$23)
    2230                    .dwattr $C$DW$153, DW_AT_location[DW_OP_reg12]
    2231            
    2232            
    2233            ;*****************************************************************************
    2234            ;* FUNCTION NAME: Timer_B_clear                                              *
    2235            ;*                                                                           *
    2236            ;*   Regs Modified     : SP                                                  *
    2237            ;*   Regs Used         : SP,r12                                              *
    2238            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    2239            ;*****************************************************************************
    2240 000000       Timer_B_clear:
    2241            ;* --------------------------------------------------------------------------*
    2242                    .dwcfi  cfa_offset, 4
    2243                    .dwcfi  save_reg_to_mem, 16, -4
    2244            ;* r12   assigned to baseAddress
    2245            $C$DW$154       .dwtag  DW_TAG_variable
    2246                    .dwattr $C$DW$154, DW_AT_name("baseAddress")
    2247                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("baseAddress")
    2248                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
    2249                    .dwattr $C$DW$154, DW_AT_location[DW_OP_reg12]
    2250            
    2251                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 202,column 5,is_stmt,
    2252 000000 D2AC          OR.W      #4,0(r12)             ; [] |202| 
         000002 0000 
    2253                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c",line 203,column 1,is_stmt,
    2254            $C$DW$155       .dwtag  DW_TAG_TI_branch
    2255                    .dwattr $C$DW$155, DW_AT_low_pc(0x00)
    2256                    .dwattr $C$DW$155, DW_AT_TI_return
    2257            
    2258 000004 0110          RETA      ; [] 
    2259                    ; [] 
    2260                    .dwattr $C$DW$152, DW_AT_TI_end_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/timer_b.c")
    2261                    .dwattr $C$DW$152, DW_AT_TI_end_line(0xcb)
    2262                    .dwattr $C$DW$152, DW_AT_TI_end_column(0x01)
    2263                    .dwendentry
    2264                    .dwendtag $C$DW$152
    2265            
    2266            
    2267            ;******************************************************************************
    2268            ;* BUILD ATTRIBUTES                                                           *
    2269            ;******************************************************************************
    2270                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    2271                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111110000000
    2272                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
    2273                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    2274                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    2275                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   45

    2276                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2277            
    2278            ;******************************************************************************
    2279            ;* TYPE INFORMATION                                                           *
    2280            ;******************************************************************************
    2281            
    2282            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2283                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    2284            $C$DW$156       .dwtag  DW_TAG_member
    2285                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$14)
    2286                    .dwattr $C$DW$156, DW_AT_name("__max_align1")
    2287                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("__max_align1")
    2288                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2289                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2290                    .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2291                    .dwattr $C$DW$156, DW_AT_decl_line(0x7b)
    2292                    .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    2293            
    2294            $C$DW$157       .dwtag  DW_TAG_member
    2295                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$18)
    2296                    .dwattr $C$DW$157, DW_AT_name("__max_align2")
    2297                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("__max_align2")
    2298                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2299                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2300                    .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2301                    .dwattr $C$DW$157, DW_AT_decl_line(0x7c)
    2302                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2303            
    2304                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2305                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    2306                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2307                    .dwendtag $C$DW$T$21
    2308            
    2309            $C$DW$T$31      .dwtag  DW_TAG_typedef
    2310                    .dwattr $C$DW$T$31, DW_AT_name("__max_align_t")
    2311                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
    2312                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2313                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2314                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
    2315                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    2316            
    2317            
    2318            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2319                    .dwattr $C$DW$T$24, DW_AT_name("Timer_B_initCaptureModeParam")
    2320                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    2321            $C$DW$158       .dwtag  DW_TAG_member
    2322                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
    2323                    .dwattr $C$DW$158, DW_AT_name("captureRegister")
    2324                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("captureRegister")
    2325                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2326                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2327                    .dwattr $C$DW$158, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2328                    .dwattr $C$DW$158, DW_AT_decl_line(0xaf)
    2329                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2330            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   46

    2331            $C$DW$159       .dwtag  DW_TAG_member
    2332                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    2333                    .dwattr $C$DW$159, DW_AT_name("captureMode")
    2334                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("captureMode")
    2335                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2336                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2337                    .dwattr $C$DW$159, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2338                    .dwattr $C$DW$159, DW_AT_decl_line(0xb6)
    2339                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2340            
    2341            $C$DW$160       .dwtag  DW_TAG_member
    2342                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$23)
    2343                    .dwattr $C$DW$160, DW_AT_name("captureInputSelect")
    2344                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("captureInputSelect")
    2345                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2346                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2347                    .dwattr $C$DW$160, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2348                    .dwattr $C$DW$160, DW_AT_decl_line(0xbd)
    2349                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2350            
    2351            $C$DW$161       .dwtag  DW_TAG_member
    2352                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
    2353                    .dwattr $C$DW$161, DW_AT_name("synchronizeCaptureSource")
    2354                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2355                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2356                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2357                    .dwattr $C$DW$161, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2358                    .dwattr $C$DW$161, DW_AT_decl_line(0xc2)
    2359                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    2360            
    2361            $C$DW$162       .dwtag  DW_TAG_member
    2362                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
    2363                    .dwattr $C$DW$162, DW_AT_name("captureInterruptEnable")
    2364                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("captureInterruptEnable")
    2365                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2366                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2367                    .dwattr $C$DW$162, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2368                    .dwattr $C$DW$162, DW_AT_decl_line(0xc7)
    2369                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    2370            
    2371            $C$DW$163       .dwtag  DW_TAG_member
    2372                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    2373                    .dwattr $C$DW$163, DW_AT_name("captureOutputMode")
    2374                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("captureOutputMode")
    2375                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2376                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2377                    .dwattr $C$DW$163, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2378                    .dwattr $C$DW$163, DW_AT_decl_line(0xd2)
    2379                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    2380            
    2381                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2382                    .dwattr $C$DW$T$24, DW_AT_decl_line(0xa4)
    2383                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2384                    .dwendtag $C$DW$T$24
    2385            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   47

    2386            $C$DW$T$32      .dwtag  DW_TAG_typedef
    2387                    .dwattr $C$DW$T$32, DW_AT_name("Timer_B_initCaptureModeParam")
    2388                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    2389                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2390                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2391                    .dwattr $C$DW$T$32, DW_AT_decl_line(0xd3)
    2392                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2393            
    2394            $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2395                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2396                    .dwattr $C$DW$T$33, DW_AT_address_class(0x14)
    2397            
    2398            
    2399            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2400                    .dwattr $C$DW$T$25, DW_AT_name("Timer_B_initCompareModeParam")
    2401                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
    2402            $C$DW$164       .dwtag  DW_TAG_member
    2403                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    2404                    .dwattr $C$DW$164, DW_AT_name("compareRegister")
    2405                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("compareRegister")
    2406                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2407                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2408                    .dwattr $C$DW$164, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2409                    .dwattr $C$DW$164, DW_AT_decl_line(0x155)
    2410                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    2411            
    2412            $C$DW$165       .dwtag  DW_TAG_member
    2413                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    2414                    .dwattr $C$DW$165, DW_AT_name("compareInterruptEnable")
    2415                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("compareInterruptEnable")
    2416                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2417                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2418                    .dwattr $C$DW$165, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2419                    .dwattr $C$DW$165, DW_AT_decl_line(0x15a)
    2420                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2421            
    2422            $C$DW$166       .dwtag  DW_TAG_member
    2423                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
    2424                    .dwattr $C$DW$166, DW_AT_name("compareOutputMode")
    2425                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("compareOutputMode")
    2426                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2427                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2428                    .dwattr $C$DW$166, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2429                    .dwattr $C$DW$166, DW_AT_decl_line(0x165)
    2430                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    2431            
    2432            $C$DW$167       .dwtag  DW_TAG_member
    2433                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    2434                    .dwattr $C$DW$167, DW_AT_name("compareValue")
    2435                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("compareValue")
    2436                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2437                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2438                    .dwattr $C$DW$167, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2439                    .dwattr $C$DW$167, DW_AT_decl_line(0x167)
    2440                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   48

    2441            
    2442                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2443                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14a)
    2444                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2445                    .dwendtag $C$DW$T$25
    2446            
    2447            $C$DW$T$35      .dwtag  DW_TAG_typedef
    2448                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCompareModeParam")
    2449                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
    2450                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2451                    .dwattr $C$DW$T$35, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2452                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x168)
    2453                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2454            
    2455            $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    2456                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    2457                    .dwattr $C$DW$T$36, DW_AT_address_class(0x14)
    2458            
    2459            
    2460            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2461                    .dwattr $C$DW$T$27, DW_AT_name("Timer_B_initContinuousModeParam")
    2462                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2463            $C$DW$168       .dwtag  DW_TAG_member
    2464                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
    2465                    .dwattr $C$DW$168, DW_AT_name("clockSource")
    2466                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("clockSource")
    2467                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2468                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2469                    .dwattr $C$DW$168, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2470                    .dwattr $C$DW$168, DW_AT_decl_line(0xe2)
    2471                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    2472            
    2473            $C$DW$169       .dwtag  DW_TAG_member
    2474                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    2475                    .dwattr $C$DW$169, DW_AT_name("clockSourceDivider")
    2476                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("clockSourceDivider")
    2477                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2478                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2479                    .dwattr $C$DW$169, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2480                    .dwattr $C$DW$169, DW_AT_decl_line(0xf9)
    2481                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    2482            
    2483            $C$DW$170       .dwtag  DW_TAG_member
    2484                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    2485                    .dwattr $C$DW$170, DW_AT_name("timerInterruptEnable_TBIE")
    2486                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2487                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2488                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2489                    .dwattr $C$DW$170, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2490                    .dwattr $C$DW$170, DW_AT_decl_line(0xfe)
    2491                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    2492            
    2493            $C$DW$171       .dwtag  DW_TAG_member
    2494                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    2495                    .dwattr $C$DW$171, DW_AT_name("timerClear")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   49

    2496                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("timerClear")
    2497                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2498                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2499                    .dwattr $C$DW$171, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2500                    .dwattr $C$DW$171, DW_AT_decl_line(0x104)
    2501                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    2502            
    2503            $C$DW$172       .dwtag  DW_TAG_member
    2504                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$26)
    2505                    .dwattr $C$DW$172, DW_AT_name("startTimer")
    2506                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("startTimer")
    2507                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2508                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2509                    .dwattr $C$DW$172, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2510                    .dwattr $C$DW$172, DW_AT_decl_line(0x106)
    2511                    .dwattr $C$DW$172, DW_AT_decl_column(0x0a)
    2512            
    2513                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2514                    .dwattr $C$DW$T$27, DW_AT_decl_line(0xdb)
    2515                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2516                    .dwendtag $C$DW$T$27
    2517            
    2518            $C$DW$T$38      .dwtag  DW_TAG_typedef
    2519                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initContinuousModeParam")
    2520                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$27)
    2521                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2522                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2523                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x107)
    2524                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    2525            
    2526            $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2527                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2528                    .dwattr $C$DW$T$39, DW_AT_address_class(0x14)
    2529            
    2530            
    2531            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2532                    .dwattr $C$DW$T$28, DW_AT_name("Timer_B_initUpDownModeParam")
    2533                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    2534            $C$DW$173       .dwtag  DW_TAG_member
    2535                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    2536                    .dwattr $C$DW$173, DW_AT_name("clockSource")
    2537                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("clockSource")
    2538                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2539                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2540                    .dwattr $C$DW$173, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2541                    .dwattr $C$DW$173, DW_AT_decl_line(0x116)
    2542                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    2543            
    2544            $C$DW$174       .dwtag  DW_TAG_member
    2545                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    2546                    .dwattr $C$DW$174, DW_AT_name("clockSourceDivider")
    2547                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("clockSourceDivider")
    2548                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2549                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2550                    .dwattr $C$DW$174, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   50

    2551                    .dwattr $C$DW$174, DW_AT_decl_line(0x12d)
    2552                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    2553            
    2554            $C$DW$175       .dwtag  DW_TAG_member
    2555                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2556                    .dwattr $C$DW$175, DW_AT_name("timerPeriod")
    2557                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("timerPeriod")
    2558                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2559                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2560                    .dwattr $C$DW$175, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2561                    .dwattr $C$DW$175, DW_AT_decl_line(0x12f)
    2562                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    2563            
    2564            $C$DW$176       .dwtag  DW_TAG_member
    2565                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
    2566                    .dwattr $C$DW$176, DW_AT_name("timerInterruptEnable_TBIE")
    2567                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2568                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2569                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2570                    .dwattr $C$DW$176, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2571                    .dwattr $C$DW$176, DW_AT_decl_line(0x134)
    2572                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    2573            
    2574            $C$DW$177       .dwtag  DW_TAG_member
    2575                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2576                    .dwattr $C$DW$177, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2577                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2578                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2579                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2580                    .dwattr $C$DW$177, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2581                    .dwattr $C$DW$177, DW_AT_decl_line(0x139)
    2582                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    2583            
    2584            $C$DW$178       .dwtag  DW_TAG_member
    2585                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
    2586                    .dwattr $C$DW$178, DW_AT_name("timerClear")
    2587                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("timerClear")
    2588                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2589                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2590                    .dwattr $C$DW$178, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2591                    .dwattr $C$DW$178, DW_AT_decl_line(0x13f)
    2592                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2593            
    2594            $C$DW$179       .dwtag  DW_TAG_member
    2595                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$26)
    2596                    .dwattr $C$DW$179, DW_AT_name("startTimer")
    2597                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("startTimer")
    2598                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2599                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2600                    .dwattr $C$DW$179, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2601                    .dwattr $C$DW$179, DW_AT_decl_line(0x141)
    2602                    .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2603            
    2604                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2605                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x10f)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   51

    2606                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2607                    .dwendtag $C$DW$T$28
    2608            
    2609            $C$DW$T$41      .dwtag  DW_TAG_typedef
    2610                    .dwattr $C$DW$T$41, DW_AT_name("Timer_B_initUpDownModeParam")
    2611                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
    2612                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2613                    .dwattr $C$DW$T$41, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2614                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x142)
    2615                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2616            
    2617            $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2618                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2619                    .dwattr $C$DW$T$42, DW_AT_address_class(0x14)
    2620            
    2621            
    2622            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2623                    .dwattr $C$DW$T$29, DW_AT_name("Timer_B_initUpModeParam")
    2624                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    2625            $C$DW$180       .dwtag  DW_TAG_member
    2626                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
    2627                    .dwattr $C$DW$180, DW_AT_name("clockSource")
    2628                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("clockSource")
    2629                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2630                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2631                    .dwattr $C$DW$180, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2632                    .dwattr $C$DW$180, DW_AT_decl_line(0x6f)
    2633                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2634            
    2635            $C$DW$181       .dwtag  DW_TAG_member
    2636                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$23)
    2637                    .dwattr $C$DW$181, DW_AT_name("clockSourceDivider")
    2638                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("clockSourceDivider")
    2639                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2640                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2641                    .dwattr $C$DW$181, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2642                    .dwattr $C$DW$181, DW_AT_decl_line(0x86)
    2643                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    2644            
    2645            $C$DW$182       .dwtag  DW_TAG_member
    2646                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$23)
    2647                    .dwattr $C$DW$182, DW_AT_name("timerPeriod")
    2648                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("timerPeriod")
    2649                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2650                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2651                    .dwattr $C$DW$182, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2652                    .dwattr $C$DW$182, DW_AT_decl_line(0x89)
    2653                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    2654            
    2655            $C$DW$183       .dwtag  DW_TAG_member
    2656                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$23)
    2657                    .dwattr $C$DW$183, DW_AT_name("timerInterruptEnable_TBIE")
    2658                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2659                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2660                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   52

    2661                    .dwattr $C$DW$183, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2662                    .dwattr $C$DW$183, DW_AT_decl_line(0x8e)
    2663                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    2664            
    2665            $C$DW$184       .dwtag  DW_TAG_member
    2666                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
    2667                    .dwattr $C$DW$184, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2668                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2669                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2670                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2671                    .dwattr $C$DW$184, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2672                    .dwattr $C$DW$184, DW_AT_decl_line(0x93)
    2673                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    2674            
    2675            $C$DW$185       .dwtag  DW_TAG_member
    2676                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
    2677                    .dwattr $C$DW$185, DW_AT_name("timerClear")
    2678                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("timerClear")
    2679                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2680                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2681                    .dwattr $C$DW$185, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2682                    .dwattr $C$DW$185, DW_AT_decl_line(0x99)
    2683                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    2684            
    2685            $C$DW$186       .dwtag  DW_TAG_member
    2686                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$26)
    2687                    .dwattr $C$DW$186, DW_AT_name("startTimer")
    2688                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("startTimer")
    2689                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2690                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2691                    .dwattr $C$DW$186, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2692                    .dwattr $C$DW$186, DW_AT_decl_line(0x9b)
    2693                    .dwattr $C$DW$186, DW_AT_decl_column(0x0a)
    2694            
    2695                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2696                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x68)
    2697                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2698                    .dwendtag $C$DW$T$29
    2699            
    2700            $C$DW$T$44      .dwtag  DW_TAG_typedef
    2701                    .dwattr $C$DW$T$44, DW_AT_name("Timer_B_initUpModeParam")
    2702                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$29)
    2703                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2704                    .dwattr $C$DW$T$44, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2705                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x9c)
    2706                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    2707            
    2708            $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2709                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2710                    .dwattr $C$DW$T$45, DW_AT_address_class(0x14)
    2711            
    2712            
    2713            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2714                    .dwattr $C$DW$T$30, DW_AT_name("Timer_B_outputPWMParam")
    2715                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   53

    2716            $C$DW$187       .dwtag  DW_TAG_member
    2717                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
    2718                    .dwattr $C$DW$187, DW_AT_name("clockSource")
    2719                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("clockSource")
    2720                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2722                    .dwattr $C$DW$187, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2723                    .dwattr $C$DW$187, DW_AT_decl_line(0x2f)
    2724                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    2725            
    2726            $C$DW$188       .dwtag  DW_TAG_member
    2727                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$23)
    2728                    .dwattr $C$DW$188, DW_AT_name("clockSourceDivider")
    2729                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("clockSourceDivider")
    2730                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2731                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2732                    .dwattr $C$DW$188, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2733                    .dwattr $C$DW$188, DW_AT_decl_line(0x46)
    2734                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    2735            
    2736            $C$DW$189       .dwtag  DW_TAG_member
    2737                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
    2738                    .dwattr $C$DW$189, DW_AT_name("timerPeriod")
    2739                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("timerPeriod")
    2740                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2741                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2742                    .dwattr $C$DW$189, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2743                    .dwattr $C$DW$189, DW_AT_decl_line(0x48)
    2744                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2745            
    2746            $C$DW$190       .dwtag  DW_TAG_member
    2747                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$23)
    2748                    .dwattr $C$DW$190, DW_AT_name("compareRegister")
    2749                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("compareRegister")
    2750                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2751                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2752                    .dwattr $C$DW$190, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2753                    .dwattr $C$DW$190, DW_AT_decl_line(0x53)
    2754                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    2755            
    2756            $C$DW$191       .dwtag  DW_TAG_member
    2757                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$23)
    2758                    .dwattr $C$DW$191, DW_AT_name("compareOutputMode")
    2759                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("compareOutputMode")
    2760                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2761                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2762                    .dwattr $C$DW$191, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2763                    .dwattr $C$DW$191, DW_AT_decl_line(0x5e)
    2764                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    2765            
    2766            $C$DW$192       .dwtag  DW_TAG_member
    2767                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$23)
    2768                    .dwattr $C$DW$192, DW_AT_name("dutyCycle")
    2769                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("dutyCycle")
    2770                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   54

    2771                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2772                    .dwattr $C$DW$192, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2773                    .dwattr $C$DW$192, DW_AT_decl_line(0x60)
    2774                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    2775            
    2776                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2777                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x28)
    2778                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    2779                    .dwendtag $C$DW$T$30
    2780            
    2781            $C$DW$T$47      .dwtag  DW_TAG_typedef
    2782                    .dwattr $C$DW$T$47, DW_AT_name("Timer_B_outputPWMParam")
    2783                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$30)
    2784                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2785                    .dwattr $C$DW$T$47, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\timer_b.h")
    2786                    .dwattr $C$DW$T$47, DW_AT_decl_line(0x61)
    2787                    .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2788            
    2789            $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    2790                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2791                    .dwattr $C$DW$T$48, DW_AT_address_class(0x14)
    2792            
    2793            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2794                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2795            
    2796            
    2797            $C$DW$T$59      .dwtag  DW_TAG_subroutine_type
    2798                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2799                    .dwendtag $C$DW$T$59
    2800            
    2801            $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2802                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2803                    .dwattr $C$DW$T$60, DW_AT_address_class(0x14)
    2804            
    2805            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2806                    .dwattr $C$DW$T$61, DW_AT_name("__SFR_FARPTR")
    2807                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2808                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2809                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430f5438a.h"
    2810                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x49)
    2811                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x11)
    2812            
    2813            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2814                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2815                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2816                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2817            
    2818            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2819                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2820                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2821                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2822            
    2823            $C$DW$T$62      .dwtag  DW_TAG_typedef
    2824                    .dwattr $C$DW$T$62, DW_AT_name("__int8_t")
    2825                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$5)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:53 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_b.asm                                                          PAGE   55

    2826                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
