MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
usci_a_uart.asm                                                      PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:54 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MP430DriverLib/driverlib/MSP430F5xx_6xx/usci_a_uart.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\opt430.exe C:\\Users\\MCourson\\
      13 000000               .sect   ".text:USCI_A_UART_transmitData"
      14                    .clink

    1260                    .dwattr $C$DW$74, DW_AT_TI_begin_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/usci_a_uart.
    1261                    .dwattr $C$DW$74, DW_AT_TI_begin_line(0x8f)
    1262                    .dwattr $C$DW$74, DW_AT_TI_begin_column(0x06)
    1263                    .dwattr $C$DW$74, DW_AT_decl_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/usci_a_uart.c")
    1264                    .dwattr $C$DW$74, DW_AT_decl_line(0x8f)
    1265                    .dwattr $C$DW$74, DW_AT_decl_column(0x06)
    1266                    .dwattr $C$DW$74, DW_AT_TI_max_frame_size(0x04)
    1267                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/usci_a_uart.c",line 144,column 1,is_s
    1268            
    1269                    .dwfde $C$DW$CIE, USCI_A_UART_clearInterrupt
    1270            $C$DW$75        .dwtag  DW_TAG_formal_parameter
    1271                    .dwattr $C$DW$75, DW_AT_name("baseAddress")
    1272                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("baseAddress")
    1273                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$25)
    1274                    .dwattr $C$DW$75, DW_AT_location[DW_OP_reg12]
    1275            
    1276            $C$DW$76        .dwtag  DW_TAG_formal_parameter
    1277                    .dwattr $C$DW$76, DW_AT_name("mask")
    1278                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("mask")
    1279                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
    1280                    .dwattr $C$DW$76, DW_AT_location[DW_OP_reg13]
    1281            
    1282            
    1283            ;*****************************************************************************
    1284            ;* FUNCTION NAME: USCI_A_UART_clearInterrupt                                 *
    1285            ;*                                                                           *
    1286            ;*   Regs Modified     : SP,SR,r12,r15                                       *
    1287            ;*   Regs Used         : SP,SR,r12,r13,r15                                   *
    1288            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    1289            ;*****************************************************************************
    1290 000000       USCI_A_UART_clearInterrupt:
    1291            ;* --------------------------------------------------------------------------*
    1292                    .dwcfi  cfa_offset, 4
    1293                    .dwcfi  save_reg_to_mem, 16, -4
    1294            ;* r13   assigned to mask
    1295            $C$DW$77        .dwtag  DW_TAG_variable
    1296                    .dwattr $C$DW$77, DW_AT_name("mask")
    1297                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("mask")
    1298                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
    1299                    .dwattr $C$DW$77, DW_AT_location[DW_OP_reg13]
    1300            
    1301                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/usci_a_uart.c",line 146,column 5,is_s
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
usci_a_uart.asm                                                      PAGE   26

    1302 000000 503C          ADD.W     #29,r12               ; [] |146| 
         000002 001D 
    1303 000004 4C0F          MOV.W     r12,r15               ; [] |146| 
    1304 000006 CDCF          BIC.B     r13,0(r15)            ; [] |146| 
         000008 0000 
    1305                    .dwpsn  file "../MP430DriverLib/driverlib/MSP430F5xx_6xx/usci_a_uart.c",line 147,column 1,is_s
    1306            $C$DW$78        .dwtag  DW_TAG_TI_branch
    1307                    .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1308                    .dwattr $C$DW$78, DW_AT_TI_return
    1309            
    1310 00000a 0110          RETA      ; [] 
    1311                    ; [] 
    1312                    .dwattr $C$DW$74, DW_AT_TI_end_file("../MP430DriverLib/driverlib/MSP430F5xx_6xx/usci_a_uart.c"
    1313                    .dwattr $C$DW$74, DW_AT_TI_end_line(0x93)
    1314                    .dwattr $C$DW$74, DW_AT_TI_end_column(0x01)
    1315                    .dwendentry
    1316                    .dwendtag $C$DW$74
    1317            
    1318            
    1319            ;******************************************************************************
    1320            ;* BUILD ATTRIBUTES                                                           *
    1321            ;******************************************************************************
    1322                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1323                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111110000000
    1324                    .battr "TI", Tag_File, 1, Tag_LEA_INFO(1)
    1325                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    1326                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1327                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    1328                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    1329            
    1330            ;******************************************************************************
    1331            ;* TYPE INFORMATION                                                           *
    1332            ;******************************************************************************
    1333            
    1334            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1335                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1336            $C$DW$79        .dwtag  DW_TAG_member
    1337                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$14)
    1338                    .dwattr $C$DW$79, DW_AT_name("__max_align1")
    1339                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("__max_align1")
    1340                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1342                    .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1343                    .dwattr $C$DW$79, DW_AT_decl_line(0x7b)
    1344                    .dwattr $C$DW$79, DW_AT_decl_column(0x0c)
    1345            
    1346            $C$DW$80        .dwtag  DW_TAG_member
    1347                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$18)
    1348                    .dwattr $C$DW$80, DW_AT_name("__max_align2")
    1349                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("__max_align2")
    1350                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1351                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1352                    .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1353                    .dwattr $C$DW$80, DW_AT_decl_line(0x7c)
    1354                    .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
usci_a_uart.asm                                                      PAGE   27

    1355            
    1356                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1357                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    1358                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1359                    .dwendtag $C$DW$T$21
    1360            
    1361            $C$DW$T$27      .dwtag  DW_TAG_typedef
    1362                    .dwattr $C$DW$T$27, DW_AT_name("__max_align_t")
    1363                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$21)
    1364                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1365                    .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1366                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x7d)
    1367                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    1368            
    1369            
    1370            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1371                    .dwattr $C$DW$T$26, DW_AT_name("USCI_A_UART_initParam")
    1372                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
    1373            $C$DW$81        .dwtag  DW_TAG_member
    1374                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
    1375                    .dwattr $C$DW$81, DW_AT_name("selectClockSource")
    1376                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("selectClockSource")
    1377                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1379                    .dwattr $C$DW$81, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1380                    .dwattr $C$DW$81, DW_AT_decl_line(0x2c)
    1381                    .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1382            
    1383            $C$DW$82        .dwtag  DW_TAG_member
    1384                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$25)
    1385                    .dwattr $C$DW$82, DW_AT_name("clockPrescalar")
    1386                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("clockPrescalar")
    1387                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1388                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1389                    .dwattr $C$DW$82, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1390                    .dwattr $C$DW$82, DW_AT_decl_line(0x2e)
    1391                    .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1392            
    1393            $C$DW$83        .dwtag  DW_TAG_member
    1394                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
    1395                    .dwattr $C$DW$83, DW_AT_name("firstModReg")
    1396                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("firstModReg")
    1397                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1398                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1399                    .dwattr $C$DW$83, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1400                    .dwattr $C$DW$83, DW_AT_decl_line(0x32)
    1401                    .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1402            
    1403            $C$DW$84        .dwtag  DW_TAG_member
    1404                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$23)
    1405                    .dwattr $C$DW$84, DW_AT_name("secondModReg")
    1406                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("secondModReg")
    1407                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1408                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1409                    .dwattr $C$DW$84, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
usci_a_uart.asm                                                      PAGE   28

    1410                    .dwattr $C$DW$84, DW_AT_decl_line(0x36)
    1411                    .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1412            
    1413            $C$DW$85        .dwtag  DW_TAG_member
    1414                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
    1415                    .dwattr $C$DW$85, DW_AT_name("parity")
    1416                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("parity")
    1417                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1418                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1419                    .dwattr $C$DW$85, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1420                    .dwattr $C$DW$85, DW_AT_decl_line(0x3c)
    1421                    .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1422            
    1423            $C$DW$86        .dwtag  DW_TAG_member
    1424                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$23)
    1425                    .dwattr $C$DW$86, DW_AT_name("msborLsbFirst")
    1426                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("msborLsbFirst")
    1427                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1428                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1429                    .dwattr $C$DW$86, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1430                    .dwattr $C$DW$86, DW_AT_decl_line(0x41)
    1431                    .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1432            
    1433            $C$DW$87        .dwtag  DW_TAG_member
    1434                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
    1435                    .dwattr $C$DW$87, DW_AT_name("numberofStopBits")
    1436                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("numberofStopBits")
    1437                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1438                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1439                    .dwattr $C$DW$87, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1440                    .dwattr $C$DW$87, DW_AT_decl_line(0x46)
    1441                    .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1442            
    1443            $C$DW$88        .dwtag  DW_TAG_member
    1444                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$23)
    1445                    .dwattr $C$DW$88, DW_AT_name("uartMode")
    1446                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("uartMode")
    1447                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1448                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1449                    .dwattr $C$DW$88, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1450                    .dwattr $C$DW$88, DW_AT_decl_line(0x4d)
    1451                    .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1452            
    1453            $C$DW$89        .dwtag  DW_TAG_member
    1454                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$23)
    1455                    .dwattr $C$DW$89, DW_AT_name("overSampling")
    1456                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("overSampling")
    1457                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1458                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1459                    .dwattr $C$DW$89, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h")
    1460                    .dwattr $C$DW$89, DW_AT_decl_line(0x52)
    1461                    .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1462            
    1463                    .dwattr $C$DW$T$26, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h"
    1464                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
usci_a_uart.asm                                                      PAGE   29

    1465                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    1466                    .dwendtag $C$DW$T$26
    1467            
    1468            $C$DW$T$28      .dwtag  DW_TAG_typedef
    1469                    .dwattr $C$DW$T$28, DW_AT_name("USCI_A_UART_initParam")
    1470                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
    1471                    .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1472                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\MP430DriverLib\driverlib\MSP430F5xx_6xx\usci_a_uart.h"
    1473                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x53)
    1474                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1475            
    1476            $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1477                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1478                    .dwattr $C$DW$T$29, DW_AT_address_class(0x14)
    1479            
    1480            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1481                    .dwattr $C$DW$T$2, DW_AT_name("void")
    1482            
    1483            
    1484            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    1485                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1486                    .dwendtag $C$DW$T$33
    1487            
    1488            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1489                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1490                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    1491            
    1492            $C$DW$T$35      .dwtag  DW_TAG_typedef
    1493                    .dwattr $C$DW$T$35, DW_AT_name("__SFR_FARPTR")
    1494                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1495                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1496                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430f5438a.h"
    1497                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x49)
    1498                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x11)
    1499            
    1500            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1501                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1502                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1503                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1504            
    1505            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1506                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1507                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1508                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1509            
    1510            $C$DW$T$36      .dwtag  DW_TAG_typedef
    1511                    .dwattr $C$DW$T$36, DW_AT_name("__int8_t")
    1512                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$5)
    1513                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1514                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1515                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x36)
