MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:55 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/ADC ISR G.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("ADC12IFG")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("ADC12IFG")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$111)

    2162                    .dwattr $C$DW$95, DW_AT_const_value(0x06)
    2163                    .dwattr $C$DW$95, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2164                    .dwattr $C$DW$95, DW_AT_decl_line(0x76)
    2165                    .dwattr $C$DW$95, DW_AT_decl_column(0x05)
    2166            
    2167            $C$DW$96        .dwtag  DW_TAG_enumerator
    2168                    .dwattr $C$DW$96, DW_AT_name("ack")
    2169                    .dwattr $C$DW$96, DW_AT_const_value(0x07)
    2170                    .dwattr $C$DW$96, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2171                    .dwattr $C$DW$96, DW_AT_decl_line(0x77)
    2172                    .dwattr $C$DW$96, DW_AT_decl_column(0x05)
    2173            
    2174            $C$DW$97        .dwtag  DW_TAG_enumerator
    2175                    .dwattr $C$DW$97, DW_AT_name("var")
    2176                    .dwattr $C$DW$97, DW_AT_const_value(0x08)
    2177                    .dwattr $C$DW$97, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2178                    .dwattr $C$DW$97, DW_AT_decl_line(0x78)
    2179                    .dwattr $C$DW$97, DW_AT_decl_column(0x05)
    2180            
    2181            $C$DW$98        .dwtag  DW_TAG_enumerator
    2182                    .dwattr $C$DW$98, DW_AT_name("UGmsg")
    2183                    .dwattr $C$DW$98, DW_AT_const_value(0x09)
    2184                    .dwattr $C$DW$98, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2185                    .dwattr $C$DW$98, DW_AT_decl_line(0x79)
    2186                    .dwattr $C$DW$98, DW_AT_decl_column(0x05)
    2187            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   42

    2188                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2189                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2190                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2191                    .dwendtag $C$DW$T$57
    2192            
    2193            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2194                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2195                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2196                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2197                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2198                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    2199                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2200            
    2201            
    2202            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2203                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2204            $C$DW$99        .dwtag  DW_TAG_enumerator
    2205                    .dwattr $C$DW$99, DW_AT_name("init")
    2206                    .dwattr $C$DW$99, DW_AT_const_value(0x00)
    2207                    .dwattr $C$DW$99, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2208                    .dwattr $C$DW$99, DW_AT_decl_line(0x80)
    2209                    .dwattr $C$DW$99, DW_AT_decl_column(0x05)
    2210            
    2211            $C$DW$100       .dwtag  DW_TAG_enumerator
    2212                    .dwattr $C$DW$100, DW_AT_name("running")
    2213                    .dwattr $C$DW$100, DW_AT_const_value(0x01)
    2214                    .dwattr $C$DW$100, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2215                    .dwattr $C$DW$100, DW_AT_decl_line(0x80)
    2216                    .dwattr $C$DW$100, DW_AT_decl_column(0x0b)
    2217            
    2218            $C$DW$101       .dwtag  DW_TAG_enumerator
    2219                    .dwattr $C$DW$101, DW_AT_name("wait")
    2220                    .dwattr $C$DW$101, DW_AT_const_value(0x02)
    2221                    .dwattr $C$DW$101, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2222                    .dwattr $C$DW$101, DW_AT_decl_line(0x80)
    2223                    .dwattr $C$DW$101, DW_AT_decl_column(0x14)
    2224            
    2225                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2226                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2227                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    2228                    .dwendtag $C$DW$T$59
    2229            
    2230            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2231                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2232                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2233                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2234                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2235                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2236                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2237            
    2238            
    2239            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2240                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2241            $C$DW$102       .dwtag  DW_TAG_member
    2242                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$14)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   43

    2243                    .dwattr $C$DW$102, DW_AT_name("__max_align1")
    2244                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("__max_align1")
    2245                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2246                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2247                    .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2248                    .dwattr $C$DW$102, DW_AT_decl_line(0x7b)
    2249                    .dwattr $C$DW$102, DW_AT_decl_column(0x0c)
    2250            
    2251            $C$DW$103       .dwtag  DW_TAG_member
    2252                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$18)
    2253                    .dwattr $C$DW$103, DW_AT_name("__max_align2")
    2254                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("__max_align2")
    2255                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2256                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2257                    .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2258                    .dwattr $C$DW$103, DW_AT_decl_line(0x7c)
    2259                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    2260            
    2261                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2262                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    2263                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2264                    .dwendtag $C$DW$T$22
    2265            
    2266            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2267                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    2268                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    2269                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2270                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2271                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    2272                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2273            
    2274            
    2275            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2276                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    2277                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    2278            $C$DW$104       .dwtag  DW_TAG_member
    2279                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$24)
    2280                    .dwattr $C$DW$104, DW_AT_name("memoryBufferControlIndex")
    2281                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    2282                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2284                    .dwattr $C$DW$104, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2285                    .dwattr $C$DW$104, DW_AT_decl_line(0x27)
    2286                    .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    2287            
    2288            $C$DW$105       .dwtag  DW_TAG_member
    2289                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$24)
    2290                    .dwattr $C$DW$105, DW_AT_name("inputSourceSelect")
    2291                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("inputSourceSelect")
    2292                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2293                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2294                    .dwattr $C$DW$105, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2295                    .dwattr $C$DW$105, DW_AT_decl_line(0x3b)
    2296                    .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    2297            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   44

    2298            $C$DW$106       .dwtag  DW_TAG_member
    2299                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$24)
    2300                    .dwattr $C$DW$106, DW_AT_name("positiveRefVoltageSourceSelect")
    2301                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    2302                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2303                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2304                    .dwattr $C$DW$106, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2305                    .dwattr $C$DW$106, DW_AT_decl_line(0x42)
    2306                    .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    2307            
    2308            $C$DW$107       .dwtag  DW_TAG_member
    2309                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$24)
    2310                    .dwattr $C$DW$107, DW_AT_name("negativeRefVoltageSourceSelect")
    2311                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    2312                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2313                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2314                    .dwattr $C$DW$107, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2315                    .dwattr $C$DW$107, DW_AT_decl_line(0x48)
    2316                    .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    2317            
    2318            $C$DW$108       .dwtag  DW_TAG_member
    2319                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$24)
    2320                    .dwattr $C$DW$108, DW_AT_name("endOfSequence")
    2321                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("endOfSequence")
    2322                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2323                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2324                    .dwattr $C$DW$108, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2325                    .dwattr $C$DW$108, DW_AT_decl_line(0x51)
    2326                    .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    2327            
    2328                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2329                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    2330                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2331                    .dwendtag $C$DW$T$25
    2332            
    2333            $C$DW$T$62      .dwtag  DW_TAG_typedef
    2334                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    2335                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    2336                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2337                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2338                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    2339                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2340            
    2341            
    2342            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2343                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    2344                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2345            $C$DW$109       .dwtag  DW_TAG_member
    2346                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$27)
    2347                    .dwattr $C$DW$109, DW_AT_name("captureRegister")
    2348                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("captureRegister")
    2349                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2351                    .dwattr $C$DW$109, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2352                    .dwattr $C$DW$109, DW_AT_decl_line(0x58)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   45

    2353                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    2354            
    2355            $C$DW$110       .dwtag  DW_TAG_member
    2356                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$27)
    2357                    .dwattr $C$DW$110, DW_AT_name("captureMode")
    2358                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("captureMode")
    2359                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2360                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2361                    .dwattr $C$DW$110, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2362                    .dwattr $C$DW$110, DW_AT_decl_line(0x5f)
    2363                    .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    2364            
    2365            $C$DW$111       .dwtag  DW_TAG_member
    2366                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$27)
    2367                    .dwattr $C$DW$111, DW_AT_name("captureInputSelect")
    2368                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("captureInputSelect")
    2369                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2370                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2371                    .dwattr $C$DW$111, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2372                    .dwattr $C$DW$111, DW_AT_decl_line(0x66)
    2373                    .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    2374            
    2375            $C$DW$112       .dwtag  DW_TAG_member
    2376                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$27)
    2377                    .dwattr $C$DW$112, DW_AT_name("synchronizeCaptureSource")
    2378                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2379                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2380                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2381                    .dwattr $C$DW$112, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2382                    .dwattr $C$DW$112, DW_AT_decl_line(0x6b)
    2383                    .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    2384            
    2385            $C$DW$113       .dwtag  DW_TAG_member
    2386                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    2387                    .dwattr $C$DW$113, DW_AT_name("captureInterruptEnable")
    2388                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("captureInterruptEnable")
    2389                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2390                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2391                    .dwattr $C$DW$113, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2392                    .dwattr $C$DW$113, DW_AT_decl_line(0x70)
    2393                    .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    2394            
    2395            $C$DW$114       .dwtag  DW_TAG_member
    2396                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$27)
    2397                    .dwattr $C$DW$114, DW_AT_name("captureOutputMode")
    2398                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("captureOutputMode")
    2399                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2400                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2401                    .dwattr $C$DW$114, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2402                    .dwattr $C$DW$114, DW_AT_decl_line(0x7b)
    2403                    .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    2404            
    2405                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2406                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    2407                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   46

    2408                    .dwendtag $C$DW$T$28
    2409            
    2410            $C$DW$T$63      .dwtag  DW_TAG_typedef
    2411                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    2412                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    2413                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2414                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2415                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    2416                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2417            
    2418            
    2419            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2420                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    2421                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2422            $C$DW$115       .dwtag  DW_TAG_member
    2423                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$27)
    2424                    .dwattr $C$DW$115, DW_AT_name("compareRegister")
    2425                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("compareRegister")
    2426                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2428                    .dwattr $C$DW$115, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2429                    .dwattr $C$DW$115, DW_AT_decl_line(0x145)
    2430                    .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    2431            
    2432            $C$DW$116       .dwtag  DW_TAG_member
    2433                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$27)
    2434                    .dwattr $C$DW$116, DW_AT_name("compareInterruptEnable")
    2435                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("compareInterruptEnable")
    2436                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2437                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2438                    .dwattr $C$DW$116, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2439                    .dwattr $C$DW$116, DW_AT_decl_line(0x14a)
    2440                    .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    2441            
    2442            $C$DW$117       .dwtag  DW_TAG_member
    2443                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$27)
    2444                    .dwattr $C$DW$117, DW_AT_name("compareOutputMode")
    2445                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("compareOutputMode")
    2446                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2447                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2448                    .dwattr $C$DW$117, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2449                    .dwattr $C$DW$117, DW_AT_decl_line(0x155)
    2450                    .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    2451            
    2452            $C$DW$118       .dwtag  DW_TAG_member
    2453                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$27)
    2454                    .dwattr $C$DW$118, DW_AT_name("compareValue")
    2455                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("compareValue")
    2456                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2457                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2458                    .dwattr $C$DW$118, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2459                    .dwattr $C$DW$118, DW_AT_decl_line(0x157)
    2460                    .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    2461            
    2462                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   47

    2463                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    2464                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2465                    .dwendtag $C$DW$T$29
    2466            
    2467            $C$DW$T$64      .dwtag  DW_TAG_typedef
    2468                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    2469                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    2470                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2471                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2472                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    2473                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    2474            
    2475            
    2476            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2477                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    2478                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    2479            $C$DW$119       .dwtag  DW_TAG_member
    2480                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$27)
    2481                    .dwattr $C$DW$119, DW_AT_name("clockSource")
    2482                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("clockSource")
    2483                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2485                    .dwattr $C$DW$119, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2486                    .dwattr $C$DW$119, DW_AT_decl_line(0x20)
    2487                    .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    2488            
    2489            $C$DW$120       .dwtag  DW_TAG_member
    2490                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
    2491                    .dwattr $C$DW$120, DW_AT_name("clockSourceDivider")
    2492                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("clockSourceDivider")
    2493                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2494                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2495                    .dwattr $C$DW$120, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2496                    .dwattr $C$DW$120, DW_AT_decl_line(0x37)
    2497                    .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    2498            
    2499            $C$DW$121       .dwtag  DW_TAG_member
    2500                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$27)
    2501                    .dwattr $C$DW$121, DW_AT_name("timerInterruptEnable_TAIE")
    2502                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2503                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2504                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2505                    .dwattr $C$DW$121, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2506                    .dwattr $C$DW$121, DW_AT_decl_line(0x3c)
    2507                    .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    2508            
    2509            $C$DW$122       .dwtag  DW_TAG_member
    2510                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$27)
    2511                    .dwattr $C$DW$122, DW_AT_name("timerClear")
    2512                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("timerClear")
    2513                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2514                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2515                    .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2516                    .dwattr $C$DW$122, DW_AT_decl_line(0x42)
    2517                    .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   48

    2518            
    2519            $C$DW$123       .dwtag  DW_TAG_member
    2520                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$30)
    2521                    .dwattr $C$DW$123, DW_AT_name("startTimer")
    2522                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("startTimer")
    2523                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2524                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2525                    .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2526                    .dwattr $C$DW$123, DW_AT_decl_line(0x44)
    2527                    .dwattr $C$DW$123, DW_AT_decl_column(0x0a)
    2528            
    2529                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2530                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    2531                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2532                    .dwendtag $C$DW$T$31
    2533            
    2534            $C$DW$T$65      .dwtag  DW_TAG_typedef
    2535                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    2536                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    2537                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2538                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2539                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    2540                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    2541            
    2542            
    2543            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2544                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    2545                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    2546            $C$DW$124       .dwtag  DW_TAG_member
    2547                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$27)
    2548                    .dwattr $C$DW$124, DW_AT_name("clockSource")
    2549                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("clockSource")
    2550                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2552                    .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2553                    .dwattr $C$DW$124, DW_AT_decl_line(0x8b)
    2554                    .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    2555            
    2556            $C$DW$125       .dwtag  DW_TAG_member
    2557                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    2558                    .dwattr $C$DW$125, DW_AT_name("clockSourceDivider")
    2559                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("clockSourceDivider")
    2560                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2561                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2562                    .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2563                    .dwattr $C$DW$125, DW_AT_decl_line(0xa2)
    2564                    .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    2565            
    2566            $C$DW$126       .dwtag  DW_TAG_member
    2567                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$27)
    2568                    .dwattr $C$DW$126, DW_AT_name("timerPeriod")
    2569                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("timerPeriod")
    2570                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2571                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2572                    .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   49

    2573                    .dwattr $C$DW$126, DW_AT_decl_line(0xa4)
    2574                    .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    2575            
    2576            $C$DW$127       .dwtag  DW_TAG_member
    2577                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    2578                    .dwattr $C$DW$127, DW_AT_name("timerInterruptEnable_TAIE")
    2579                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2580                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2581                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2582                    .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2583                    .dwattr $C$DW$127, DW_AT_decl_line(0xa9)
    2584                    .dwattr $C$DW$127, DW_AT_decl_column(0x0e)
    2585            
    2586            $C$DW$128       .dwtag  DW_TAG_member
    2587                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
    2588                    .dwattr $C$DW$128, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2589                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2590                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2591                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2592                    .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2593                    .dwattr $C$DW$128, DW_AT_decl_line(0xae)
    2594                    .dwattr $C$DW$128, DW_AT_decl_column(0x0e)
    2595            
    2596            $C$DW$129       .dwtag  DW_TAG_member
    2597                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$27)
    2598                    .dwattr $C$DW$129, DW_AT_name("timerClear")
    2599                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("timerClear")
    2600                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2601                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2602                    .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2603                    .dwattr $C$DW$129, DW_AT_decl_line(0xb4)
    2604                    .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    2605            
    2606            $C$DW$130       .dwtag  DW_TAG_member
    2607                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$30)
    2608                    .dwattr $C$DW$130, DW_AT_name("startTimer")
    2609                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("startTimer")
    2610                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2611                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2612                    .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2613                    .dwattr $C$DW$130, DW_AT_decl_line(0xb6)
    2614                    .dwattr $C$DW$130, DW_AT_decl_column(0x0a)
    2615            
    2616                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2617                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    2618                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2619                    .dwendtag $C$DW$T$32
    2620            
    2621            $C$DW$T$66      .dwtag  DW_TAG_typedef
    2622                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    2623                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    2624                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2625                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2626                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    2627                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   50

    2628            
    2629            
    2630            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2631                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    2632                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    2633            $C$DW$131       .dwtag  DW_TAG_member
    2634                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    2635                    .dwattr $C$DW$131, DW_AT_name("clockSource")
    2636                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("clockSource")
    2637                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2639                    .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2640                    .dwattr $C$DW$131, DW_AT_decl_line(0x105)
    2641                    .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    2642            
    2643            $C$DW$132       .dwtag  DW_TAG_member
    2644                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    2645                    .dwattr $C$DW$132, DW_AT_name("clockSourceDivider")
    2646                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("clockSourceDivider")
    2647                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2648                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2649                    .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2650                    .dwattr $C$DW$132, DW_AT_decl_line(0x11c)
    2651                    .dwattr $C$DW$132, DW_AT_decl_column(0x0e)
    2652            
    2653            $C$DW$133       .dwtag  DW_TAG_member
    2654                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    2655                    .dwattr $C$DW$133, DW_AT_name("timerPeriod")
    2656                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("timerPeriod")
    2657                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2658                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2659                    .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2660                    .dwattr $C$DW$133, DW_AT_decl_line(0x11f)
    2661                    .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    2662            
    2663            $C$DW$134       .dwtag  DW_TAG_member
    2664                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
    2665                    .dwattr $C$DW$134, DW_AT_name("timerInterruptEnable_TAIE")
    2666                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2667                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2668                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2669                    .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2670                    .dwattr $C$DW$134, DW_AT_decl_line(0x124)
    2671                    .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    2672            
    2673            $C$DW$135       .dwtag  DW_TAG_member
    2674                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$27)
    2675                    .dwattr $C$DW$135, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2676                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2677                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2678                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2679                    .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2680                    .dwattr $C$DW$135, DW_AT_decl_line(0x129)
    2681                    .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2682            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   51

    2683            $C$DW$136       .dwtag  DW_TAG_member
    2684                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    2685                    .dwattr $C$DW$136, DW_AT_name("timerClear")
    2686                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("timerClear")
    2687                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2688                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2689                    .dwattr $C$DW$136, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2690                    .dwattr $C$DW$136, DW_AT_decl_line(0x12f)
    2691                    .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2692            
    2693            $C$DW$137       .dwtag  DW_TAG_member
    2694                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$30)
    2695                    .dwattr $C$DW$137, DW_AT_name("startTimer")
    2696                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("startTimer")
    2697                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2698                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2699                    .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2700                    .dwattr $C$DW$137, DW_AT_decl_line(0x131)
    2701                    .dwattr $C$DW$137, DW_AT_decl_column(0x0a)
    2702            
    2703                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2704                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    2705                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2706                    .dwendtag $C$DW$T$33
    2707            
    2708            $C$DW$T$67      .dwtag  DW_TAG_typedef
    2709                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    2710                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    2711                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2712                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2713                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    2714                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    2715            
    2716            
    2717            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2718                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    2719                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    2720            $C$DW$138       .dwtag  DW_TAG_member
    2721                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2722                    .dwattr $C$DW$138, DW_AT_name("clockSource")
    2723                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("clockSource")
    2724                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2725                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2726                    .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2727                    .dwattr $C$DW$138, DW_AT_decl_line(0xc5)
    2728                    .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2729            
    2730            $C$DW$139       .dwtag  DW_TAG_member
    2731                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2732                    .dwattr $C$DW$139, DW_AT_name("clockSourceDivider")
    2733                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("clockSourceDivider")
    2734                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2735                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2736                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2737                    .dwattr $C$DW$139, DW_AT_decl_line(0xdc)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   52

    2738                    .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2739            
    2740            $C$DW$140       .dwtag  DW_TAG_member
    2741                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2742                    .dwattr $C$DW$140, DW_AT_name("timerPeriod")
    2743                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("timerPeriod")
    2744                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2745                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2746                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2747                    .dwattr $C$DW$140, DW_AT_decl_line(0xde)
    2748                    .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2749            
    2750            $C$DW$141       .dwtag  DW_TAG_member
    2751                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2752                    .dwattr $C$DW$141, DW_AT_name("compareRegister")
    2753                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("compareRegister")
    2754                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2755                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2756                    .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2757                    .dwattr $C$DW$141, DW_AT_decl_line(0xe9)
    2758                    .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2759            
    2760            $C$DW$142       .dwtag  DW_TAG_member
    2761                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    2762                    .dwattr $C$DW$142, DW_AT_name("compareOutputMode")
    2763                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("compareOutputMode")
    2764                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2765                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2766                    .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2767                    .dwattr $C$DW$142, DW_AT_decl_line(0xf4)
    2768                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2769            
    2770            $C$DW$143       .dwtag  DW_TAG_member
    2771                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    2772                    .dwattr $C$DW$143, DW_AT_name("dutyCycle")
    2773                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("dutyCycle")
    2774                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2775                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2776                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2777                    .dwattr $C$DW$143, DW_AT_decl_line(0xf6)
    2778                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2779            
    2780                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2781                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    2782                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    2783                    .dwendtag $C$DW$T$34
    2784            
    2785            $C$DW$T$68      .dwtag  DW_TAG_typedef
    2786                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    2787                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    2788                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2789                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2790                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    2791                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    2792            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   53

    2793            
    2794            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2795                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    2796                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    2797            $C$DW$144       .dwtag  DW_TAG_member
    2798                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2799                    .dwattr $C$DW$144, DW_AT_name("captureRegister")
    2800                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("captureRegister")
    2801                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2802                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2803                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2804                    .dwattr $C$DW$144, DW_AT_decl_line(0xa0)
    2805                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2806            
    2807            $C$DW$145       .dwtag  DW_TAG_member
    2808                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2809                    .dwattr $C$DW$145, DW_AT_name("captureMode")
    2810                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("captureMode")
    2811                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2812                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2813                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2814                    .dwattr $C$DW$145, DW_AT_decl_line(0xa7)
    2815                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2816            
    2817            $C$DW$146       .dwtag  DW_TAG_member
    2818                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2819                    .dwattr $C$DW$146, DW_AT_name("captureInputSelect")
    2820                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("captureInputSelect")
    2821                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2822                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2823                    .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2824                    .dwattr $C$DW$146, DW_AT_decl_line(0xae)
    2825                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2826            
    2827            $C$DW$147       .dwtag  DW_TAG_member
    2828                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2829                    .dwattr $C$DW$147, DW_AT_name("synchronizeCaptureSource")
    2830                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2831                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2832                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2833                    .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2834                    .dwattr $C$DW$147, DW_AT_decl_line(0xb3)
    2835                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2836            
    2837            $C$DW$148       .dwtag  DW_TAG_member
    2838                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2839                    .dwattr $C$DW$148, DW_AT_name("captureInterruptEnable")
    2840                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("captureInterruptEnable")
    2841                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2842                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2843                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2844                    .dwattr $C$DW$148, DW_AT_decl_line(0xb8)
    2845                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2846            
    2847            $C$DW$149       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   54

    2848                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    2849                    .dwattr $C$DW$149, DW_AT_name("captureOutputMode")
    2850                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("captureOutputMode")
    2851                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2852                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2853                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2854                    .dwattr $C$DW$149, DW_AT_decl_line(0xc3)
    2855                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2856            
    2857                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2858                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    2859                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2860                    .dwendtag $C$DW$T$35
    2861            
    2862            $C$DW$T$69      .dwtag  DW_TAG_typedef
    2863                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    2864                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    2865                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2866                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2867                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    2868                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    2869            
    2870            
    2871            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2872                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    2873                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    2874            $C$DW$150       .dwtag  DW_TAG_member
    2875                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    2876                    .dwattr $C$DW$150, DW_AT_name("compareRegister")
    2877                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("compareRegister")
    2878                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2879                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2880                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2881                    .dwattr $C$DW$150, DW_AT_decl_line(0x146)
    2882                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2883            
    2884            $C$DW$151       .dwtag  DW_TAG_member
    2885                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2886                    .dwattr $C$DW$151, DW_AT_name("compareInterruptEnable")
    2887                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("compareInterruptEnable")
    2888                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2889                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2890                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2891                    .dwattr $C$DW$151, DW_AT_decl_line(0x14b)
    2892                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2893            
    2894            $C$DW$152       .dwtag  DW_TAG_member
    2895                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2896                    .dwattr $C$DW$152, DW_AT_name("compareOutputMode")
    2897                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("compareOutputMode")
    2898                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2899                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2900                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2901                    .dwattr $C$DW$152, DW_AT_decl_line(0x156)
    2902                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   55

    2903            
    2904            $C$DW$153       .dwtag  DW_TAG_member
    2905                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    2906                    .dwattr $C$DW$153, DW_AT_name("compareValue")
    2907                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("compareValue")
    2908                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2909                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2910                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2911                    .dwattr $C$DW$153, DW_AT_decl_line(0x158)
    2912                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2913            
    2914                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2915                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    2916                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2917                    .dwendtag $C$DW$T$36
    2918            
    2919            $C$DW$T$70      .dwtag  DW_TAG_typedef
    2920                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    2921                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    2922                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2923                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2924                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    2925                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    2926            
    2927            
    2928            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2929                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    2930                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    2931            $C$DW$154       .dwtag  DW_TAG_member
    2932                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    2933                    .dwattr $C$DW$154, DW_AT_name("clockSource")
    2934                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("clockSource")
    2935                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2937                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2938                    .dwattr $C$DW$154, DW_AT_decl_line(0xd3)
    2939                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2940            
    2941            $C$DW$155       .dwtag  DW_TAG_member
    2942                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    2943                    .dwattr $C$DW$155, DW_AT_name("clockSourceDivider")
    2944                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("clockSourceDivider")
    2945                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2946                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2947                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2948                    .dwattr $C$DW$155, DW_AT_decl_line(0xea)
    2949                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2950            
    2951            $C$DW$156       .dwtag  DW_TAG_member
    2952                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    2953                    .dwattr $C$DW$156, DW_AT_name("timerInterruptEnable_TBIE")
    2954                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2955                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2956                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2957                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   56

    2958                    .dwattr $C$DW$156, DW_AT_decl_line(0xef)
    2959                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2960            
    2961            $C$DW$157       .dwtag  DW_TAG_member
    2962                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    2963                    .dwattr $C$DW$157, DW_AT_name("timerClear")
    2964                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("timerClear")
    2965                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2966                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2967                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2968                    .dwattr $C$DW$157, DW_AT_decl_line(0xf5)
    2969                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2970            
    2971            $C$DW$158       .dwtag  DW_TAG_member
    2972                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$30)
    2973                    .dwattr $C$DW$158, DW_AT_name("startTimer")
    2974                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("startTimer")
    2975                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2976                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2977                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2978                    .dwattr $C$DW$158, DW_AT_decl_line(0xf7)
    2979                    .dwattr $C$DW$158, DW_AT_decl_column(0x0a)
    2980            
    2981                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2982                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    2983                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    2984                    .dwendtag $C$DW$T$37
    2985            
    2986            $C$DW$T$71      .dwtag  DW_TAG_typedef
    2987                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    2988                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    2989                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2990                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2991                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    2992                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    2993            
    2994            
    2995            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2996                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    2997                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    2998            $C$DW$159       .dwtag  DW_TAG_member
    2999                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    3000                    .dwattr $C$DW$159, DW_AT_name("clockSource")
    3001                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("clockSource")
    3002                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3003                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3004                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3005                    .dwattr $C$DW$159, DW_AT_decl_line(0x107)
    3006                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    3007            
    3008            $C$DW$160       .dwtag  DW_TAG_member
    3009                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    3010                    .dwattr $C$DW$160, DW_AT_name("clockSourceDivider")
    3011                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("clockSourceDivider")
    3012                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   57

    3013                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3014                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3015                    .dwattr $C$DW$160, DW_AT_decl_line(0x11e)
    3016                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    3017            
    3018            $C$DW$161       .dwtag  DW_TAG_member
    3019                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3020                    .dwattr $C$DW$161, DW_AT_name("timerPeriod")
    3021                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerPeriod")
    3022                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3023                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3024                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3025                    .dwattr $C$DW$161, DW_AT_decl_line(0x120)
    3026                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3027            
    3028            $C$DW$162       .dwtag  DW_TAG_member
    3029                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    3030                    .dwattr $C$DW$162, DW_AT_name("timerInterruptEnable_TBIE")
    3031                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3032                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3033                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3034                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3035                    .dwattr $C$DW$162, DW_AT_decl_line(0x125)
    3036                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3037            
    3038            $C$DW$163       .dwtag  DW_TAG_member
    3039                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3040                    .dwattr $C$DW$163, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3041                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3042                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3043                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3044                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3045                    .dwattr $C$DW$163, DW_AT_decl_line(0x12a)
    3046                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3047            
    3048            $C$DW$164       .dwtag  DW_TAG_member
    3049                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    3050                    .dwattr $C$DW$164, DW_AT_name("timerClear")
    3051                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("timerClear")
    3052                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3053                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3054                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3055                    .dwattr $C$DW$164, DW_AT_decl_line(0x130)
    3056                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    3057            
    3058            $C$DW$165       .dwtag  DW_TAG_member
    3059                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$30)
    3060                    .dwattr $C$DW$165, DW_AT_name("startTimer")
    3061                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("startTimer")
    3062                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3063                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3064                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3065                    .dwattr $C$DW$165, DW_AT_decl_line(0x132)
    3066                    .dwattr $C$DW$165, DW_AT_decl_column(0x0a)
    3067            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   58

    3068                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3069                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    3070                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3071                    .dwendtag $C$DW$T$38
    3072            
    3073            $C$DW$T$72      .dwtag  DW_TAG_typedef
    3074                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    3075                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    3076                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3077                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3078                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    3079                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3080            
    3081            
    3082            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3083                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    3084                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    3085            $C$DW$166       .dwtag  DW_TAG_member
    3086                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3087                    .dwattr $C$DW$166, DW_AT_name("clockSource")
    3088                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockSource")
    3089                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3090                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3091                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3092                    .dwattr $C$DW$166, DW_AT_decl_line(0x60)
    3093                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3094            
    3095            $C$DW$167       .dwtag  DW_TAG_member
    3096                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3097                    .dwattr $C$DW$167, DW_AT_name("clockSourceDivider")
    3098                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("clockSourceDivider")
    3099                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3100                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3101                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3102                    .dwattr $C$DW$167, DW_AT_decl_line(0x77)
    3103                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3104            
    3105            $C$DW$168       .dwtag  DW_TAG_member
    3106                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3107                    .dwattr $C$DW$168, DW_AT_name("timerPeriod")
    3108                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("timerPeriod")
    3109                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3110                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3111                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3112                    .dwattr $C$DW$168, DW_AT_decl_line(0x7a)
    3113                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3114            
    3115            $C$DW$169       .dwtag  DW_TAG_member
    3116                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3117                    .dwattr $C$DW$169, DW_AT_name("timerInterruptEnable_TBIE")
    3118                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3119                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3120                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3121                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3122                    .dwattr $C$DW$169, DW_AT_decl_line(0x7f)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   59

    3123                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3124            
    3125            $C$DW$170       .dwtag  DW_TAG_member
    3126                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3127                    .dwattr $C$DW$170, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3128                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3129                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3130                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3131                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3132                    .dwattr $C$DW$170, DW_AT_decl_line(0x84)
    3133                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3134            
    3135            $C$DW$171       .dwtag  DW_TAG_member
    3136                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3137                    .dwattr $C$DW$171, DW_AT_name("timerClear")
    3138                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("timerClear")
    3139                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3140                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3141                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3142                    .dwattr $C$DW$171, DW_AT_decl_line(0x8a)
    3143                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3144            
    3145            $C$DW$172       .dwtag  DW_TAG_member
    3146                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$30)
    3147                    .dwattr $C$DW$172, DW_AT_name("startTimer")
    3148                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("startTimer")
    3149                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3150                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3151                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3152                    .dwattr $C$DW$172, DW_AT_decl_line(0x8c)
    3153                    .dwattr $C$DW$172, DW_AT_decl_column(0x0a)
    3154            
    3155                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3156                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    3157                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    3158                    .dwendtag $C$DW$T$39
    3159            
    3160            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3161                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3162                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    3163                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3164                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3165                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3166                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3167            
    3168            
    3169            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3170                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3171                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3172            $C$DW$173       .dwtag  DW_TAG_member
    3173                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3174                    .dwattr $C$DW$173, DW_AT_name("clockSource")
    3175                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("clockSource")
    3176                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3177                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   60

    3178                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3179                    .dwattr $C$DW$173, DW_AT_decl_line(0x20)
    3180                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3181            
    3182            $C$DW$174       .dwtag  DW_TAG_member
    3183                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3184                    .dwattr $C$DW$174, DW_AT_name("clockSourceDivider")
    3185                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("clockSourceDivider")
    3186                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3187                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3188                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3189                    .dwattr $C$DW$174, DW_AT_decl_line(0x37)
    3190                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    3191            
    3192            $C$DW$175       .dwtag  DW_TAG_member
    3193                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3194                    .dwattr $C$DW$175, DW_AT_name("timerPeriod")
    3195                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("timerPeriod")
    3196                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3197                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3198                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3199                    .dwattr $C$DW$175, DW_AT_decl_line(0x39)
    3200                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3201            
    3202            $C$DW$176       .dwtag  DW_TAG_member
    3203                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    3204                    .dwattr $C$DW$176, DW_AT_name("compareRegister")
    3205                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("compareRegister")
    3206                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3207                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3208                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3209                    .dwattr $C$DW$176, DW_AT_decl_line(0x44)
    3210                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    3211            
    3212            $C$DW$177       .dwtag  DW_TAG_member
    3213                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3214                    .dwattr $C$DW$177, DW_AT_name("compareOutputMode")
    3215                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("compareOutputMode")
    3216                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3217                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3218                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3219                    .dwattr $C$DW$177, DW_AT_decl_line(0x4f)
    3220                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3221            
    3222            $C$DW$178       .dwtag  DW_TAG_member
    3223                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3224                    .dwattr $C$DW$178, DW_AT_name("dutyCycle")
    3225                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("dutyCycle")
    3226                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3227                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3228                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3229                    .dwattr $C$DW$178, DW_AT_decl_line(0x51)
    3230                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3231            
    3232                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   61

    3233                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3234                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3235                    .dwendtag $C$DW$T$40
    3236            
    3237            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3238                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3239                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3240                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3241                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3242                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3243                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3244            
    3245            
    3246            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3247                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    3248                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3249            $C$DW$179       .dwtag  DW_TAG_member
    3250                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$24)
    3251                    .dwattr $C$DW$179, DW_AT_name("selectClockSource")
    3252                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("selectClockSource")
    3253                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3254                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3255                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3256                    .dwattr $C$DW$179, DW_AT_decl_line(0x1c)
    3257                    .dwattr $C$DW$179, DW_AT_decl_column(0x0d)
    3258            
    3259            $C$DW$180       .dwtag  DW_TAG_member
    3260                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3261                    .dwattr $C$DW$180, DW_AT_name("clockPrescalar")
    3262                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("clockPrescalar")
    3263                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3264                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3265                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3266                    .dwattr $C$DW$180, DW_AT_decl_line(0x1e)
    3267                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3268            
    3269            $C$DW$181       .dwtag  DW_TAG_member
    3270                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$24)
    3271                    .dwattr $C$DW$181, DW_AT_name("firstModReg")
    3272                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("firstModReg")
    3273                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3274                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3275                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3276                    .dwattr $C$DW$181, DW_AT_decl_line(0x22)
    3277                    .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    3278            
    3279            $C$DW$182       .dwtag  DW_TAG_member
    3280                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$24)
    3281                    .dwattr $C$DW$182, DW_AT_name("secondModReg")
    3282                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("secondModReg")
    3283                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3284                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3285                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3286                    .dwattr $C$DW$182, DW_AT_decl_line(0x26)
    3287                    .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   62

    3288            
    3289            $C$DW$183       .dwtag  DW_TAG_member
    3290                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$24)
    3291                    .dwattr $C$DW$183, DW_AT_name("parity")
    3292                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("parity")
    3293                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3294                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3295                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3296                    .dwattr $C$DW$183, DW_AT_decl_line(0x2c)
    3297                    .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    3298            
    3299            $C$DW$184       .dwtag  DW_TAG_member
    3300                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    3301                    .dwattr $C$DW$184, DW_AT_name("msborLsbFirst")
    3302                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("msborLsbFirst")
    3303                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3304                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3305                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3306                    .dwattr $C$DW$184, DW_AT_decl_line(0x31)
    3307                    .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    3308            
    3309            $C$DW$185       .dwtag  DW_TAG_member
    3310                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$24)
    3311                    .dwattr $C$DW$185, DW_AT_name("numberofStopBits")
    3312                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("numberofStopBits")
    3313                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3314                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3315                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3316                    .dwattr $C$DW$185, DW_AT_decl_line(0x36)
    3317                    .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    3318            
    3319            $C$DW$186       .dwtag  DW_TAG_member
    3320                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$24)
    3321                    .dwattr $C$DW$186, DW_AT_name("uartMode")
    3322                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("uartMode")
    3323                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3324                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3325                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3326                    .dwattr $C$DW$186, DW_AT_decl_line(0x3d)
    3327                    .dwattr $C$DW$186, DW_AT_decl_column(0x0d)
    3328            
    3329            $C$DW$187       .dwtag  DW_TAG_member
    3330                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$24)
    3331                    .dwattr $C$DW$187, DW_AT_name("overSampling")
    3332                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("overSampling")
    3333                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3334                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3335                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3336                    .dwattr $C$DW$187, DW_AT_decl_line(0x42)
    3337                    .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    3338            
    3339                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3340                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    3341                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3342                    .dwendtag $C$DW$T$41
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   63

    3343            
    3344            $C$DW$T$75      .dwtag  DW_TAG_typedef
    3345                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    3346                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    3347                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3348                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3349                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    3350                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3351            
    3352            
    3353            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3354                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3355                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    3356            $C$DW$188       .dwtag  DW_TAG_member
    3357                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$43)
    3358                    .dwattr $C$DW$188, DW_AT_name("clockSourceFrequency")
    3359                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("clockSourceFrequency")
    3360                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3361                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3362                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3363                    .dwattr $C$DW$188, DW_AT_decl_line(0x31)
    3364                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3365            
    3366            $C$DW$189       .dwtag  DW_TAG_member
    3367                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$43)
    3368                    .dwattr $C$DW$189, DW_AT_name("desiredSpiClock")
    3369                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("desiredSpiClock")
    3370                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3371                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3372                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3373                    .dwattr $C$DW$189, DW_AT_decl_line(0x33)
    3374                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3375            
    3376                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3377                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    3378                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3379                    .dwendtag $C$DW$T$44
    3380            
    3381            $C$DW$T$76      .dwtag  DW_TAG_typedef
    3382                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3383                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    3384                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3385                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3386                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    3387                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3388            
    3389            
    3390            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3391                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    3392                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    3393            $C$DW$190       .dwtag  DW_TAG_member
    3394                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$24)
    3395                    .dwattr $C$DW$190, DW_AT_name("selectClockSource")
    3396                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("selectClockSource")
    3397                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC ISR G.asm                                                        PAGE   64

    3398                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3399                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3400                    .dwattr $C$DW$190, DW_AT_decl_line(0x14)
    3401                    .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    3402            
    3403            $C$DW$191       .dwtag  DW_TAG_member
    3404                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$43)
    3405                    .dwattr $C$DW$191, DW_AT_name("clockSourceFrequency")
    3406                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("clockSourceFrequency")
    3407                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3408                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3409                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3410                    .dwattr $C$DW$191, DW_AT_decl_line(0x16)
    3411                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3412            
    3413            $C$DW$192       .dwtag  DW_TAG_member
    3414                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$43)
    3415                    .dwattr $C$DW$192, DW_AT_name("desiredSpiClock")
    3416                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("desiredSpiClock")
    3417                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3418                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3419                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3420                    .dwattr $C$DW$192, DW_AT_decl_line(0x18)
    3421                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    3422            
    3423            $C$DW$193       .dwtag  DW_TAG_member
    3424                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$24)
    3425                    .dwattr $C$DW$193, DW_AT_name("msbFirst")
    3426                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("msbFirst")
    3427                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3428                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3429                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3430                    .dwattr $C$DW$193, DW_AT_decl_line(0x1d)
    3431                    .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    3432            
    3433            $C$DW$194       .dwtag  DW_TAG_member
    3434                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$24)
