MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:56 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/ADC_Calculations.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("ADC12MEM0")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("ADC12MEM0")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$115)

    4635                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4636                    .dwattr $C$DW$291, DW_AT_decl_line(0x76)
    4637                    .dwattr $C$DW$291, DW_AT_decl_column(0x05)
    4638            
    4639            $C$DW$292       .dwtag  DW_TAG_enumerator
    4640                    .dwattr $C$DW$292, DW_AT_name("ack")
    4641                    .dwattr $C$DW$292, DW_AT_const_value(0x07)
    4642                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4643                    .dwattr $C$DW$292, DW_AT_decl_line(0x77)
    4644                    .dwattr $C$DW$292, DW_AT_decl_column(0x05)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE   95

    4645            
    4646            $C$DW$293       .dwtag  DW_TAG_enumerator
    4647                    .dwattr $C$DW$293, DW_AT_name("var")
    4648                    .dwattr $C$DW$293, DW_AT_const_value(0x08)
    4649                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4650                    .dwattr $C$DW$293, DW_AT_decl_line(0x78)
    4651                    .dwattr $C$DW$293, DW_AT_decl_column(0x05)
    4652            
    4653            $C$DW$294       .dwtag  DW_TAG_enumerator
    4654                    .dwattr $C$DW$294, DW_AT_name("UGmsg")
    4655                    .dwattr $C$DW$294, DW_AT_const_value(0x09)
    4656                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4657                    .dwattr $C$DW$294, DW_AT_decl_line(0x79)
    4658                    .dwattr $C$DW$294, DW_AT_decl_column(0x05)
    4659            
    4660                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4661                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    4662                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    4663                    .dwendtag $C$DW$T$57
    4664            
    4665            $C$DW$T$58      .dwtag  DW_TAG_typedef
    4666                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    4667                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4668                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4669                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4670                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    4671                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4672            
    4673            
    4674            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    4675                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    4676            $C$DW$295       .dwtag  DW_TAG_enumerator
    4677                    .dwattr $C$DW$295, DW_AT_name("init")
    4678                    .dwattr $C$DW$295, DW_AT_const_value(0x00)
    4679                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4680                    .dwattr $C$DW$295, DW_AT_decl_line(0x80)
    4681                    .dwattr $C$DW$295, DW_AT_decl_column(0x05)
    4682            
    4683            $C$DW$296       .dwtag  DW_TAG_enumerator
    4684                    .dwattr $C$DW$296, DW_AT_name("running")
    4685                    .dwattr $C$DW$296, DW_AT_const_value(0x01)
    4686                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4687                    .dwattr $C$DW$296, DW_AT_decl_line(0x80)
    4688                    .dwattr $C$DW$296, DW_AT_decl_column(0x0b)
    4689            
    4690            $C$DW$297       .dwtag  DW_TAG_enumerator
    4691                    .dwattr $C$DW$297, DW_AT_name("wait")
    4692                    .dwattr $C$DW$297, DW_AT_const_value(0x02)
    4693                    .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4694                    .dwattr $C$DW$297, DW_AT_decl_line(0x80)
    4695                    .dwattr $C$DW$297, DW_AT_decl_column(0x14)
    4696            
    4697                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4698                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    4699                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE   96

    4700                    .dwendtag $C$DW$T$59
    4701            
    4702            $C$DW$T$60      .dwtag  DW_TAG_typedef
    4703                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    4704                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4705                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4706                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4707                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    4708                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    4709            
    4710            
    4711            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4712                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4713            $C$DW$298       .dwtag  DW_TAG_member
    4714                    .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$14)
    4715                    .dwattr $C$DW$298, DW_AT_name("__max_align1")
    4716                    .dwattr $C$DW$298, DW_AT_TI_symbol_name("__max_align1")
    4717                    .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4718                    .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4719                    .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4720                    .dwattr $C$DW$298, DW_AT_decl_line(0x7b)
    4721                    .dwattr $C$DW$298, DW_AT_decl_column(0x0c)
    4722            
    4723            $C$DW$299       .dwtag  DW_TAG_member
    4724                    .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$18)
    4725                    .dwattr $C$DW$299, DW_AT_name("__max_align2")
    4726                    .dwattr $C$DW$299, DW_AT_TI_symbol_name("__max_align2")
    4727                    .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4728                    .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4729                    .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4730                    .dwattr $C$DW$299, DW_AT_decl_line(0x7c)
    4731                    .dwattr $C$DW$299, DW_AT_decl_column(0x0e)
    4732            
    4733                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4734                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    4735                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4736                    .dwendtag $C$DW$T$22
    4737            
    4738            $C$DW$T$61      .dwtag  DW_TAG_typedef
    4739                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    4740                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    4741                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4742                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4743                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    4744                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    4745            
    4746            
    4747            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4748                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    4749                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    4750            $C$DW$300       .dwtag  DW_TAG_member
    4751                    .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$24)
    4752                    .dwattr $C$DW$300, DW_AT_name("memoryBufferControlIndex")
    4753                    .dwattr $C$DW$300, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    4754                    .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE   97

    4755                    .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4756                    .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4757                    .dwattr $C$DW$300, DW_AT_decl_line(0x27)
    4758                    .dwattr $C$DW$300, DW_AT_decl_column(0x0d)
    4759            
    4760            $C$DW$301       .dwtag  DW_TAG_member
    4761                    .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$24)
    4762                    .dwattr $C$DW$301, DW_AT_name("inputSourceSelect")
    4763                    .dwattr $C$DW$301, DW_AT_TI_symbol_name("inputSourceSelect")
    4764                    .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4765                    .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4766                    .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4767                    .dwattr $C$DW$301, DW_AT_decl_line(0x3b)
    4768                    .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    4769            
    4770            $C$DW$302       .dwtag  DW_TAG_member
    4771                    .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$24)
    4772                    .dwattr $C$DW$302, DW_AT_name("positiveRefVoltageSourceSelect")
    4773                    .dwattr $C$DW$302, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    4774                    .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4775                    .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4776                    .dwattr $C$DW$302, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4777                    .dwattr $C$DW$302, DW_AT_decl_line(0x42)
    4778                    .dwattr $C$DW$302, DW_AT_decl_column(0x0d)
    4779            
    4780            $C$DW$303       .dwtag  DW_TAG_member
    4781                    .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$24)
    4782                    .dwattr $C$DW$303, DW_AT_name("negativeRefVoltageSourceSelect")
    4783                    .dwattr $C$DW$303, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    4784                    .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4785                    .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4786                    .dwattr $C$DW$303, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4787                    .dwattr $C$DW$303, DW_AT_decl_line(0x48)
    4788                    .dwattr $C$DW$303, DW_AT_decl_column(0x0d)
    4789            
    4790            $C$DW$304       .dwtag  DW_TAG_member
    4791                    .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$24)
    4792                    .dwattr $C$DW$304, DW_AT_name("endOfSequence")
    4793                    .dwattr $C$DW$304, DW_AT_TI_symbol_name("endOfSequence")
    4794                    .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4795                    .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4796                    .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4797                    .dwattr $C$DW$304, DW_AT_decl_line(0x51)
    4798                    .dwattr $C$DW$304, DW_AT_decl_column(0x0d)
    4799            
    4800                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4801                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    4802                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4803                    .dwendtag $C$DW$T$25
    4804            
    4805            $C$DW$T$62      .dwtag  DW_TAG_typedef
    4806                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    4807                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    4808                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4809                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE   98

    4810                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    4811                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    4812            
    4813            
    4814            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4815                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    4816                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    4817            $C$DW$305       .dwtag  DW_TAG_member
    4818                    .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$27)
    4819                    .dwattr $C$DW$305, DW_AT_name("captureRegister")
    4820                    .dwattr $C$DW$305, DW_AT_TI_symbol_name("captureRegister")
    4821                    .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4822                    .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4823                    .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4824                    .dwattr $C$DW$305, DW_AT_decl_line(0x58)
    4825                    .dwattr $C$DW$305, DW_AT_decl_column(0x0e)
    4826            
    4827            $C$DW$306       .dwtag  DW_TAG_member
    4828                    .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$27)
    4829                    .dwattr $C$DW$306, DW_AT_name("captureMode")
    4830                    .dwattr $C$DW$306, DW_AT_TI_symbol_name("captureMode")
    4831                    .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4832                    .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4833                    .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4834                    .dwattr $C$DW$306, DW_AT_decl_line(0x5f)
    4835                    .dwattr $C$DW$306, DW_AT_decl_column(0x0e)
    4836            
    4837            $C$DW$307       .dwtag  DW_TAG_member
    4838                    .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$27)
    4839                    .dwattr $C$DW$307, DW_AT_name("captureInputSelect")
    4840                    .dwattr $C$DW$307, DW_AT_TI_symbol_name("captureInputSelect")
    4841                    .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4842                    .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4843                    .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4844                    .dwattr $C$DW$307, DW_AT_decl_line(0x66)
    4845                    .dwattr $C$DW$307, DW_AT_decl_column(0x0e)
    4846            
    4847            $C$DW$308       .dwtag  DW_TAG_member
    4848                    .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$27)
    4849                    .dwattr $C$DW$308, DW_AT_name("synchronizeCaptureSource")
    4850                    .dwattr $C$DW$308, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4851                    .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4852                    .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4853                    .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4854                    .dwattr $C$DW$308, DW_AT_decl_line(0x6b)
    4855                    .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    4856            
    4857            $C$DW$309       .dwtag  DW_TAG_member
    4858                    .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$27)
    4859                    .dwattr $C$DW$309, DW_AT_name("captureInterruptEnable")
    4860                    .dwattr $C$DW$309, DW_AT_TI_symbol_name("captureInterruptEnable")
    4861                    .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4862                    .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4863                    .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4864                    .dwattr $C$DW$309, DW_AT_decl_line(0x70)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE   99

    4865                    .dwattr $C$DW$309, DW_AT_decl_column(0x0e)
    4866            
    4867            $C$DW$310       .dwtag  DW_TAG_member
    4868                    .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$27)
    4869                    .dwattr $C$DW$310, DW_AT_name("captureOutputMode")
    4870                    .dwattr $C$DW$310, DW_AT_TI_symbol_name("captureOutputMode")
    4871                    .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4872                    .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4873                    .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4874                    .dwattr $C$DW$310, DW_AT_decl_line(0x7b)
    4875                    .dwattr $C$DW$310, DW_AT_decl_column(0x0e)
    4876            
    4877                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4878                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    4879                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4880                    .dwendtag $C$DW$T$28
    4881            
    4882            $C$DW$T$63      .dwtag  DW_TAG_typedef
    4883                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    4884                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    4885                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4886                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4887                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    4888                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    4889            
    4890            
    4891            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4892                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    4893                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4894            $C$DW$311       .dwtag  DW_TAG_member
    4895                    .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$27)
    4896                    .dwattr $C$DW$311, DW_AT_name("compareRegister")
    4897                    .dwattr $C$DW$311, DW_AT_TI_symbol_name("compareRegister")
    4898                    .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4899                    .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4900                    .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4901                    .dwattr $C$DW$311, DW_AT_decl_line(0x145)
    4902                    .dwattr $C$DW$311, DW_AT_decl_column(0x0e)
    4903            
    4904            $C$DW$312       .dwtag  DW_TAG_member
    4905                    .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    4906                    .dwattr $C$DW$312, DW_AT_name("compareInterruptEnable")
    4907                    .dwattr $C$DW$312, DW_AT_TI_symbol_name("compareInterruptEnable")
    4908                    .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4909                    .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4910                    .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4911                    .dwattr $C$DW$312, DW_AT_decl_line(0x14a)
    4912                    .dwattr $C$DW$312, DW_AT_decl_column(0x0e)
    4913            
    4914            $C$DW$313       .dwtag  DW_TAG_member
    4915                    .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$27)
    4916                    .dwattr $C$DW$313, DW_AT_name("compareOutputMode")
    4917                    .dwattr $C$DW$313, DW_AT_TI_symbol_name("compareOutputMode")
    4918                    .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4919                    .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  100

    4920                    .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4921                    .dwattr $C$DW$313, DW_AT_decl_line(0x155)
    4922                    .dwattr $C$DW$313, DW_AT_decl_column(0x0e)
    4923            
    4924            $C$DW$314       .dwtag  DW_TAG_member
    4925                    .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$27)
    4926                    .dwattr $C$DW$314, DW_AT_name("compareValue")
    4927                    .dwattr $C$DW$314, DW_AT_TI_symbol_name("compareValue")
    4928                    .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4929                    .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4930                    .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4931                    .dwattr $C$DW$314, DW_AT_decl_line(0x157)
    4932                    .dwattr $C$DW$314, DW_AT_decl_column(0x0e)
    4933            
    4934                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4935                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4936                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4937                    .dwendtag $C$DW$T$29
    4938            
    4939            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4940                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4941                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4942                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4943                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4944                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4945                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    4946            
    4947            
    4948            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4949                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    4950                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4951            $C$DW$315       .dwtag  DW_TAG_member
    4952                    .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$27)
    4953                    .dwattr $C$DW$315, DW_AT_name("clockSource")
    4954                    .dwattr $C$DW$315, DW_AT_TI_symbol_name("clockSource")
    4955                    .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4956                    .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4957                    .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4958                    .dwattr $C$DW$315, DW_AT_decl_line(0x20)
    4959                    .dwattr $C$DW$315, DW_AT_decl_column(0x0e)
    4960            
    4961            $C$DW$316       .dwtag  DW_TAG_member
    4962                    .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$27)
    4963                    .dwattr $C$DW$316, DW_AT_name("clockSourceDivider")
    4964                    .dwattr $C$DW$316, DW_AT_TI_symbol_name("clockSourceDivider")
    4965                    .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4966                    .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4967                    .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4968                    .dwattr $C$DW$316, DW_AT_decl_line(0x37)
    4969                    .dwattr $C$DW$316, DW_AT_decl_column(0x0e)
    4970            
    4971            $C$DW$317       .dwtag  DW_TAG_member
    4972                    .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$27)
    4973                    .dwattr $C$DW$317, DW_AT_name("timerInterruptEnable_TAIE")
    4974                    .dwattr $C$DW$317, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  101

    4975                    .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4976                    .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4977                    .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4978                    .dwattr $C$DW$317, DW_AT_decl_line(0x3c)
    4979                    .dwattr $C$DW$317, DW_AT_decl_column(0x0e)
    4980            
    4981            $C$DW$318       .dwtag  DW_TAG_member
    4982                    .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$27)
    4983                    .dwattr $C$DW$318, DW_AT_name("timerClear")
    4984                    .dwattr $C$DW$318, DW_AT_TI_symbol_name("timerClear")
    4985                    .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4986                    .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4987                    .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4988                    .dwattr $C$DW$318, DW_AT_decl_line(0x42)
    4989                    .dwattr $C$DW$318, DW_AT_decl_column(0x0e)
    4990            
    4991            $C$DW$319       .dwtag  DW_TAG_member
    4992                    .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$30)
    4993                    .dwattr $C$DW$319, DW_AT_name("startTimer")
    4994                    .dwattr $C$DW$319, DW_AT_TI_symbol_name("startTimer")
    4995                    .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4996                    .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4997                    .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4998                    .dwattr $C$DW$319, DW_AT_decl_line(0x44)
    4999                    .dwattr $C$DW$319, DW_AT_decl_column(0x0a)
    5000            
    5001                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5002                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    5003                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5004                    .dwendtag $C$DW$T$31
    5005            
    5006            $C$DW$T$65      .dwtag  DW_TAG_typedef
    5007                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    5008                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    5009                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5010                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5011                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    5012                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    5013            
    5014            
    5015            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5016                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    5017                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    5018            $C$DW$320       .dwtag  DW_TAG_member
    5019                    .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$27)
    5020                    .dwattr $C$DW$320, DW_AT_name("clockSource")
    5021                    .dwattr $C$DW$320, DW_AT_TI_symbol_name("clockSource")
    5022                    .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5023                    .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5024                    .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5025                    .dwattr $C$DW$320, DW_AT_decl_line(0x8b)
    5026                    .dwattr $C$DW$320, DW_AT_decl_column(0x0e)
    5027            
    5028            $C$DW$321       .dwtag  DW_TAG_member
    5029                    .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  102

    5030                    .dwattr $C$DW$321, DW_AT_name("clockSourceDivider")
    5031                    .dwattr $C$DW$321, DW_AT_TI_symbol_name("clockSourceDivider")
    5032                    .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5033                    .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5034                    .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5035                    .dwattr $C$DW$321, DW_AT_decl_line(0xa2)
    5036                    .dwattr $C$DW$321, DW_AT_decl_column(0x0e)
    5037            
    5038            $C$DW$322       .dwtag  DW_TAG_member
    5039                    .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    5040                    .dwattr $C$DW$322, DW_AT_name("timerPeriod")
    5041                    .dwattr $C$DW$322, DW_AT_TI_symbol_name("timerPeriod")
    5042                    .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5043                    .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5044                    .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5045                    .dwattr $C$DW$322, DW_AT_decl_line(0xa4)
    5046                    .dwattr $C$DW$322, DW_AT_decl_column(0x0e)
    5047            
    5048            $C$DW$323       .dwtag  DW_TAG_member
    5049                    .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    5050                    .dwattr $C$DW$323, DW_AT_name("timerInterruptEnable_TAIE")
    5051                    .dwattr $C$DW$323, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5052                    .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5053                    .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5054                    .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5055                    .dwattr $C$DW$323, DW_AT_decl_line(0xa9)
    5056                    .dwattr $C$DW$323, DW_AT_decl_column(0x0e)
    5057            
    5058            $C$DW$324       .dwtag  DW_TAG_member
    5059                    .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$27)
    5060                    .dwattr $C$DW$324, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5061                    .dwattr $C$DW$324, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5062                    .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5063                    .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5064                    .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5065                    .dwattr $C$DW$324, DW_AT_decl_line(0xae)
    5066                    .dwattr $C$DW$324, DW_AT_decl_column(0x0e)
    5067            
    5068            $C$DW$325       .dwtag  DW_TAG_member
    5069                    .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$27)
    5070                    .dwattr $C$DW$325, DW_AT_name("timerClear")
    5071                    .dwattr $C$DW$325, DW_AT_TI_symbol_name("timerClear")
    5072                    .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5073                    .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5074                    .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5075                    .dwattr $C$DW$325, DW_AT_decl_line(0xb4)
    5076                    .dwattr $C$DW$325, DW_AT_decl_column(0x0e)
    5077            
    5078            $C$DW$326       .dwtag  DW_TAG_member
    5079                    .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$30)
    5080                    .dwattr $C$DW$326, DW_AT_name("startTimer")
    5081                    .dwattr $C$DW$326, DW_AT_TI_symbol_name("startTimer")
    5082                    .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5083                    .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5084                    .dwattr $C$DW$326, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  103

    5085                    .dwattr $C$DW$326, DW_AT_decl_line(0xb6)
    5086                    .dwattr $C$DW$326, DW_AT_decl_column(0x0a)
    5087            
    5088                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5089                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    5090                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    5091                    .dwendtag $C$DW$T$32
    5092            
    5093            $C$DW$T$66      .dwtag  DW_TAG_typedef
    5094                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    5095                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    5096                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    5097                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5098                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    5099                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    5100            
    5101            
    5102            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5103                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    5104                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    5105            $C$DW$327       .dwtag  DW_TAG_member
    5106                    .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$27)
    5107                    .dwattr $C$DW$327, DW_AT_name("clockSource")
    5108                    .dwattr $C$DW$327, DW_AT_TI_symbol_name("clockSource")
    5109                    .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5110                    .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5111                    .dwattr $C$DW$327, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5112                    .dwattr $C$DW$327, DW_AT_decl_line(0x105)
    5113                    .dwattr $C$DW$327, DW_AT_decl_column(0x0e)
    5114            
    5115            $C$DW$328       .dwtag  DW_TAG_member
    5116                    .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$27)
    5117                    .dwattr $C$DW$328, DW_AT_name("clockSourceDivider")
    5118                    .dwattr $C$DW$328, DW_AT_TI_symbol_name("clockSourceDivider")
    5119                    .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5120                    .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5121                    .dwattr $C$DW$328, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5122                    .dwattr $C$DW$328, DW_AT_decl_line(0x11c)
    5123                    .dwattr $C$DW$328, DW_AT_decl_column(0x0e)
    5124            
    5125            $C$DW$329       .dwtag  DW_TAG_member
    5126                    .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$27)
    5127                    .dwattr $C$DW$329, DW_AT_name("timerPeriod")
    5128                    .dwattr $C$DW$329, DW_AT_TI_symbol_name("timerPeriod")
    5129                    .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5130                    .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5131                    .dwattr $C$DW$329, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5132                    .dwattr $C$DW$329, DW_AT_decl_line(0x11f)
    5133                    .dwattr $C$DW$329, DW_AT_decl_column(0x0e)
    5134            
    5135            $C$DW$330       .dwtag  DW_TAG_member
    5136                    .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$27)
    5137                    .dwattr $C$DW$330, DW_AT_name("timerInterruptEnable_TAIE")
    5138                    .dwattr $C$DW$330, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5139                    .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  104

    5140                    .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5141                    .dwattr $C$DW$330, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5142                    .dwattr $C$DW$330, DW_AT_decl_line(0x124)
    5143                    .dwattr $C$DW$330, DW_AT_decl_column(0x0e)
    5144            
    5145            $C$DW$331       .dwtag  DW_TAG_member
    5146                    .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$27)
    5147                    .dwattr $C$DW$331, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5148                    .dwattr $C$DW$331, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5149                    .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5150                    .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5151                    .dwattr $C$DW$331, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5152                    .dwattr $C$DW$331, DW_AT_decl_line(0x129)
    5153                    .dwattr $C$DW$331, DW_AT_decl_column(0x0e)
    5154            
    5155            $C$DW$332       .dwtag  DW_TAG_member
    5156                    .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$27)
    5157                    .dwattr $C$DW$332, DW_AT_name("timerClear")
    5158                    .dwattr $C$DW$332, DW_AT_TI_symbol_name("timerClear")
    5159                    .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5160                    .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5161                    .dwattr $C$DW$332, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5162                    .dwattr $C$DW$332, DW_AT_decl_line(0x12f)
    5163                    .dwattr $C$DW$332, DW_AT_decl_column(0x0e)
    5164            
    5165            $C$DW$333       .dwtag  DW_TAG_member
    5166                    .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$30)
    5167                    .dwattr $C$DW$333, DW_AT_name("startTimer")
    5168                    .dwattr $C$DW$333, DW_AT_TI_symbol_name("startTimer")
    5169                    .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5170                    .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5171                    .dwattr $C$DW$333, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5172                    .dwattr $C$DW$333, DW_AT_decl_line(0x131)
    5173                    .dwattr $C$DW$333, DW_AT_decl_column(0x0a)
    5174            
    5175                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5176                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    5177                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    5178                    .dwendtag $C$DW$T$33
    5179            
    5180            $C$DW$T$67      .dwtag  DW_TAG_typedef
    5181                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    5182                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    5183                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    5184                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5185                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    5186                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    5187            
    5188            
    5189            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5190                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    5191                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    5192            $C$DW$334       .dwtag  DW_TAG_member
    5193                    .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$27)
    5194                    .dwattr $C$DW$334, DW_AT_name("clockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  105

    5195                    .dwattr $C$DW$334, DW_AT_TI_symbol_name("clockSource")
    5196                    .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5197                    .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5198                    .dwattr $C$DW$334, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5199                    .dwattr $C$DW$334, DW_AT_decl_line(0xc5)
    5200                    .dwattr $C$DW$334, DW_AT_decl_column(0x0e)
    5201            
    5202            $C$DW$335       .dwtag  DW_TAG_member
    5203                    .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$27)
    5204                    .dwattr $C$DW$335, DW_AT_name("clockSourceDivider")
    5205                    .dwattr $C$DW$335, DW_AT_TI_symbol_name("clockSourceDivider")
    5206                    .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5207                    .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5208                    .dwattr $C$DW$335, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5209                    .dwattr $C$DW$335, DW_AT_decl_line(0xdc)
    5210                    .dwattr $C$DW$335, DW_AT_decl_column(0x0e)
    5211            
    5212            $C$DW$336       .dwtag  DW_TAG_member
    5213                    .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$27)
    5214                    .dwattr $C$DW$336, DW_AT_name("timerPeriod")
    5215                    .dwattr $C$DW$336, DW_AT_TI_symbol_name("timerPeriod")
    5216                    .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5217                    .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5218                    .dwattr $C$DW$336, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5219                    .dwattr $C$DW$336, DW_AT_decl_line(0xde)
    5220                    .dwattr $C$DW$336, DW_AT_decl_column(0x0e)
    5221            
    5222            $C$DW$337       .dwtag  DW_TAG_member
    5223                    .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$27)
    5224                    .dwattr $C$DW$337, DW_AT_name("compareRegister")
    5225                    .dwattr $C$DW$337, DW_AT_TI_symbol_name("compareRegister")
    5226                    .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5227                    .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5228                    .dwattr $C$DW$337, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5229                    .dwattr $C$DW$337, DW_AT_decl_line(0xe9)
    5230                    .dwattr $C$DW$337, DW_AT_decl_column(0x0e)
    5231            
    5232            $C$DW$338       .dwtag  DW_TAG_member
    5233                    .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$27)
    5234                    .dwattr $C$DW$338, DW_AT_name("compareOutputMode")
    5235                    .dwattr $C$DW$338, DW_AT_TI_symbol_name("compareOutputMode")
    5236                    .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5237                    .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5238                    .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5239                    .dwattr $C$DW$338, DW_AT_decl_line(0xf4)
    5240                    .dwattr $C$DW$338, DW_AT_decl_column(0x0e)
    5241            
    5242            $C$DW$339       .dwtag  DW_TAG_member
    5243                    .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$27)
    5244                    .dwattr $C$DW$339, DW_AT_name("dutyCycle")
    5245                    .dwattr $C$DW$339, DW_AT_TI_symbol_name("dutyCycle")
    5246                    .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5247                    .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5248                    .dwattr $C$DW$339, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5249                    .dwattr $C$DW$339, DW_AT_decl_line(0xf6)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  106

    5250                    .dwattr $C$DW$339, DW_AT_decl_column(0x0e)
    5251            
    5252                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5253                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    5254                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    5255                    .dwendtag $C$DW$T$34
    5256            
    5257            $C$DW$T$68      .dwtag  DW_TAG_typedef
    5258                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    5259                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    5260                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    5261                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5262                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    5263                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    5264            
    5265            
    5266            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5267                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    5268                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    5269            $C$DW$340       .dwtag  DW_TAG_member
    5270                    .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$27)
    5271                    .dwattr $C$DW$340, DW_AT_name("captureRegister")
    5272                    .dwattr $C$DW$340, DW_AT_TI_symbol_name("captureRegister")
    5273                    .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5274                    .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5275                    .dwattr $C$DW$340, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5276                    .dwattr $C$DW$340, DW_AT_decl_line(0xa0)
    5277                    .dwattr $C$DW$340, DW_AT_decl_column(0x0e)
    5278            
    5279            $C$DW$341       .dwtag  DW_TAG_member
    5280                    .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$27)
    5281                    .dwattr $C$DW$341, DW_AT_name("captureMode")
    5282                    .dwattr $C$DW$341, DW_AT_TI_symbol_name("captureMode")
    5283                    .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5284                    .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5285                    .dwattr $C$DW$341, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5286                    .dwattr $C$DW$341, DW_AT_decl_line(0xa7)
    5287                    .dwattr $C$DW$341, DW_AT_decl_column(0x0e)
    5288            
    5289            $C$DW$342       .dwtag  DW_TAG_member
    5290                    .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$27)
    5291                    .dwattr $C$DW$342, DW_AT_name("captureInputSelect")
    5292                    .dwattr $C$DW$342, DW_AT_TI_symbol_name("captureInputSelect")
    5293                    .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5294                    .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5295                    .dwattr $C$DW$342, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5296                    .dwattr $C$DW$342, DW_AT_decl_line(0xae)
    5297                    .dwattr $C$DW$342, DW_AT_decl_column(0x0e)
    5298            
    5299            $C$DW$343       .dwtag  DW_TAG_member
    5300                    .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$27)
    5301                    .dwattr $C$DW$343, DW_AT_name("synchronizeCaptureSource")
    5302                    .dwattr $C$DW$343, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    5303                    .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5304                    .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  107

    5305                    .dwattr $C$DW$343, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5306                    .dwattr $C$DW$343, DW_AT_decl_line(0xb3)
    5307                    .dwattr $C$DW$343, DW_AT_decl_column(0x0e)
    5308            
    5309            $C$DW$344       .dwtag  DW_TAG_member
    5310                    .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$27)
    5311                    .dwattr $C$DW$344, DW_AT_name("captureInterruptEnable")
    5312                    .dwattr $C$DW$344, DW_AT_TI_symbol_name("captureInterruptEnable")
    5313                    .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5314                    .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5315                    .dwattr $C$DW$344, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5316                    .dwattr $C$DW$344, DW_AT_decl_line(0xb8)
    5317                    .dwattr $C$DW$344, DW_AT_decl_column(0x0e)
    5318            
    5319            $C$DW$345       .dwtag  DW_TAG_member
    5320                    .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$27)
    5321                    .dwattr $C$DW$345, DW_AT_name("captureOutputMode")
    5322                    .dwattr $C$DW$345, DW_AT_TI_symbol_name("captureOutputMode")
    5323                    .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5324                    .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5325                    .dwattr $C$DW$345, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5326                    .dwattr $C$DW$345, DW_AT_decl_line(0xc3)
    5327                    .dwattr $C$DW$345, DW_AT_decl_column(0x0e)
    5328            
    5329                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5330                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    5331                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    5332                    .dwendtag $C$DW$T$35
    5333            
    5334            $C$DW$T$69      .dwtag  DW_TAG_typedef
    5335                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    5336                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    5337                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    5338                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5339                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    5340                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    5341            
    5342            
    5343            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5344                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    5345                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    5346            $C$DW$346       .dwtag  DW_TAG_member
    5347                    .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$27)
    5348                    .dwattr $C$DW$346, DW_AT_name("compareRegister")
    5349                    .dwattr $C$DW$346, DW_AT_TI_symbol_name("compareRegister")
    5350                    .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5351                    .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5352                    .dwattr $C$DW$346, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5353                    .dwattr $C$DW$346, DW_AT_decl_line(0x146)
    5354                    .dwattr $C$DW$346, DW_AT_decl_column(0x0e)
    5355            
    5356            $C$DW$347       .dwtag  DW_TAG_member
    5357                    .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$27)
    5358                    .dwattr $C$DW$347, DW_AT_name("compareInterruptEnable")
    5359                    .dwattr $C$DW$347, DW_AT_TI_symbol_name("compareInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  108

    5360                    .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5361                    .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5362                    .dwattr $C$DW$347, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5363                    .dwattr $C$DW$347, DW_AT_decl_line(0x14b)
    5364                    .dwattr $C$DW$347, DW_AT_decl_column(0x0e)
    5365            
    5366            $C$DW$348       .dwtag  DW_TAG_member
    5367                    .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$27)
    5368                    .dwattr $C$DW$348, DW_AT_name("compareOutputMode")
    5369                    .dwattr $C$DW$348, DW_AT_TI_symbol_name("compareOutputMode")
    5370                    .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5371                    .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5372                    .dwattr $C$DW$348, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5373                    .dwattr $C$DW$348, DW_AT_decl_line(0x156)
    5374                    .dwattr $C$DW$348, DW_AT_decl_column(0x0e)
    5375            
    5376            $C$DW$349       .dwtag  DW_TAG_member
    5377                    .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
    5378                    .dwattr $C$DW$349, DW_AT_name("compareValue")
    5379                    .dwattr $C$DW$349, DW_AT_TI_symbol_name("compareValue")
    5380                    .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5381                    .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5382                    .dwattr $C$DW$349, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5383                    .dwattr $C$DW$349, DW_AT_decl_line(0x158)
    5384                    .dwattr $C$DW$349, DW_AT_decl_column(0x0e)
    5385            
    5386                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5387                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    5388                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    5389                    .dwendtag $C$DW$T$36
    5390            
    5391            $C$DW$T$70      .dwtag  DW_TAG_typedef
    5392                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    5393                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    5394                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    5395                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5396                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    5397                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    5398            
    5399            
    5400            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5401                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    5402                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    5403            $C$DW$350       .dwtag  DW_TAG_member
    5404                    .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$27)
    5405                    .dwattr $C$DW$350, DW_AT_name("clockSource")
    5406                    .dwattr $C$DW$350, DW_AT_TI_symbol_name("clockSource")
    5407                    .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5408                    .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5409                    .dwattr $C$DW$350, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5410                    .dwattr $C$DW$350, DW_AT_decl_line(0xd3)
    5411                    .dwattr $C$DW$350, DW_AT_decl_column(0x0e)
    5412            
    5413            $C$DW$351       .dwtag  DW_TAG_member
    5414                    .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  109

    5415                    .dwattr $C$DW$351, DW_AT_name("clockSourceDivider")
    5416                    .dwattr $C$DW$351, DW_AT_TI_symbol_name("clockSourceDivider")
    5417                    .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5418                    .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5419                    .dwattr $C$DW$351, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5420                    .dwattr $C$DW$351, DW_AT_decl_line(0xea)
    5421                    .dwattr $C$DW$351, DW_AT_decl_column(0x0e)
    5422            
    5423            $C$DW$352       .dwtag  DW_TAG_member
    5424                    .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$27)
    5425                    .dwattr $C$DW$352, DW_AT_name("timerInterruptEnable_TBIE")
    5426                    .dwattr $C$DW$352, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5427                    .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5428                    .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5429                    .dwattr $C$DW$352, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5430                    .dwattr $C$DW$352, DW_AT_decl_line(0xef)
    5431                    .dwattr $C$DW$352, DW_AT_decl_column(0x0e)
    5432            
    5433            $C$DW$353       .dwtag  DW_TAG_member
    5434                    .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$27)
    5435                    .dwattr $C$DW$353, DW_AT_name("timerClear")
    5436                    .dwattr $C$DW$353, DW_AT_TI_symbol_name("timerClear")
    5437                    .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5438                    .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5439                    .dwattr $C$DW$353, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5440                    .dwattr $C$DW$353, DW_AT_decl_line(0xf5)
    5441                    .dwattr $C$DW$353, DW_AT_decl_column(0x0e)
    5442            
    5443            $C$DW$354       .dwtag  DW_TAG_member
    5444                    .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$30)
    5445                    .dwattr $C$DW$354, DW_AT_name("startTimer")
    5446                    .dwattr $C$DW$354, DW_AT_TI_symbol_name("startTimer")
    5447                    .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5448                    .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5449                    .dwattr $C$DW$354, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5450                    .dwattr $C$DW$354, DW_AT_decl_line(0xf7)
    5451                    .dwattr $C$DW$354, DW_AT_decl_column(0x0a)
    5452            
    5453                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5454                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    5455                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5456                    .dwendtag $C$DW$T$37
    5457            
    5458            $C$DW$T$71      .dwtag  DW_TAG_typedef
    5459                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    5460                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    5461                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    5462                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5463                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    5464                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    5465            
    5466            
    5467            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5468                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    5469                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  110

    5470            $C$DW$355       .dwtag  DW_TAG_member
    5471                    .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$27)
    5472                    .dwattr $C$DW$355, DW_AT_name("clockSource")
    5473                    .dwattr $C$DW$355, DW_AT_TI_symbol_name("clockSource")
    5474                    .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5475                    .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5476                    .dwattr $C$DW$355, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5477                    .dwattr $C$DW$355, DW_AT_decl_line(0x107)
    5478                    .dwattr $C$DW$355, DW_AT_decl_column(0x0e)
    5479            
    5480            $C$DW$356       .dwtag  DW_TAG_member
    5481                    .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$27)
    5482                    .dwattr $C$DW$356, DW_AT_name("clockSourceDivider")
    5483                    .dwattr $C$DW$356, DW_AT_TI_symbol_name("clockSourceDivider")
    5484                    .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5485                    .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5486                    .dwattr $C$DW$356, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5487                    .dwattr $C$DW$356, DW_AT_decl_line(0x11e)
    5488                    .dwattr $C$DW$356, DW_AT_decl_column(0x0e)
    5489            
    5490            $C$DW$357       .dwtag  DW_TAG_member
    5491                    .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$27)
    5492                    .dwattr $C$DW$357, DW_AT_name("timerPeriod")
    5493                    .dwattr $C$DW$357, DW_AT_TI_symbol_name("timerPeriod")
    5494                    .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5495                    .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5496                    .dwattr $C$DW$357, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5497                    .dwattr $C$DW$357, DW_AT_decl_line(0x120)
    5498                    .dwattr $C$DW$357, DW_AT_decl_column(0x0e)
    5499            
    5500            $C$DW$358       .dwtag  DW_TAG_member
    5501                    .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$27)
    5502                    .dwattr $C$DW$358, DW_AT_name("timerInterruptEnable_TBIE")
    5503                    .dwattr $C$DW$358, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5504                    .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5505                    .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5506                    .dwattr $C$DW$358, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5507                    .dwattr $C$DW$358, DW_AT_decl_line(0x125)
    5508                    .dwattr $C$DW$358, DW_AT_decl_column(0x0e)
    5509            
    5510            $C$DW$359       .dwtag  DW_TAG_member
    5511                    .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$27)
    5512                    .dwattr $C$DW$359, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5513                    .dwattr $C$DW$359, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5514                    .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5515                    .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5516                    .dwattr $C$DW$359, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5517                    .dwattr $C$DW$359, DW_AT_decl_line(0x12a)
    5518                    .dwattr $C$DW$359, DW_AT_decl_column(0x0e)
    5519            
    5520            $C$DW$360       .dwtag  DW_TAG_member
    5521                    .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$27)
    5522                    .dwattr $C$DW$360, DW_AT_name("timerClear")
    5523                    .dwattr $C$DW$360, DW_AT_TI_symbol_name("timerClear")
    5524                    .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  111

    5525                    .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5526                    .dwattr $C$DW$360, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5527                    .dwattr $C$DW$360, DW_AT_decl_line(0x130)
    5528                    .dwattr $C$DW$360, DW_AT_decl_column(0x0e)
    5529            
    5530            $C$DW$361       .dwtag  DW_TAG_member
    5531                    .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$30)
    5532                    .dwattr $C$DW$361, DW_AT_name("startTimer")
    5533                    .dwattr $C$DW$361, DW_AT_TI_symbol_name("startTimer")
    5534                    .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5535                    .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5536                    .dwattr $C$DW$361, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5537                    .dwattr $C$DW$361, DW_AT_decl_line(0x132)
    5538                    .dwattr $C$DW$361, DW_AT_decl_column(0x0a)
    5539            
    5540                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5541                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    5542                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    5543                    .dwendtag $C$DW$T$38
    5544            
    5545            $C$DW$T$72      .dwtag  DW_TAG_typedef
    5546                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    5547                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    5548                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    5549                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5550                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    5551                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    5552            
    5553            
    5554            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5555                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    5556                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    5557            $C$DW$362       .dwtag  DW_TAG_member
    5558                    .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$27)
    5559                    .dwattr $C$DW$362, DW_AT_name("clockSource")
    5560                    .dwattr $C$DW$362, DW_AT_TI_symbol_name("clockSource")
    5561                    .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5562                    .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5563                    .dwattr $C$DW$362, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5564                    .dwattr $C$DW$362, DW_AT_decl_line(0x60)
    5565                    .dwattr $C$DW$362, DW_AT_decl_column(0x0e)
    5566            
    5567            $C$DW$363       .dwtag  DW_TAG_member
    5568                    .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$27)
    5569                    .dwattr $C$DW$363, DW_AT_name("clockSourceDivider")
    5570                    .dwattr $C$DW$363, DW_AT_TI_symbol_name("clockSourceDivider")
    5571                    .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5572                    .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5573                    .dwattr $C$DW$363, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5574                    .dwattr $C$DW$363, DW_AT_decl_line(0x77)
    5575                    .dwattr $C$DW$363, DW_AT_decl_column(0x0e)
    5576            
    5577            $C$DW$364       .dwtag  DW_TAG_member
    5578                    .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$27)
    5579                    .dwattr $C$DW$364, DW_AT_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  112

    5580                    .dwattr $C$DW$364, DW_AT_TI_symbol_name("timerPeriod")
    5581                    .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5582                    .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5583                    .dwattr $C$DW$364, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5584                    .dwattr $C$DW$364, DW_AT_decl_line(0x7a)
    5585                    .dwattr $C$DW$364, DW_AT_decl_column(0x0e)
    5586            
    5587            $C$DW$365       .dwtag  DW_TAG_member
    5588                    .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$27)
    5589                    .dwattr $C$DW$365, DW_AT_name("timerInterruptEnable_TBIE")
    5590                    .dwattr $C$DW$365, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5591                    .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5592                    .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5593                    .dwattr $C$DW$365, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5594                    .dwattr $C$DW$365, DW_AT_decl_line(0x7f)
    5595                    .dwattr $C$DW$365, DW_AT_decl_column(0x0e)
    5596            
    5597            $C$DW$366       .dwtag  DW_TAG_member
    5598                    .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$27)
    5599                    .dwattr $C$DW$366, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5600                    .dwattr $C$DW$366, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5601                    .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5602                    .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5603                    .dwattr $C$DW$366, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5604                    .dwattr $C$DW$366, DW_AT_decl_line(0x84)
    5605                    .dwattr $C$DW$366, DW_AT_decl_column(0x0e)
    5606            
    5607            $C$DW$367       .dwtag  DW_TAG_member
    5608                    .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$27)
    5609                    .dwattr $C$DW$367, DW_AT_name("timerClear")
    5610                    .dwattr $C$DW$367, DW_AT_TI_symbol_name("timerClear")
    5611                    .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5612                    .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5613                    .dwattr $C$DW$367, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5614                    .dwattr $C$DW$367, DW_AT_decl_line(0x8a)
    5615                    .dwattr $C$DW$367, DW_AT_decl_column(0x0e)
    5616            
    5617            $C$DW$368       .dwtag  DW_TAG_member
    5618                    .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$30)
    5619                    .dwattr $C$DW$368, DW_AT_name("startTimer")
    5620                    .dwattr $C$DW$368, DW_AT_TI_symbol_name("startTimer")
    5621                    .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5622                    .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5623                    .dwattr $C$DW$368, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5624                    .dwattr $C$DW$368, DW_AT_decl_line(0x8c)
    5625                    .dwattr $C$DW$368, DW_AT_decl_column(0x0a)
    5626            
    5627                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5628                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    5629                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    5630                    .dwendtag $C$DW$T$39
    5631            
    5632            $C$DW$T$73      .dwtag  DW_TAG_typedef
    5633                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    5634                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  113

    5635                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5636                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5637                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    5638                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    5639            
    5640            
    5641            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5642                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    5643                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    5644            $C$DW$369       .dwtag  DW_TAG_member
    5645                    .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$27)
    5646                    .dwattr $C$DW$369, DW_AT_name("clockSource")
    5647                    .dwattr $C$DW$369, DW_AT_TI_symbol_name("clockSource")
    5648                    .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5649                    .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5650                    .dwattr $C$DW$369, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5651                    .dwattr $C$DW$369, DW_AT_decl_line(0x20)
    5652                    .dwattr $C$DW$369, DW_AT_decl_column(0x0e)
    5653            
    5654            $C$DW$370       .dwtag  DW_TAG_member
    5655                    .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$27)
    5656                    .dwattr $C$DW$370, DW_AT_name("clockSourceDivider")
    5657                    .dwattr $C$DW$370, DW_AT_TI_symbol_name("clockSourceDivider")
    5658                    .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5659                    .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5660                    .dwattr $C$DW$370, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5661                    .dwattr $C$DW$370, DW_AT_decl_line(0x37)
    5662                    .dwattr $C$DW$370, DW_AT_decl_column(0x0e)
    5663            
    5664            $C$DW$371       .dwtag  DW_TAG_member
    5665                    .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$27)
    5666                    .dwattr $C$DW$371, DW_AT_name("timerPeriod")
    5667                    .dwattr $C$DW$371, DW_AT_TI_symbol_name("timerPeriod")
    5668                    .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5669                    .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5670                    .dwattr $C$DW$371, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5671                    .dwattr $C$DW$371, DW_AT_decl_line(0x39)
    5672                    .dwattr $C$DW$371, DW_AT_decl_column(0x0e)
    5673            
    5674            $C$DW$372       .dwtag  DW_TAG_member
    5675                    .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$27)
    5676                    .dwattr $C$DW$372, DW_AT_name("compareRegister")
    5677                    .dwattr $C$DW$372, DW_AT_TI_symbol_name("compareRegister")
    5678                    .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5679                    .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5680                    .dwattr $C$DW$372, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5681                    .dwattr $C$DW$372, DW_AT_decl_line(0x44)
    5682                    .dwattr $C$DW$372, DW_AT_decl_column(0x0e)
    5683            
    5684            $C$DW$373       .dwtag  DW_TAG_member
    5685                    .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$27)
    5686                    .dwattr $C$DW$373, DW_AT_name("compareOutputMode")
    5687                    .dwattr $C$DW$373, DW_AT_TI_symbol_name("compareOutputMode")
    5688                    .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5689                    .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  114

    5690                    .dwattr $C$DW$373, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5691                    .dwattr $C$DW$373, DW_AT_decl_line(0x4f)
    5692                    .dwattr $C$DW$373, DW_AT_decl_column(0x0e)
    5693            
    5694            $C$DW$374       .dwtag  DW_TAG_member
    5695                    .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$27)
    5696                    .dwattr $C$DW$374, DW_AT_name("dutyCycle")
    5697                    .dwattr $C$DW$374, DW_AT_TI_symbol_name("dutyCycle")
    5698                    .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5699                    .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5700                    .dwattr $C$DW$374, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5701                    .dwattr $C$DW$374, DW_AT_decl_line(0x51)
    5702                    .dwattr $C$DW$374, DW_AT_decl_column(0x0e)
    5703            
    5704                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5705                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    5706                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    5707                    .dwendtag $C$DW$T$40
    5708            
    5709            $C$DW$T$74      .dwtag  DW_TAG_typedef
    5710                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    5711                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    5712                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5713                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5714                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    5715                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    5716            
    5717            
    5718            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5719                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    5720                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    5721            $C$DW$375       .dwtag  DW_TAG_member
    5722                    .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$24)
    5723                    .dwattr $C$DW$375, DW_AT_name("selectClockSource")
    5724                    .dwattr $C$DW$375, DW_AT_TI_symbol_name("selectClockSource")
    5725                    .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5726                    .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5727                    .dwattr $C$DW$375, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5728                    .dwattr $C$DW$375, DW_AT_decl_line(0x1c)
    5729                    .dwattr $C$DW$375, DW_AT_decl_column(0x0d)
    5730            
    5731            $C$DW$376       .dwtag  DW_TAG_member
    5732                    .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$27)
    5733                    .dwattr $C$DW$376, DW_AT_name("clockPrescalar")
    5734                    .dwattr $C$DW$376, DW_AT_TI_symbol_name("clockPrescalar")
    5735                    .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5736                    .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5737                    .dwattr $C$DW$376, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5738                    .dwattr $C$DW$376, DW_AT_decl_line(0x1e)
    5739                    .dwattr $C$DW$376, DW_AT_decl_column(0x0e)
    5740            
    5741            $C$DW$377       .dwtag  DW_TAG_member
    5742                    .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$24)
    5743                    .dwattr $C$DW$377, DW_AT_name("firstModReg")
    5744                    .dwattr $C$DW$377, DW_AT_TI_symbol_name("firstModReg")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  115

    5745                    .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5746                    .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5747                    .dwattr $C$DW$377, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5748                    .dwattr $C$DW$377, DW_AT_decl_line(0x22)
    5749                    .dwattr $C$DW$377, DW_AT_decl_column(0x0d)
    5750            
    5751            $C$DW$378       .dwtag  DW_TAG_member
    5752                    .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$24)
    5753                    .dwattr $C$DW$378, DW_AT_name("secondModReg")
    5754                    .dwattr $C$DW$378, DW_AT_TI_symbol_name("secondModReg")
    5755                    .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5756                    .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5757                    .dwattr $C$DW$378, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5758                    .dwattr $C$DW$378, DW_AT_decl_line(0x26)
    5759                    .dwattr $C$DW$378, DW_AT_decl_column(0x0d)
    5760            
    5761            $C$DW$379       .dwtag  DW_TAG_member
    5762                    .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$24)
    5763                    .dwattr $C$DW$379, DW_AT_name("parity")
    5764                    .dwattr $C$DW$379, DW_AT_TI_symbol_name("parity")
    5765                    .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5766                    .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5767                    .dwattr $C$DW$379, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5768                    .dwattr $C$DW$379, DW_AT_decl_line(0x2c)
    5769                    .dwattr $C$DW$379, DW_AT_decl_column(0x0d)
    5770            
    5771            $C$DW$380       .dwtag  DW_TAG_member
    5772                    .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$24)
    5773                    .dwattr $C$DW$380, DW_AT_name("msborLsbFirst")
    5774                    .dwattr $C$DW$380, DW_AT_TI_symbol_name("msborLsbFirst")
    5775                    .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5776                    .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5777                    .dwattr $C$DW$380, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5778                    .dwattr $C$DW$380, DW_AT_decl_line(0x31)
    5779                    .dwattr $C$DW$380, DW_AT_decl_column(0x0d)
    5780            
    5781            $C$DW$381       .dwtag  DW_TAG_member
    5782                    .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    5783                    .dwattr $C$DW$381, DW_AT_name("numberofStopBits")
    5784                    .dwattr $C$DW$381, DW_AT_TI_symbol_name("numberofStopBits")
    5785                    .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5786                    .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5787                    .dwattr $C$DW$381, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5788                    .dwattr $C$DW$381, DW_AT_decl_line(0x36)
    5789                    .dwattr $C$DW$381, DW_AT_decl_column(0x0d)
    5790            
    5791            $C$DW$382       .dwtag  DW_TAG_member
    5792                    .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$24)
    5793                    .dwattr $C$DW$382, DW_AT_name("uartMode")
    5794                    .dwattr $C$DW$382, DW_AT_TI_symbol_name("uartMode")
    5795                    .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5796                    .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5797                    .dwattr $C$DW$382, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5798                    .dwattr $C$DW$382, DW_AT_decl_line(0x3d)
    5799                    .dwattr $C$DW$382, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  116

    5800            
    5801            $C$DW$383       .dwtag  DW_TAG_member
    5802                    .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
    5803                    .dwattr $C$DW$383, DW_AT_name("overSampling")
    5804                    .dwattr $C$DW$383, DW_AT_TI_symbol_name("overSampling")
    5805                    .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5806                    .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5807                    .dwattr $C$DW$383, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5808                    .dwattr $C$DW$383, DW_AT_decl_line(0x42)
    5809                    .dwattr $C$DW$383, DW_AT_decl_column(0x0d)
    5810            
    5811                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5812                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    5813                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5814                    .dwendtag $C$DW$T$41
    5815            
    5816            $C$DW$T$75      .dwtag  DW_TAG_typedef
    5817                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    5818                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    5819                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5820                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5821                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    5822                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    5823            
    5824            
    5825            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5826                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5827                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    5828            $C$DW$384       .dwtag  DW_TAG_member
    5829                    .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$43)
    5830                    .dwattr $C$DW$384, DW_AT_name("clockSourceFrequency")
    5831                    .dwattr $C$DW$384, DW_AT_TI_symbol_name("clockSourceFrequency")
    5832                    .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5833                    .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5834                    .dwattr $C$DW$384, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5835                    .dwattr $C$DW$384, DW_AT_decl_line(0x31)
    5836                    .dwattr $C$DW$384, DW_AT_decl_column(0x0e)
    5837            
    5838            $C$DW$385       .dwtag  DW_TAG_member
    5839                    .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$43)
    5840                    .dwattr $C$DW$385, DW_AT_name("desiredSpiClock")
    5841                    .dwattr $C$DW$385, DW_AT_TI_symbol_name("desiredSpiClock")
    5842                    .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5843                    .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5844                    .dwattr $C$DW$385, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5845                    .dwattr $C$DW$385, DW_AT_decl_line(0x33)
    5846                    .dwattr $C$DW$385, DW_AT_decl_column(0x0e)
    5847            
    5848                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5849                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    5850                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    5851                    .dwendtag $C$DW$T$44
    5852            
    5853            $C$DW$T$76      .dwtag  DW_TAG_typedef
    5854                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ADC_Calculations.asm                                                 PAGE  117

    5855                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    5856                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5857                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5858                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    5859                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    5860            
    5861            
    5862            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5863                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    5864                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    5865            $C$DW$386       .dwtag  DW_TAG_member
    5866                    .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$24)
    5867                    .dwattr $C$DW$386, DW_AT_name("selectClockSource")
    5868                    .dwattr $C$DW$386, DW_AT_TI_symbol_name("selectClockSource")
    5869                    .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5870                    .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5871                    .dwattr $C$DW$386, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5872                    .dwattr $C$DW$386, DW_AT_decl_line(0x14)
    5873                    .dwattr $C$DW$386, DW_AT_decl_column(0x0d)
    5874            
    5875            $C$DW$387       .dwtag  DW_TAG_member
    5876                    .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$43)
    5877                    .dwattr $C$DW$387, DW_AT_name("clockSourceFrequency")
    5878                    .dwattr $C$DW$387, DW_AT_TI_symbol_name("clockSourceFrequency")
    5879                    .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5880                    .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5881                    .dwattr $C$DW$387, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5882                    .dwattr $C$DW$387, DW_AT_decl_line(0x16)
    5883                    .dwattr $C$DW$387, DW_AT_decl_column(0x0e)
    5884            
    5885            $C$DW$388       .dwtag  DW_TAG_member
    5886                    .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$43)
    5887                    .dwattr $C$DW$388, DW_AT_name("desiredSpiClock")
    5888                    .dwattr $C$DW$388, DW_AT_TI_symbol_name("desiredSpiClock")
    5889                    .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5890                    .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5891                    .dwattr $C$DW$388, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5892                    .dwattr $C$DW$388, DW_AT_decl_line(0x18)
    5893                    .dwattr $C$DW$388, DW_AT_decl_column(0x0e)
    5894            
    5895            $C$DW$389       .dwtag  DW_TAG_member
    5896                    .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$24)
    5897                    .dwattr $C$DW$389, DW_AT_name("msbFirst")
    5898                    .dwattr $C$DW$389, DW_AT_TI_symbol_name("msbFirst")
    5899                    .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5900                    .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5901                    .dwattr $C$DW$389, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5902                    .dwattr $C$DW$389, DW_AT_decl_line(0x1d)
    5903                    .dwattr $C$DW$389, DW_AT_decl_column(0x0d)
    5904            
    5905            $C$DW$390       .dwtag  DW_TAG_member
    5906                    .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$24)
