MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:56 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Air_Compressors.C")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("TB0CCR2")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("TB0CCR2")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$111)

    3299                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3300                    .dwattr $C$DW$172, DW_AT_decl_line(0x76)
    3301                    .dwattr $C$DW$172, DW_AT_decl_column(0x05)
    3302            
    3303            $C$DW$173       .dwtag  DW_TAG_enumerator
    3304                    .dwattr $C$DW$173, DW_AT_name("ack")
    3305                    .dwattr $C$DW$173, DW_AT_const_value(0x07)
    3306                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3307                    .dwattr $C$DW$173, DW_AT_decl_line(0x77)
    3308                    .dwattr $C$DW$173, DW_AT_decl_column(0x05)
    3309            
    3310            $C$DW$174       .dwtag  DW_TAG_enumerator
    3311                    .dwattr $C$DW$174, DW_AT_name("var")
    3312                    .dwattr $C$DW$174, DW_AT_const_value(0x08)
    3313                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3314                    .dwattr $C$DW$174, DW_AT_decl_line(0x78)
    3315                    .dwattr $C$DW$174, DW_AT_decl_column(0x05)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   67

    3316            
    3317            $C$DW$175       .dwtag  DW_TAG_enumerator
    3318                    .dwattr $C$DW$175, DW_AT_name("UGmsg")
    3319                    .dwattr $C$DW$175, DW_AT_const_value(0x09)
    3320                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3321                    .dwattr $C$DW$175, DW_AT_decl_line(0x79)
    3322                    .dwattr $C$DW$175, DW_AT_decl_column(0x05)
    3323            
    3324                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3325                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    3326                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    3327                    .dwendtag $C$DW$T$57
    3328            
    3329            $C$DW$T$58      .dwtag  DW_TAG_typedef
    3330                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    3331                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3332                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3333                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3334                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    3335                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3336            
    3337            
    3338            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3339                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3340            $C$DW$176       .dwtag  DW_TAG_enumerator
    3341                    .dwattr $C$DW$176, DW_AT_name("init")
    3342                    .dwattr $C$DW$176, DW_AT_const_value(0x00)
    3343                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3344                    .dwattr $C$DW$176, DW_AT_decl_line(0x80)
    3345                    .dwattr $C$DW$176, DW_AT_decl_column(0x05)
    3346            
    3347            $C$DW$177       .dwtag  DW_TAG_enumerator
    3348                    .dwattr $C$DW$177, DW_AT_name("running")
    3349                    .dwattr $C$DW$177, DW_AT_const_value(0x01)
    3350                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3351                    .dwattr $C$DW$177, DW_AT_decl_line(0x80)
    3352                    .dwattr $C$DW$177, DW_AT_decl_column(0x0b)
    3353            
    3354            $C$DW$178       .dwtag  DW_TAG_enumerator
    3355                    .dwattr $C$DW$178, DW_AT_name("wait")
    3356                    .dwattr $C$DW$178, DW_AT_const_value(0x02)
    3357                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3358                    .dwattr $C$DW$178, DW_AT_decl_line(0x80)
    3359                    .dwattr $C$DW$178, DW_AT_decl_column(0x14)
    3360            
    3361                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3362                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    3363                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3364                    .dwendtag $C$DW$T$59
    3365            
    3366            $C$DW$T$60      .dwtag  DW_TAG_typedef
    3367                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    3368                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3369                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3370                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   68

    3371                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    3372                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3373            
    3374            
    3375            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3376                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3377            $C$DW$179       .dwtag  DW_TAG_member
    3378                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$14)
    3379                    .dwattr $C$DW$179, DW_AT_name("__max_align1")
    3380                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("__max_align1")
    3381                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3382                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3383                    .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3384                    .dwattr $C$DW$179, DW_AT_decl_line(0x7b)
    3385                    .dwattr $C$DW$179, DW_AT_decl_column(0x0c)
    3386            
    3387            $C$DW$180       .dwtag  DW_TAG_member
    3388                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$18)
    3389                    .dwattr $C$DW$180, DW_AT_name("__max_align2")
    3390                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("__max_align2")
    3391                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3392                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3393                    .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3394                    .dwattr $C$DW$180, DW_AT_decl_line(0x7c)
    3395                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3396            
    3397                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3398                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3399                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3400                    .dwendtag $C$DW$T$22
    3401            
    3402            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3403                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3404                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3405                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3406                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3407                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3408                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3409            
    3410            
    3411            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3412                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3413                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    3414            $C$DW$181       .dwtag  DW_TAG_member
    3415                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$24)
    3416                    .dwattr $C$DW$181, DW_AT_name("memoryBufferControlIndex")
    3417                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3418                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3419                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3420                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3421                    .dwattr $C$DW$181, DW_AT_decl_line(0x27)
    3422                    .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    3423            
    3424            $C$DW$182       .dwtag  DW_TAG_member
    3425                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$24)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   69

    3426                    .dwattr $C$DW$182, DW_AT_name("inputSourceSelect")
    3427                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("inputSourceSelect")
    3428                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3429                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3430                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3431                    .dwattr $C$DW$182, DW_AT_decl_line(0x3b)
    3432                    .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    3433            
    3434            $C$DW$183       .dwtag  DW_TAG_member
    3435                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$24)
    3436                    .dwattr $C$DW$183, DW_AT_name("positiveRefVoltageSourceSelect")
    3437                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3438                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3439                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3440                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3441                    .dwattr $C$DW$183, DW_AT_decl_line(0x42)
    3442                    .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    3443            
    3444            $C$DW$184       .dwtag  DW_TAG_member
    3445                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    3446                    .dwattr $C$DW$184, DW_AT_name("negativeRefVoltageSourceSelect")
    3447                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3448                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3449                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3450                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3451                    .dwattr $C$DW$184, DW_AT_decl_line(0x48)
    3452                    .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    3453            
    3454            $C$DW$185       .dwtag  DW_TAG_member
    3455                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$24)
    3456                    .dwattr $C$DW$185, DW_AT_name("endOfSequence")
    3457                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("endOfSequence")
    3458                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3459                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3460                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3461                    .dwattr $C$DW$185, DW_AT_decl_line(0x51)
    3462                    .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    3463            
    3464                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3465                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3466                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3467                    .dwendtag $C$DW$T$25
    3468            
    3469            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3470                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3471                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3472                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3473                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3474                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3475                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3476            
    3477            
    3478            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3479                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3480                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   70

    3481            $C$DW$186       .dwtag  DW_TAG_member
    3482                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3483                    .dwattr $C$DW$186, DW_AT_name("captureRegister")
    3484                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("captureRegister")
    3485                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3486                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3487                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3488                    .dwattr $C$DW$186, DW_AT_decl_line(0x58)
    3489                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3490            
    3491            $C$DW$187       .dwtag  DW_TAG_member
    3492                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3493                    .dwattr $C$DW$187, DW_AT_name("captureMode")
    3494                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("captureMode")
    3495                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3496                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3497                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3498                    .dwattr $C$DW$187, DW_AT_decl_line(0x5f)
    3499                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3500            
    3501            $C$DW$188       .dwtag  DW_TAG_member
    3502                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3503                    .dwattr $C$DW$188, DW_AT_name("captureInputSelect")
    3504                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("captureInputSelect")
    3505                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3506                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3507                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3508                    .dwattr $C$DW$188, DW_AT_decl_line(0x66)
    3509                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3510            
    3511            $C$DW$189       .dwtag  DW_TAG_member
    3512                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3513                    .dwattr $C$DW$189, DW_AT_name("synchronizeCaptureSource")
    3514                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3515                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3516                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3517                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3518                    .dwattr $C$DW$189, DW_AT_decl_line(0x6b)
    3519                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3520            
    3521            $C$DW$190       .dwtag  DW_TAG_member
    3522                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3523                    .dwattr $C$DW$190, DW_AT_name("captureInterruptEnable")
    3524                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("captureInterruptEnable")
    3525                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3526                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3527                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3528                    .dwattr $C$DW$190, DW_AT_decl_line(0x70)
    3529                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3530            
    3531            $C$DW$191       .dwtag  DW_TAG_member
    3532                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3533                    .dwattr $C$DW$191, DW_AT_name("captureOutputMode")
    3534                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("captureOutputMode")
    3535                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   71

    3536                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3537                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3538                    .dwattr $C$DW$191, DW_AT_decl_line(0x7b)
    3539                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3540            
    3541                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3542                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3543                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3544                    .dwendtag $C$DW$T$28
    3545            
    3546            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3547                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3548                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3549                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3550                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3551                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3552                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3553            
    3554            
    3555            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3556                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3557                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3558            $C$DW$192       .dwtag  DW_TAG_member
    3559                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    3560                    .dwattr $C$DW$192, DW_AT_name("compareRegister")
    3561                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("compareRegister")
    3562                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3563                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3564                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3565                    .dwattr $C$DW$192, DW_AT_decl_line(0x145)
    3566                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    3567            
    3568            $C$DW$193       .dwtag  DW_TAG_member
    3569                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3570                    .dwattr $C$DW$193, DW_AT_name("compareInterruptEnable")
    3571                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("compareInterruptEnable")
    3572                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3573                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3574                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3575                    .dwattr $C$DW$193, DW_AT_decl_line(0x14a)
    3576                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3577            
    3578            $C$DW$194       .dwtag  DW_TAG_member
    3579                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3580                    .dwattr $C$DW$194, DW_AT_name("compareOutputMode")
    3581                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("compareOutputMode")
    3582                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3583                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3584                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3585                    .dwattr $C$DW$194, DW_AT_decl_line(0x155)
    3586                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3587            
    3588            $C$DW$195       .dwtag  DW_TAG_member
    3589                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3590                    .dwattr $C$DW$195, DW_AT_name("compareValue")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   72

    3591                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("compareValue")
    3592                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3593                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3594                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3595                    .dwattr $C$DW$195, DW_AT_decl_line(0x157)
    3596                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3597            
    3598                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3599                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3600                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3601                    .dwendtag $C$DW$T$29
    3602            
    3603            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3604                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3605                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3606                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3607                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3608                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3609                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3610            
    3611            
    3612            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3613                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3614                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3615            $C$DW$196       .dwtag  DW_TAG_member
    3616                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3617                    .dwattr $C$DW$196, DW_AT_name("clockSource")
    3618                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("clockSource")
    3619                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3620                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3621                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3622                    .dwattr $C$DW$196, DW_AT_decl_line(0x20)
    3623                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3624            
    3625            $C$DW$197       .dwtag  DW_TAG_member
    3626                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3627                    .dwattr $C$DW$197, DW_AT_name("clockSourceDivider")
    3628                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("clockSourceDivider")
    3629                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3630                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3631                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3632                    .dwattr $C$DW$197, DW_AT_decl_line(0x37)
    3633                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3634            
    3635            $C$DW$198       .dwtag  DW_TAG_member
    3636                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3637                    .dwattr $C$DW$198, DW_AT_name("timerInterruptEnable_TAIE")
    3638                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3639                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3640                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3641                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3642                    .dwattr $C$DW$198, DW_AT_decl_line(0x3c)
    3643                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3644            
    3645            $C$DW$199       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   73

    3646                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    3647                    .dwattr $C$DW$199, DW_AT_name("timerClear")
    3648                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("timerClear")
    3649                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3650                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3651                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3652                    .dwattr $C$DW$199, DW_AT_decl_line(0x42)
    3653                    .dwattr $C$DW$199, DW_AT_decl_column(0x0e)
    3654            
    3655            $C$DW$200       .dwtag  DW_TAG_member
    3656                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$30)
    3657                    .dwattr $C$DW$200, DW_AT_name("startTimer")
    3658                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("startTimer")
    3659                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3660                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3661                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3662                    .dwattr $C$DW$200, DW_AT_decl_line(0x44)
    3663                    .dwattr $C$DW$200, DW_AT_decl_column(0x0a)
    3664            
    3665                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3666                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3667                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3668                    .dwendtag $C$DW$T$31
    3669            
    3670            $C$DW$T$65      .dwtag  DW_TAG_typedef
    3671                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3672                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    3673                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3674                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3675                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3676                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3677            
    3678            
    3679            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3680                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3681                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3682            $C$DW$201       .dwtag  DW_TAG_member
    3683                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3684                    .dwattr $C$DW$201, DW_AT_name("clockSource")
    3685                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("clockSource")
    3686                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3687                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3688                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3689                    .dwattr $C$DW$201, DW_AT_decl_line(0x8b)
    3690                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3691            
    3692            $C$DW$202       .dwtag  DW_TAG_member
    3693                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3694                    .dwattr $C$DW$202, DW_AT_name("clockSourceDivider")
    3695                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("clockSourceDivider")
    3696                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3697                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3698                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3699                    .dwattr $C$DW$202, DW_AT_decl_line(0xa2)
    3700                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   74

    3701            
    3702            $C$DW$203       .dwtag  DW_TAG_member
    3703                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3704                    .dwattr $C$DW$203, DW_AT_name("timerPeriod")
    3705                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("timerPeriod")
    3706                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3707                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3708                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3709                    .dwattr $C$DW$203, DW_AT_decl_line(0xa4)
    3710                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3711            
    3712            $C$DW$204       .dwtag  DW_TAG_member
    3713                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3714                    .dwattr $C$DW$204, DW_AT_name("timerInterruptEnable_TAIE")
    3715                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3716                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3717                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3718                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3719                    .dwattr $C$DW$204, DW_AT_decl_line(0xa9)
    3720                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3721            
    3722            $C$DW$205       .dwtag  DW_TAG_member
    3723                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3724                    .dwattr $C$DW$205, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3725                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3726                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3727                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3728                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3729                    .dwattr $C$DW$205, DW_AT_decl_line(0xae)
    3730                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3731            
    3732            $C$DW$206       .dwtag  DW_TAG_member
    3733                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3734                    .dwattr $C$DW$206, DW_AT_name("timerClear")
    3735                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("timerClear")
    3736                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3737                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3738                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3739                    .dwattr $C$DW$206, DW_AT_decl_line(0xb4)
    3740                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    3741            
    3742            $C$DW$207       .dwtag  DW_TAG_member
    3743                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$30)
    3744                    .dwattr $C$DW$207, DW_AT_name("startTimer")
    3745                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("startTimer")
    3746                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3747                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3748                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3749                    .dwattr $C$DW$207, DW_AT_decl_line(0xb6)
    3750                    .dwattr $C$DW$207, DW_AT_decl_column(0x0a)
    3751            
    3752                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3753                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3754                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3755                    .dwendtag $C$DW$T$32
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   75

    3756            
    3757            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3758                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3759                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3760                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3761                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3762                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3763                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3764            
    3765            
    3766            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3767                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3768                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3769            $C$DW$208       .dwtag  DW_TAG_member
    3770                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3771                    .dwattr $C$DW$208, DW_AT_name("clockSource")
    3772                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("clockSource")
    3773                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3774                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3775                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3776                    .dwattr $C$DW$208, DW_AT_decl_line(0x105)
    3777                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3778            
    3779            $C$DW$209       .dwtag  DW_TAG_member
    3780                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3781                    .dwattr $C$DW$209, DW_AT_name("clockSourceDivider")
    3782                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("clockSourceDivider")
    3783                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3784                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3785                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3786                    .dwattr $C$DW$209, DW_AT_decl_line(0x11c)
    3787                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3788            
    3789            $C$DW$210       .dwtag  DW_TAG_member
    3790                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3791                    .dwattr $C$DW$210, DW_AT_name("timerPeriod")
    3792                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("timerPeriod")
    3793                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3794                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3795                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3796                    .dwattr $C$DW$210, DW_AT_decl_line(0x11f)
    3797                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3798            
    3799            $C$DW$211       .dwtag  DW_TAG_member
    3800                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3801                    .dwattr $C$DW$211, DW_AT_name("timerInterruptEnable_TAIE")
    3802                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3803                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3804                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3805                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3806                    .dwattr $C$DW$211, DW_AT_decl_line(0x124)
    3807                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    3808            
    3809            $C$DW$212       .dwtag  DW_TAG_member
    3810                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   76

    3811                    .dwattr $C$DW$212, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3812                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3813                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3814                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3815                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3816                    .dwattr $C$DW$212, DW_AT_decl_line(0x129)
    3817                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3818            
    3819            $C$DW$213       .dwtag  DW_TAG_member
    3820                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    3821                    .dwattr $C$DW$213, DW_AT_name("timerClear")
    3822                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("timerClear")
    3823                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3824                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3825                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3826                    .dwattr $C$DW$213, DW_AT_decl_line(0x12f)
    3827                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    3828            
    3829            $C$DW$214       .dwtag  DW_TAG_member
    3830                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$30)
    3831                    .dwattr $C$DW$214, DW_AT_name("startTimer")
    3832                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("startTimer")
    3833                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3834                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3835                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3836                    .dwattr $C$DW$214, DW_AT_decl_line(0x131)
    3837                    .dwattr $C$DW$214, DW_AT_decl_column(0x0a)
    3838            
    3839                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3840                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3841                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3842                    .dwendtag $C$DW$T$33
    3843            
    3844            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3845                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3846                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3847                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3848                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3849                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3850                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3851            
    3852            
    3853            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3854                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3855                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3856            $C$DW$215       .dwtag  DW_TAG_member
    3857                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    3858                    .dwattr $C$DW$215, DW_AT_name("clockSource")
    3859                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("clockSource")
    3860                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3862                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3863                    .dwattr $C$DW$215, DW_AT_decl_line(0xc5)
    3864                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3865            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   77

    3866            $C$DW$216       .dwtag  DW_TAG_member
    3867                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    3868                    .dwattr $C$DW$216, DW_AT_name("clockSourceDivider")
    3869                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("clockSourceDivider")
    3870                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3871                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3872                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3873                    .dwattr $C$DW$216, DW_AT_decl_line(0xdc)
    3874                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    3875            
    3876            $C$DW$217       .dwtag  DW_TAG_member
    3877                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    3878                    .dwattr $C$DW$217, DW_AT_name("timerPeriod")
    3879                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("timerPeriod")
    3880                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3881                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3882                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3883                    .dwattr $C$DW$217, DW_AT_decl_line(0xde)
    3884                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    3885            
    3886            $C$DW$218       .dwtag  DW_TAG_member
    3887                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    3888                    .dwattr $C$DW$218, DW_AT_name("compareRegister")
    3889                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("compareRegister")
    3890                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3891                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3892                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3893                    .dwattr $C$DW$218, DW_AT_decl_line(0xe9)
    3894                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    3895            
    3896            $C$DW$219       .dwtag  DW_TAG_member
    3897                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    3898                    .dwattr $C$DW$219, DW_AT_name("compareOutputMode")
    3899                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("compareOutputMode")
    3900                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3901                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3902                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3903                    .dwattr $C$DW$219, DW_AT_decl_line(0xf4)
    3904                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3905            
    3906            $C$DW$220       .dwtag  DW_TAG_member
    3907                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    3908                    .dwattr $C$DW$220, DW_AT_name("dutyCycle")
    3909                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("dutyCycle")
    3910                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3911                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3912                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3913                    .dwattr $C$DW$220, DW_AT_decl_line(0xf6)
    3914                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    3915            
    3916                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3917                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3918                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3919                    .dwendtag $C$DW$T$34
    3920            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   78

    3921            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3922                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3923                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3924                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3925                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3926                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3927                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3928            
    3929            
    3930            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3931                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3932                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3933            $C$DW$221       .dwtag  DW_TAG_member
    3934                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    3935                    .dwattr $C$DW$221, DW_AT_name("captureRegister")
    3936                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("captureRegister")
    3937                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3938                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3939                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3940                    .dwattr $C$DW$221, DW_AT_decl_line(0xa0)
    3941                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    3942            
    3943            $C$DW$222       .dwtag  DW_TAG_member
    3944                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    3945                    .dwattr $C$DW$222, DW_AT_name("captureMode")
    3946                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("captureMode")
    3947                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3948                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3949                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3950                    .dwattr $C$DW$222, DW_AT_decl_line(0xa7)
    3951                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    3952            
    3953            $C$DW$223       .dwtag  DW_TAG_member
    3954                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    3955                    .dwattr $C$DW$223, DW_AT_name("captureInputSelect")
    3956                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("captureInputSelect")
    3957                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3958                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3959                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3960                    .dwattr $C$DW$223, DW_AT_decl_line(0xae)
    3961                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    3962            
    3963            $C$DW$224       .dwtag  DW_TAG_member
    3964                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    3965                    .dwattr $C$DW$224, DW_AT_name("synchronizeCaptureSource")
    3966                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3967                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3968                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3969                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3970                    .dwattr $C$DW$224, DW_AT_decl_line(0xb3)
    3971                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    3972            
    3973            $C$DW$225       .dwtag  DW_TAG_member
    3974                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    3975                    .dwattr $C$DW$225, DW_AT_name("captureInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   79

    3976                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("captureInterruptEnable")
    3977                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3978                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3979                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3980                    .dwattr $C$DW$225, DW_AT_decl_line(0xb8)
    3981                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    3982            
    3983            $C$DW$226       .dwtag  DW_TAG_member
    3984                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    3985                    .dwattr $C$DW$226, DW_AT_name("captureOutputMode")
    3986                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("captureOutputMode")
    3987                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3988                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3989                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3990                    .dwattr $C$DW$226, DW_AT_decl_line(0xc3)
    3991                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    3992            
    3993                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3994                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3995                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3996                    .dwendtag $C$DW$T$35
    3997            
    3998            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3999                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4000                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4001                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4002                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4003                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4004                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4005            
    4006            
    4007            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4008                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4009                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4010            $C$DW$227       .dwtag  DW_TAG_member
    4011                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4012                    .dwattr $C$DW$227, DW_AT_name("compareRegister")
    4013                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("compareRegister")
    4014                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4015                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4016                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4017                    .dwattr $C$DW$227, DW_AT_decl_line(0x146)
    4018                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4019            
    4020            $C$DW$228       .dwtag  DW_TAG_member
    4021                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4022                    .dwattr $C$DW$228, DW_AT_name("compareInterruptEnable")
    4023                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("compareInterruptEnable")
    4024                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4025                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4026                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4027                    .dwattr $C$DW$228, DW_AT_decl_line(0x14b)
    4028                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4029            
    4030            $C$DW$229       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   80

    4031                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4032                    .dwattr $C$DW$229, DW_AT_name("compareOutputMode")
    4033                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("compareOutputMode")
    4034                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4035                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4036                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4037                    .dwattr $C$DW$229, DW_AT_decl_line(0x156)
    4038                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4039            
    4040            $C$DW$230       .dwtag  DW_TAG_member
    4041                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    4042                    .dwattr $C$DW$230, DW_AT_name("compareValue")
    4043                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("compareValue")
    4044                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4045                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4046                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4047                    .dwattr $C$DW$230, DW_AT_decl_line(0x158)
    4048                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4049            
    4050                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4051                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4052                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4053                    .dwendtag $C$DW$T$36
    4054            
    4055            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4056                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4057                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    4058                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4059                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4060                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4061                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4062            
    4063            
    4064            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4065                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4066                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4067            $C$DW$231       .dwtag  DW_TAG_member
    4068                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    4069                    .dwattr $C$DW$231, DW_AT_name("clockSource")
    4070                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("clockSource")
    4071                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4072                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4073                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4074                    .dwattr $C$DW$231, DW_AT_decl_line(0xd3)
    4075                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4076            
    4077            $C$DW$232       .dwtag  DW_TAG_member
    4078                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    4079                    .dwattr $C$DW$232, DW_AT_name("clockSourceDivider")
    4080                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("clockSourceDivider")
    4081                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4082                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4083                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4084                    .dwattr $C$DW$232, DW_AT_decl_line(0xea)
    4085                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   81

    4086            
    4087            $C$DW$233       .dwtag  DW_TAG_member
    4088                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    4089                    .dwattr $C$DW$233, DW_AT_name("timerInterruptEnable_TBIE")
    4090                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4091                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4092                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4093                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4094                    .dwattr $C$DW$233, DW_AT_decl_line(0xef)
    4095                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4096            
    4097            $C$DW$234       .dwtag  DW_TAG_member
    4098                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4099                    .dwattr $C$DW$234, DW_AT_name("timerClear")
    4100                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("timerClear")
    4101                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4102                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4103                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4104                    .dwattr $C$DW$234, DW_AT_decl_line(0xf5)
    4105                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4106            
    4107            $C$DW$235       .dwtag  DW_TAG_member
    4108                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$30)
    4109                    .dwattr $C$DW$235, DW_AT_name("startTimer")
    4110                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("startTimer")
    4111                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4112                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4113                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4114                    .dwattr $C$DW$235, DW_AT_decl_line(0xf7)
    4115                    .dwattr $C$DW$235, DW_AT_decl_column(0x0a)
    4116            
    4117                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4118                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4119                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4120                    .dwendtag $C$DW$T$37
    4121            
    4122            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4123                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4124                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4125                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4126                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4127                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4128                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4129            
    4130            
    4131            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4132                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4133                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4134            $C$DW$236       .dwtag  DW_TAG_member
    4135                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4136                    .dwattr $C$DW$236, DW_AT_name("clockSource")
    4137                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("clockSource")
    4138                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4139                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4140                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   82

    4141                    .dwattr $C$DW$236, DW_AT_decl_line(0x107)
    4142                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4143            
    4144            $C$DW$237       .dwtag  DW_TAG_member
    4145                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    4146                    .dwattr $C$DW$237, DW_AT_name("clockSourceDivider")
    4147                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("clockSourceDivider")
    4148                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4149                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4150                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4151                    .dwattr $C$DW$237, DW_AT_decl_line(0x11e)
    4152                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    4153            
    4154            $C$DW$238       .dwtag  DW_TAG_member
    4155                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    4156                    .dwattr $C$DW$238, DW_AT_name("timerPeriod")
    4157                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("timerPeriod")
    4158                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4159                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4160                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4161                    .dwattr $C$DW$238, DW_AT_decl_line(0x120)
    4162                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    4163            
    4164            $C$DW$239       .dwtag  DW_TAG_member
    4165                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4166                    .dwattr $C$DW$239, DW_AT_name("timerInterruptEnable_TBIE")
    4167                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4168                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4169                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4170                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4171                    .dwattr $C$DW$239, DW_AT_decl_line(0x125)
    4172                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    4173            
    4174            $C$DW$240       .dwtag  DW_TAG_member
    4175                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    4176                    .dwattr $C$DW$240, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4177                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4178                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4179                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4180                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4181                    .dwattr $C$DW$240, DW_AT_decl_line(0x12a)
    4182                    .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    4183            
    4184            $C$DW$241       .dwtag  DW_TAG_member
    4185                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    4186                    .dwattr $C$DW$241, DW_AT_name("timerClear")
    4187                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("timerClear")
    4188                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4189                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4190                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4191                    .dwattr $C$DW$241, DW_AT_decl_line(0x130)
    4192                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4193            
    4194            $C$DW$242       .dwtag  DW_TAG_member
    4195                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   83

    4196                    .dwattr $C$DW$242, DW_AT_name("startTimer")
    4197                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("startTimer")
    4198                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4199                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4200                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4201                    .dwattr $C$DW$242, DW_AT_decl_line(0x132)
    4202                    .dwattr $C$DW$242, DW_AT_decl_column(0x0a)
    4203            
    4204                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4205                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4206                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4207                    .dwendtag $C$DW$T$38
    4208            
    4209            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4210                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4211                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4212                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4213                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4214                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4215                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4216            
    4217            
    4218            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4219                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4220                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4221            $C$DW$243       .dwtag  DW_TAG_member
    4222                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    4223                    .dwattr $C$DW$243, DW_AT_name("clockSource")
    4224                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("clockSource")
    4225                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4226                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4227                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4228                    .dwattr $C$DW$243, DW_AT_decl_line(0x60)
    4229                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    4230            
    4231            $C$DW$244       .dwtag  DW_TAG_member
    4232                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    4233                    .dwattr $C$DW$244, DW_AT_name("clockSourceDivider")
    4234                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("clockSourceDivider")
    4235                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4236                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4237                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4238                    .dwattr $C$DW$244, DW_AT_decl_line(0x77)
    4239                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    4240            
    4241            $C$DW$245       .dwtag  DW_TAG_member
    4242                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    4243                    .dwattr $C$DW$245, DW_AT_name("timerPeriod")
    4244                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("timerPeriod")
    4245                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4246                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4247                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4248                    .dwattr $C$DW$245, DW_AT_decl_line(0x7a)
    4249                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    4250            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   84

    4251            $C$DW$246       .dwtag  DW_TAG_member
    4252                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    4253                    .dwattr $C$DW$246, DW_AT_name("timerInterruptEnable_TBIE")
    4254                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4255                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4256                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4257                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4258                    .dwattr $C$DW$246, DW_AT_decl_line(0x7f)
    4259                    .dwattr $C$DW$246, DW_AT_decl_column(0x0e)
    4260            
    4261            $C$DW$247       .dwtag  DW_TAG_member
    4262                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    4263                    .dwattr $C$DW$247, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4264                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4265                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4266                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4267                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4268                    .dwattr $C$DW$247, DW_AT_decl_line(0x84)
    4269                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4270            
    4271            $C$DW$248       .dwtag  DW_TAG_member
    4272                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4273                    .dwattr $C$DW$248, DW_AT_name("timerClear")
    4274                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("timerClear")
    4275                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4276                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4277                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4278                    .dwattr $C$DW$248, DW_AT_decl_line(0x8a)
    4279                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4280            
    4281            $C$DW$249       .dwtag  DW_TAG_member
    4282                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$30)
    4283                    .dwattr $C$DW$249, DW_AT_name("startTimer")
    4284                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("startTimer")
    4285                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4286                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4287                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4288                    .dwattr $C$DW$249, DW_AT_decl_line(0x8c)
    4289                    .dwattr $C$DW$249, DW_AT_decl_column(0x0a)
    4290            
    4291                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4292                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4293                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    4294                    .dwendtag $C$DW$T$39
    4295            
    4296            $C$DW$T$73      .dwtag  DW_TAG_typedef
    4297                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    4298                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    4299                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4300                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4301                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    4302                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4303            
    4304            
    4305            $C$DW$T$40      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   85

    4306                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    4307                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4308            $C$DW$250       .dwtag  DW_TAG_member
    4309                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    4310                    .dwattr $C$DW$250, DW_AT_name("clockSource")
    4311                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("clockSource")
    4312                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4313                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4314                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4315                    .dwattr $C$DW$250, DW_AT_decl_line(0x20)
    4316                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4317            
    4318            $C$DW$251       .dwtag  DW_TAG_member
    4319                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4320                    .dwattr $C$DW$251, DW_AT_name("clockSourceDivider")
    4321                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("clockSourceDivider")
    4322                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4323                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4324                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4325                    .dwattr $C$DW$251, DW_AT_decl_line(0x37)
    4326                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4327            
    4328            $C$DW$252       .dwtag  DW_TAG_member
    4329                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    4330                    .dwattr $C$DW$252, DW_AT_name("timerPeriod")
    4331                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("timerPeriod")
    4332                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4333                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4334                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4335                    .dwattr $C$DW$252, DW_AT_decl_line(0x39)
    4336                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    4337            
    4338            $C$DW$253       .dwtag  DW_TAG_member
    4339                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    4340                    .dwattr $C$DW$253, DW_AT_name("compareRegister")
    4341                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("compareRegister")
    4342                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4343                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4344                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4345                    .dwattr $C$DW$253, DW_AT_decl_line(0x44)
    4346                    .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    4347            
    4348            $C$DW$254       .dwtag  DW_TAG_member
    4349                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4350                    .dwattr $C$DW$254, DW_AT_name("compareOutputMode")
    4351                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("compareOutputMode")
    4352                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4353                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4354                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4355                    .dwattr $C$DW$254, DW_AT_decl_line(0x4f)
    4356                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4357            
    4358            $C$DW$255       .dwtag  DW_TAG_member
    4359                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4360                    .dwattr $C$DW$255, DW_AT_name("dutyCycle")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   86

    4361                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("dutyCycle")
    4362                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4363                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4364                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4365                    .dwattr $C$DW$255, DW_AT_decl_line(0x51)
    4366                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4367            
    4368                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4369                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    4370                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4371                    .dwendtag $C$DW$T$40
    4372            
    4373            $C$DW$T$74      .dwtag  DW_TAG_typedef
    4374                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    4375                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    4376                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4377                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4378                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    4379                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4380            
    4381            
    4382            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4383                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4384                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4385            $C$DW$256       .dwtag  DW_TAG_member
    4386                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$24)
    4387                    .dwattr $C$DW$256, DW_AT_name("selectClockSource")
    4388                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("selectClockSource")
    4389                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4390                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4391                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4392                    .dwattr $C$DW$256, DW_AT_decl_line(0x1c)
    4393                    .dwattr $C$DW$256, DW_AT_decl_column(0x0d)
    4394            
    4395            $C$DW$257       .dwtag  DW_TAG_member
    4396                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4397                    .dwattr $C$DW$257, DW_AT_name("clockPrescalar")
    4398                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("clockPrescalar")
    4399                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4400                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4401                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4402                    .dwattr $C$DW$257, DW_AT_decl_line(0x1e)
    4403                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4404            
    4405            $C$DW$258       .dwtag  DW_TAG_member
    4406                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    4407                    .dwattr $C$DW$258, DW_AT_name("firstModReg")
    4408                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("firstModReg")
    4409                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4410                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4411                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4412                    .dwattr $C$DW$258, DW_AT_decl_line(0x22)
    4413                    .dwattr $C$DW$258, DW_AT_decl_column(0x0d)
    4414            
    4415            $C$DW$259       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   87

    4416                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$24)
    4417                    .dwattr $C$DW$259, DW_AT_name("secondModReg")
    4418                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("secondModReg")
    4419                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4420                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4421                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4422                    .dwattr $C$DW$259, DW_AT_decl_line(0x26)
    4423                    .dwattr $C$DW$259, DW_AT_decl_column(0x0d)
    4424            
    4425            $C$DW$260       .dwtag  DW_TAG_member
    4426                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$24)
    4427                    .dwattr $C$DW$260, DW_AT_name("parity")
    4428                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("parity")
    4429                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4430                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4431                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4432                    .dwattr $C$DW$260, DW_AT_decl_line(0x2c)
    4433                    .dwattr $C$DW$260, DW_AT_decl_column(0x0d)
    4434            
    4435            $C$DW$261       .dwtag  DW_TAG_member
    4436                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$24)
    4437                    .dwattr $C$DW$261, DW_AT_name("msborLsbFirst")
    4438                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("msborLsbFirst")
    4439                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4440                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4441                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4442                    .dwattr $C$DW$261, DW_AT_decl_line(0x31)
    4443                    .dwattr $C$DW$261, DW_AT_decl_column(0x0d)
    4444            
    4445            $C$DW$262       .dwtag  DW_TAG_member
    4446                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$24)
    4447                    .dwattr $C$DW$262, DW_AT_name("numberofStopBits")
    4448                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("numberofStopBits")
    4449                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4450                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4451                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4452                    .dwattr $C$DW$262, DW_AT_decl_line(0x36)
    4453                    .dwattr $C$DW$262, DW_AT_decl_column(0x0d)
    4454            
    4455            $C$DW$263       .dwtag  DW_TAG_member
    4456                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$24)
    4457                    .dwattr $C$DW$263, DW_AT_name("uartMode")
    4458                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("uartMode")
    4459                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4460                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4461                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4462                    .dwattr $C$DW$263, DW_AT_decl_line(0x3d)
    4463                    .dwattr $C$DW$263, DW_AT_decl_column(0x0d)
    4464            
    4465            $C$DW$264       .dwtag  DW_TAG_member
    4466                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$24)
    4467                    .dwattr $C$DW$264, DW_AT_name("overSampling")
    4468                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("overSampling")
    4469                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4470                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   88

    4471                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4472                    .dwattr $C$DW$264, DW_AT_decl_line(0x42)
    4473                    .dwattr $C$DW$264, DW_AT_decl_column(0x0d)
    4474            
    4475                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4476                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4477                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4478                    .dwendtag $C$DW$T$41
    4479            
    4480            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4481                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4482                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4483                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4484                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4485                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4486                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4487            
    4488            
    4489            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4490                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4491                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4492            $C$DW$265       .dwtag  DW_TAG_member
    4493                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$43)
    4494                    .dwattr $C$DW$265, DW_AT_name("clockSourceFrequency")
    4495                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("clockSourceFrequency")
    4496                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4497                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4498                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4499                    .dwattr $C$DW$265, DW_AT_decl_line(0x31)
    4500                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    4501            
    4502            $C$DW$266       .dwtag  DW_TAG_member
    4503                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$43)
    4504                    .dwattr $C$DW$266, DW_AT_name("desiredSpiClock")
    4505                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("desiredSpiClock")
    4506                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4507                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4508                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4509                    .dwattr $C$DW$266, DW_AT_decl_line(0x33)
    4510                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    4511            
    4512                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4513                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4514                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4515                    .dwendtag $C$DW$T$44
    4516            
    4517            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4518                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4519                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4520                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4521                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4522                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4523                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4524            
    4525            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Air_Compressors.asm                                                  PAGE   89

    4526            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4527                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4528                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4529            $C$DW$267       .dwtag  DW_TAG_member
    4530                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$24)
    4531                    .dwattr $C$DW$267, DW_AT_name("selectClockSource")
    4532                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("selectClockSource")
    4533                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4534                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4535                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4536                    .dwattr $C$DW$267, DW_AT_decl_line(0x14)
    4537                    .dwattr $C$DW$267, DW_AT_decl_column(0x0d)
    4538            
    4539            $C$DW$268       .dwtag  DW_TAG_member
    4540                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$43)
    4541                    .dwattr $C$DW$268, DW_AT_name("clockSourceFrequency")
    4542                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("clockSourceFrequency")
    4543                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4544                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4545                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4546                    .dwattr $C$DW$268, DW_AT_decl_line(0x16)
    4547                    .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    4548            
    4549            $C$DW$269       .dwtag  DW_TAG_member
    4550                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$43)
    4551                    .dwattr $C$DW$269, DW_AT_name("desiredSpiClock")
    4552                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("desiredSpiClock")
    4553                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4554                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4555                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4556                    .dwattr $C$DW$269, DW_AT_decl_line(0x18)
    4557                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    4558            
    4559            $C$DW$270       .dwtag  DW_TAG_member
    4560                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$24)
    4561                    .dwattr $C$DW$270, DW_AT_name("msbFirst")
    4562                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("msbFirst")
    4563                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4564                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4565                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4566                    .dwattr $C$DW$270, DW_AT_decl_line(0x1d)
    4567                    .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    4568            
    4569            $C$DW$271       .dwtag  DW_TAG_member
    4570                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$24)
