MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:56 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Altitude.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12                    .global mode
      13                    .common mode,2,2
      14            $C$DW$1 .dwtag  DW_TAG_variable
      15                    .dwattr $C$DW$1, DW_AT_name("mode")
      16                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("mode")

    2017                    .dwattr $C$DW$86, DW_AT_const_value(0x06)
    2018                    .dwattr $C$DW$86, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2019                    .dwattr $C$DW$86, DW_AT_decl_line(0x76)
    2020                    .dwattr $C$DW$86, DW_AT_decl_column(0x05)
    2021            
    2022            $C$DW$87        .dwtag  DW_TAG_enumerator
    2023                    .dwattr $C$DW$87, DW_AT_name("ack")
    2024                    .dwattr $C$DW$87, DW_AT_const_value(0x07)
    2025                    .dwattr $C$DW$87, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2026                    .dwattr $C$DW$87, DW_AT_decl_line(0x77)
    2027                    .dwattr $C$DW$87, DW_AT_decl_column(0x05)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   39

    2028            
    2029            $C$DW$88        .dwtag  DW_TAG_enumerator
    2030                    .dwattr $C$DW$88, DW_AT_name("var")
    2031                    .dwattr $C$DW$88, DW_AT_const_value(0x08)
    2032                    .dwattr $C$DW$88, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2033                    .dwattr $C$DW$88, DW_AT_decl_line(0x78)
    2034                    .dwattr $C$DW$88, DW_AT_decl_column(0x05)
    2035            
    2036            $C$DW$89        .dwtag  DW_TAG_enumerator
    2037                    .dwattr $C$DW$89, DW_AT_name("UGmsg")
    2038                    .dwattr $C$DW$89, DW_AT_const_value(0x09)
    2039                    .dwattr $C$DW$89, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2040                    .dwattr $C$DW$89, DW_AT_decl_line(0x79)
    2041                    .dwattr $C$DW$89, DW_AT_decl_column(0x05)
    2042            
    2043                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2044                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2045                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2046                    .dwendtag $C$DW$T$57
    2047            
    2048            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2049                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2050                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2051                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2052                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2053                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    2054                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2055            
    2056            
    2057            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2058                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2059            $C$DW$90        .dwtag  DW_TAG_enumerator
    2060                    .dwattr $C$DW$90, DW_AT_name("init")
    2061                    .dwattr $C$DW$90, DW_AT_const_value(0x00)
    2062                    .dwattr $C$DW$90, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2063                    .dwattr $C$DW$90, DW_AT_decl_line(0x80)
    2064                    .dwattr $C$DW$90, DW_AT_decl_column(0x05)
    2065            
    2066            $C$DW$91        .dwtag  DW_TAG_enumerator
    2067                    .dwattr $C$DW$91, DW_AT_name("running")
    2068                    .dwattr $C$DW$91, DW_AT_const_value(0x01)
    2069                    .dwattr $C$DW$91, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2070                    .dwattr $C$DW$91, DW_AT_decl_line(0x80)
    2071                    .dwattr $C$DW$91, DW_AT_decl_column(0x0b)
    2072            
    2073            $C$DW$92        .dwtag  DW_TAG_enumerator
    2074                    .dwattr $C$DW$92, DW_AT_name("wait")
    2075                    .dwattr $C$DW$92, DW_AT_const_value(0x02)
    2076                    .dwattr $C$DW$92, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Mai
    2077                    .dwattr $C$DW$92, DW_AT_decl_line(0x80)
    2078                    .dwattr $C$DW$92, DW_AT_decl_column(0x14)
    2079            
    2080                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2081                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2082                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   40

    2083                    .dwendtag $C$DW$T$59
    2084            
    2085            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2086                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2087                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2088                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2089                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2090                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2091                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2092            
    2093            
    2094            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2095                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2096            $C$DW$93        .dwtag  DW_TAG_member
    2097                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$14)
    2098                    .dwattr $C$DW$93, DW_AT_name("__max_align1")
    2099                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("__max_align1")
    2100                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2101                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2102                    .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    2103                    .dwattr $C$DW$93, DW_AT_decl_line(0x7b)
    2104                    .dwattr $C$DW$93, DW_AT_decl_column(0x0c)
    2105            
    2106            $C$DW$94        .dwtag  DW_TAG_member
    2107                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$18)
    2108                    .dwattr $C$DW$94, DW_AT_name("__max_align2")
    2109                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("__max_align2")
    2110                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2111                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2112                    .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    2113                    .dwattr $C$DW$94, DW_AT_decl_line(0x7c)
    2114                    .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    2115            
    2116                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2117                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    2118                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2119                    .dwendtag $C$DW$T$22
    2120            
    2121            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2122                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    2123                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    2124                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2125                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2126                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    2127                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2128            
    2129            
    2130            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2131                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    2132                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    2133            $C$DW$95        .dwtag  DW_TAG_member
    2134                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$24)
    2135                    .dwattr $C$DW$95, DW_AT_name("memoryBufferControlIndex")
    2136                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    2137                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   41

    2138                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2139                    .dwattr $C$DW$95, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/adc
    2140                    .dwattr $C$DW$95, DW_AT_decl_line(0x27)
    2141                    .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    2142            
    2143            $C$DW$96        .dwtag  DW_TAG_member
    2144                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$24)
    2145                    .dwattr $C$DW$96, DW_AT_name("inputSourceSelect")
    2146                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("inputSourceSelect")
    2147                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2148                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2149                    .dwattr $C$DW$96, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/adc
    2150                    .dwattr $C$DW$96, DW_AT_decl_line(0x3b)
    2151                    .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    2152            
    2153            $C$DW$97        .dwtag  DW_TAG_member
    2154                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$24)
    2155                    .dwattr $C$DW$97, DW_AT_name("positiveRefVoltageSourceSelect")
    2156                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    2157                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2158                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2159                    .dwattr $C$DW$97, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/adc
    2160                    .dwattr $C$DW$97, DW_AT_decl_line(0x42)
    2161                    .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    2162            
    2163            $C$DW$98        .dwtag  DW_TAG_member
    2164                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$24)
    2165                    .dwattr $C$DW$98, DW_AT_name("negativeRefVoltageSourceSelect")
    2166                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    2167                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2168                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2169                    .dwattr $C$DW$98, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/adc
    2170                    .dwattr $C$DW$98, DW_AT_decl_line(0x48)
    2171                    .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    2172            
    2173            $C$DW$99        .dwtag  DW_TAG_member
    2174                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$24)
    2175                    .dwattr $C$DW$99, DW_AT_name("endOfSequence")
    2176                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("endOfSequence")
    2177                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2178                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2179                    .dwattr $C$DW$99, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/adc
    2180                    .dwattr $C$DW$99, DW_AT_decl_line(0x51)
    2181                    .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    2182            
    2183                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2184                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    2185                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2186                    .dwendtag $C$DW$T$25
    2187            
    2188            $C$DW$T$62      .dwtag  DW_TAG_typedef
    2189                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    2190                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    2191                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2192                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   42

    2193                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    2194                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2195            
    2196            
    2197            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2198                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    2199                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2200            $C$DW$100       .dwtag  DW_TAG_member
    2201                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$27)
    2202                    .dwattr $C$DW$100, DW_AT_name("captureRegister")
    2203                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("captureRegister")
    2204                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2206                    .dwattr $C$DW$100, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2207                    .dwattr $C$DW$100, DW_AT_decl_line(0x58)
    2208                    .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    2209            
    2210            $C$DW$101       .dwtag  DW_TAG_member
    2211                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$27)
    2212                    .dwattr $C$DW$101, DW_AT_name("captureMode")
    2213                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("captureMode")
    2214                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2215                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2216                    .dwattr $C$DW$101, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2217                    .dwattr $C$DW$101, DW_AT_decl_line(0x5f)
    2218                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    2219            
    2220            $C$DW$102       .dwtag  DW_TAG_member
    2221                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$27)
    2222                    .dwattr $C$DW$102, DW_AT_name("captureInputSelect")
    2223                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("captureInputSelect")
    2224                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2225                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2226                    .dwattr $C$DW$102, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2227                    .dwattr $C$DW$102, DW_AT_decl_line(0x66)
    2228                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    2229            
    2230            $C$DW$103       .dwtag  DW_TAG_member
    2231                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$27)
    2232                    .dwattr $C$DW$103, DW_AT_name("synchronizeCaptureSource")
    2233                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2234                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2235                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2236                    .dwattr $C$DW$103, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2237                    .dwattr $C$DW$103, DW_AT_decl_line(0x6b)
    2238                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    2239            
    2240            $C$DW$104       .dwtag  DW_TAG_member
    2241                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
    2242                    .dwattr $C$DW$104, DW_AT_name("captureInterruptEnable")
    2243                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("captureInterruptEnable")
    2244                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2245                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2246                    .dwattr $C$DW$104, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2247                    .dwattr $C$DW$104, DW_AT_decl_line(0x70)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   43

    2248                    .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    2249            
    2250            $C$DW$105       .dwtag  DW_TAG_member
    2251                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$27)
    2252                    .dwattr $C$DW$105, DW_AT_name("captureOutputMode")
    2253                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("captureOutputMode")
    2254                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2255                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2256                    .dwattr $C$DW$105, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2257                    .dwattr $C$DW$105, DW_AT_decl_line(0x7b)
    2258                    .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    2259            
    2260                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2261                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    2262                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2263                    .dwendtag $C$DW$T$28
    2264            
    2265            $C$DW$T$63      .dwtag  DW_TAG_typedef
    2266                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    2267                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    2268                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2269                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2270                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    2271                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2272            
    2273            
    2274            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2275                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    2276                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2277            $C$DW$106       .dwtag  DW_TAG_member
    2278                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$27)
    2279                    .dwattr $C$DW$106, DW_AT_name("compareRegister")
    2280                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("compareRegister")
    2281                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2282                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2283                    .dwattr $C$DW$106, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2284                    .dwattr $C$DW$106, DW_AT_decl_line(0x145)
    2285                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    2286            
    2287            $C$DW$107       .dwtag  DW_TAG_member
    2288                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$27)
    2289                    .dwattr $C$DW$107, DW_AT_name("compareInterruptEnable")
    2290                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("compareInterruptEnable")
    2291                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2292                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2293                    .dwattr $C$DW$107, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2294                    .dwattr $C$DW$107, DW_AT_decl_line(0x14a)
    2295                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    2296            
    2297            $C$DW$108       .dwtag  DW_TAG_member
    2298                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$27)
    2299                    .dwattr $C$DW$108, DW_AT_name("compareOutputMode")
    2300                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("compareOutputMode")
    2301                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2302                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   44

    2303                    .dwattr $C$DW$108, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2304                    .dwattr $C$DW$108, DW_AT_decl_line(0x155)
    2305                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    2306            
    2307            $C$DW$109       .dwtag  DW_TAG_member
    2308                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$27)
    2309                    .dwattr $C$DW$109, DW_AT_name("compareValue")
    2310                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("compareValue")
    2311                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2312                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2313                    .dwattr $C$DW$109, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2314                    .dwattr $C$DW$109, DW_AT_decl_line(0x157)
    2315                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    2316            
    2317                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2318                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    2319                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2320                    .dwendtag $C$DW$T$29
    2321            
    2322            $C$DW$T$64      .dwtag  DW_TAG_typedef
    2323                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    2324                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    2325                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2326                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2327                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    2328                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    2329            
    2330            
    2331            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2332                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    2333                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    2334            $C$DW$110       .dwtag  DW_TAG_member
    2335                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$27)
    2336                    .dwattr $C$DW$110, DW_AT_name("clockSource")
    2337                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("clockSource")
    2338                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2340                    .dwattr $C$DW$110, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2341                    .dwattr $C$DW$110, DW_AT_decl_line(0x20)
    2342                    .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    2343            
    2344            $C$DW$111       .dwtag  DW_TAG_member
    2345                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$27)
    2346                    .dwattr $C$DW$111, DW_AT_name("clockSourceDivider")
    2347                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("clockSourceDivider")
    2348                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2349                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2350                    .dwattr $C$DW$111, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2351                    .dwattr $C$DW$111, DW_AT_decl_line(0x37)
    2352                    .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    2353            
    2354            $C$DW$112       .dwtag  DW_TAG_member
    2355                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$27)
    2356                    .dwattr $C$DW$112, DW_AT_name("timerInterruptEnable_TAIE")
    2357                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   45

    2358                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2359                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2360                    .dwattr $C$DW$112, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2361                    .dwattr $C$DW$112, DW_AT_decl_line(0x3c)
    2362                    .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    2363            
    2364            $C$DW$113       .dwtag  DW_TAG_member
    2365                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    2366                    .dwattr $C$DW$113, DW_AT_name("timerClear")
    2367                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("timerClear")
    2368                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2369                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2370                    .dwattr $C$DW$113, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2371                    .dwattr $C$DW$113, DW_AT_decl_line(0x42)
    2372                    .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    2373            
    2374            $C$DW$114       .dwtag  DW_TAG_member
    2375                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$30)
    2376                    .dwattr $C$DW$114, DW_AT_name("startTimer")
    2377                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("startTimer")
    2378                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2379                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2380                    .dwattr $C$DW$114, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2381                    .dwattr $C$DW$114, DW_AT_decl_line(0x44)
    2382                    .dwattr $C$DW$114, DW_AT_decl_column(0x0a)
    2383            
    2384                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2385                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    2386                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2387                    .dwendtag $C$DW$T$31
    2388            
    2389            $C$DW$T$65      .dwtag  DW_TAG_typedef
    2390                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    2391                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    2392                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2393                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2394                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    2395                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    2396            
    2397            
    2398            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2399                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    2400                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    2401            $C$DW$115       .dwtag  DW_TAG_member
    2402                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$27)
    2403                    .dwattr $C$DW$115, DW_AT_name("clockSource")
    2404                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("clockSource")
    2405                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2407                    .dwattr $C$DW$115, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2408                    .dwattr $C$DW$115, DW_AT_decl_line(0x8b)
    2409                    .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    2410            
    2411            $C$DW$116       .dwtag  DW_TAG_member
    2412                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   46

    2413                    .dwattr $C$DW$116, DW_AT_name("clockSourceDivider")
    2414                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("clockSourceDivider")
    2415                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2416                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2417                    .dwattr $C$DW$116, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2418                    .dwattr $C$DW$116, DW_AT_decl_line(0xa2)
    2419                    .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    2420            
    2421            $C$DW$117       .dwtag  DW_TAG_member
    2422                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$27)
    2423                    .dwattr $C$DW$117, DW_AT_name("timerPeriod")
    2424                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("timerPeriod")
    2425                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2426                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2427                    .dwattr $C$DW$117, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2428                    .dwattr $C$DW$117, DW_AT_decl_line(0xa4)
    2429                    .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    2430            
    2431            $C$DW$118       .dwtag  DW_TAG_member
    2432                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$27)
    2433                    .dwattr $C$DW$118, DW_AT_name("timerInterruptEnable_TAIE")
    2434                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2435                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2436                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2437                    .dwattr $C$DW$118, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2438                    .dwattr $C$DW$118, DW_AT_decl_line(0xa9)
    2439                    .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    2440            
    2441            $C$DW$119       .dwtag  DW_TAG_member
    2442                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$27)
    2443                    .dwattr $C$DW$119, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2444                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2445                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2446                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2447                    .dwattr $C$DW$119, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2448                    .dwattr $C$DW$119, DW_AT_decl_line(0xae)
    2449                    .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    2450            
    2451            $C$DW$120       .dwtag  DW_TAG_member
    2452                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
    2453                    .dwattr $C$DW$120, DW_AT_name("timerClear")
    2454                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("timerClear")
    2455                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2456                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2457                    .dwattr $C$DW$120, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2458                    .dwattr $C$DW$120, DW_AT_decl_line(0xb4)
    2459                    .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    2460            
    2461            $C$DW$121       .dwtag  DW_TAG_member
    2462                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$30)
    2463                    .dwattr $C$DW$121, DW_AT_name("startTimer")
    2464                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("startTimer")
    2465                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2466                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2467                    .dwattr $C$DW$121, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   47

    2468                    .dwattr $C$DW$121, DW_AT_decl_line(0xb6)
    2469                    .dwattr $C$DW$121, DW_AT_decl_column(0x0a)
    2470            
    2471                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2472                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    2473                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2474                    .dwendtag $C$DW$T$32
    2475            
    2476            $C$DW$T$66      .dwtag  DW_TAG_typedef
    2477                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    2478                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    2479                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2480                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2481                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    2482                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    2483            
    2484            
    2485            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2486                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    2487                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    2488            $C$DW$122       .dwtag  DW_TAG_member
    2489                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$27)
    2490                    .dwattr $C$DW$122, DW_AT_name("clockSource")
    2491                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("clockSource")
    2492                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2494                    .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2495                    .dwattr $C$DW$122, DW_AT_decl_line(0x105)
    2496                    .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
    2497            
    2498            $C$DW$123       .dwtag  DW_TAG_member
    2499                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    2500                    .dwattr $C$DW$123, DW_AT_name("clockSourceDivider")
    2501                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("clockSourceDivider")
    2502                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2503                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2504                    .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2505                    .dwattr $C$DW$123, DW_AT_decl_line(0x11c)
    2506                    .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    2507            
    2508            $C$DW$124       .dwtag  DW_TAG_member
    2509                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$27)
    2510                    .dwattr $C$DW$124, DW_AT_name("timerPeriod")
    2511                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("timerPeriod")
    2512                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2513                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2514                    .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2515                    .dwattr $C$DW$124, DW_AT_decl_line(0x11f)
    2516                    .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    2517            
    2518            $C$DW$125       .dwtag  DW_TAG_member
    2519                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    2520                    .dwattr $C$DW$125, DW_AT_name("timerInterruptEnable_TAIE")
    2521                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2522                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   48

    2523                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2524                    .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2525                    .dwattr $C$DW$125, DW_AT_decl_line(0x124)
    2526                    .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    2527            
    2528            $C$DW$126       .dwtag  DW_TAG_member
    2529                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$27)
    2530                    .dwattr $C$DW$126, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2531                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2532                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2533                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2534                    .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2535                    .dwattr $C$DW$126, DW_AT_decl_line(0x129)
    2536                    .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    2537            
    2538            $C$DW$127       .dwtag  DW_TAG_member
    2539                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    2540                    .dwattr $C$DW$127, DW_AT_name("timerClear")
    2541                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("timerClear")
    2542                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2543                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2544                    .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2545                    .dwattr $C$DW$127, DW_AT_decl_line(0x12f)
    2546                    .dwattr $C$DW$127, DW_AT_decl_column(0x0e)
    2547            
    2548            $C$DW$128       .dwtag  DW_TAG_member
    2549                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$30)
    2550                    .dwattr $C$DW$128, DW_AT_name("startTimer")
    2551                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("startTimer")
    2552                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2553                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2554                    .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2555                    .dwattr $C$DW$128, DW_AT_decl_line(0x131)
    2556                    .dwattr $C$DW$128, DW_AT_decl_column(0x0a)
    2557            
    2558                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2559                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    2560                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2561                    .dwendtag $C$DW$T$33
    2562            
    2563            $C$DW$T$67      .dwtag  DW_TAG_typedef
    2564                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    2565                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    2566                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2567                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2568                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    2569                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    2570            
    2571            
    2572            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2573                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    2574                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    2575            $C$DW$129       .dwtag  DW_TAG_member
    2576                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$27)
    2577                    .dwattr $C$DW$129, DW_AT_name("clockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   49

    2578                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("clockSource")
    2579                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2581                    .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2582                    .dwattr $C$DW$129, DW_AT_decl_line(0xc5)
    2583                    .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    2584            
    2585            $C$DW$130       .dwtag  DW_TAG_member
    2586                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$27)
    2587                    .dwattr $C$DW$130, DW_AT_name("clockSourceDivider")
    2588                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("clockSourceDivider")
    2589                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2590                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2591                    .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2592                    .dwattr $C$DW$130, DW_AT_decl_line(0xdc)
    2593                    .dwattr $C$DW$130, DW_AT_decl_column(0x0e)
    2594            
    2595            $C$DW$131       .dwtag  DW_TAG_member
    2596                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    2597                    .dwattr $C$DW$131, DW_AT_name("timerPeriod")
    2598                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("timerPeriod")
    2599                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2600                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2601                    .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2602                    .dwattr $C$DW$131, DW_AT_decl_line(0xde)
    2603                    .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    2604            
    2605            $C$DW$132       .dwtag  DW_TAG_member
    2606                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    2607                    .dwattr $C$DW$132, DW_AT_name("compareRegister")
    2608                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("compareRegister")
    2609                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2610                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2611                    .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2612                    .dwattr $C$DW$132, DW_AT_decl_line(0xe9)
    2613                    .dwattr $C$DW$132, DW_AT_decl_column(0x0e)
    2614            
    2615            $C$DW$133       .dwtag  DW_TAG_member
    2616                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    2617                    .dwattr $C$DW$133, DW_AT_name("compareOutputMode")
    2618                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("compareOutputMode")
    2619                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2620                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2621                    .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2622                    .dwattr $C$DW$133, DW_AT_decl_line(0xf4)
    2623                    .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    2624            
    2625            $C$DW$134       .dwtag  DW_TAG_member
    2626                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
    2627                    .dwattr $C$DW$134, DW_AT_name("dutyCycle")
    2628                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("dutyCycle")
    2629                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2630                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2631                    .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2632                    .dwattr $C$DW$134, DW_AT_decl_line(0xf6)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   50

    2633                    .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    2634            
    2635                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2636                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    2637                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    2638                    .dwendtag $C$DW$T$34
    2639            
    2640            $C$DW$T$68      .dwtag  DW_TAG_typedef
    2641                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    2642                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    2643                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2644                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2645                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    2646                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    2647            
    2648            
    2649            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2650                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    2651                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    2652            $C$DW$135       .dwtag  DW_TAG_member
    2653                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$27)
    2654                    .dwattr $C$DW$135, DW_AT_name("captureRegister")
    2655                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("captureRegister")
    2656                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2657                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2658                    .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2659                    .dwattr $C$DW$135, DW_AT_decl_line(0xa0)
    2660                    .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2661            
    2662            $C$DW$136       .dwtag  DW_TAG_member
    2663                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    2664                    .dwattr $C$DW$136, DW_AT_name("captureMode")
    2665                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("captureMode")
    2666                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2667                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2668                    .dwattr $C$DW$136, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2669                    .dwattr $C$DW$136, DW_AT_decl_line(0xa7)
    2670                    .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2671            
    2672            $C$DW$137       .dwtag  DW_TAG_member
    2673                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    2674                    .dwattr $C$DW$137, DW_AT_name("captureInputSelect")
    2675                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("captureInputSelect")
    2676                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2677                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2678                    .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2679                    .dwattr $C$DW$137, DW_AT_decl_line(0xae)
    2680                    .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2681            
    2682            $C$DW$138       .dwtag  DW_TAG_member
    2683                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2684                    .dwattr $C$DW$138, DW_AT_name("synchronizeCaptureSource")
    2685                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2686                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2687                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   51

    2688                    .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2689                    .dwattr $C$DW$138, DW_AT_decl_line(0xb3)
    2690                    .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2691            
    2692            $C$DW$139       .dwtag  DW_TAG_member
    2693                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2694                    .dwattr $C$DW$139, DW_AT_name("captureInterruptEnable")
    2695                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("captureInterruptEnable")
    2696                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2697                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2698                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2699                    .dwattr $C$DW$139, DW_AT_decl_line(0xb8)
    2700                    .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2701            
    2702            $C$DW$140       .dwtag  DW_TAG_member
    2703                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2704                    .dwattr $C$DW$140, DW_AT_name("captureOutputMode")
    2705                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("captureOutputMode")
    2706                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2707                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2708                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2709                    .dwattr $C$DW$140, DW_AT_decl_line(0xc3)
    2710                    .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2711            
    2712                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2713                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    2714                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2715                    .dwendtag $C$DW$T$35
    2716            
    2717            $C$DW$T$69      .dwtag  DW_TAG_typedef
    2718                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    2719                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    2720                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2721                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2722                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    2723                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    2724            
    2725            
    2726            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2727                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    2728                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    2729            $C$DW$141       .dwtag  DW_TAG_member
    2730                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2731                    .dwattr $C$DW$141, DW_AT_name("compareRegister")
    2732                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("compareRegister")
    2733                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2734                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2735                    .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2736                    .dwattr $C$DW$141, DW_AT_decl_line(0x146)
    2737                    .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2738            
    2739            $C$DW$142       .dwtag  DW_TAG_member
    2740                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    2741                    .dwattr $C$DW$142, DW_AT_name("compareInterruptEnable")
    2742                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("compareInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   52

    2743                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2744                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2745                    .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2746                    .dwattr $C$DW$142, DW_AT_decl_line(0x14b)
    2747                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2748            
    2749            $C$DW$143       .dwtag  DW_TAG_member
    2750                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    2751                    .dwattr $C$DW$143, DW_AT_name("compareOutputMode")
    2752                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("compareOutputMode")
    2753                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2754                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2755                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2756                    .dwattr $C$DW$143, DW_AT_decl_line(0x156)
    2757                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2758            
    2759            $C$DW$144       .dwtag  DW_TAG_member
    2760                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2761                    .dwattr $C$DW$144, DW_AT_name("compareValue")
    2762                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("compareValue")
    2763                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2764                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2765                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2766                    .dwattr $C$DW$144, DW_AT_decl_line(0x158)
    2767                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2768            
    2769                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2770                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    2771                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2772                    .dwendtag $C$DW$T$36
    2773            
    2774            $C$DW$T$70      .dwtag  DW_TAG_typedef
    2775                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    2776                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    2777                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2778                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2779                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    2780                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    2781            
    2782            
    2783            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2784                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    2785                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    2786            $C$DW$145       .dwtag  DW_TAG_member
    2787                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2788                    .dwattr $C$DW$145, DW_AT_name("clockSource")
    2789                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("clockSource")
    2790                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2791                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2792                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2793                    .dwattr $C$DW$145, DW_AT_decl_line(0xd3)
    2794                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2795            
    2796            $C$DW$146       .dwtag  DW_TAG_member
    2797                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   53

    2798                    .dwattr $C$DW$146, DW_AT_name("clockSourceDivider")
    2799                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("clockSourceDivider")
    2800                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2801                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2802                    .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2803                    .dwattr $C$DW$146, DW_AT_decl_line(0xea)
    2804                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2805            
    2806            $C$DW$147       .dwtag  DW_TAG_member
    2807                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2808                    .dwattr $C$DW$147, DW_AT_name("timerInterruptEnable_TBIE")
    2809                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2810                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2811                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2812                    .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2813                    .dwattr $C$DW$147, DW_AT_decl_line(0xef)
    2814                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2815            
    2816            $C$DW$148       .dwtag  DW_TAG_member
    2817                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2818                    .dwattr $C$DW$148, DW_AT_name("timerClear")
    2819                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("timerClear")
    2820                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2821                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2822                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2823                    .dwattr $C$DW$148, DW_AT_decl_line(0xf5)
    2824                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2825            
    2826            $C$DW$149       .dwtag  DW_TAG_member
    2827                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$30)
    2828                    .dwattr $C$DW$149, DW_AT_name("startTimer")
    2829                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("startTimer")
    2830                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2831                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2832                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2833                    .dwattr $C$DW$149, DW_AT_decl_line(0xf7)
    2834                    .dwattr $C$DW$149, DW_AT_decl_column(0x0a)
    2835            
    2836                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2837                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    2838                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    2839                    .dwendtag $C$DW$T$37
    2840            
    2841            $C$DW$T$71      .dwtag  DW_TAG_typedef
    2842                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    2843                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    2844                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2845                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2846                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    2847                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    2848            
    2849            
    2850            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2851                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    2852                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   54

    2853            $C$DW$150       .dwtag  DW_TAG_member
    2854                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    2855                    .dwattr $C$DW$150, DW_AT_name("clockSource")
    2856                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("clockSource")
    2857                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2858                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2859                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2860                    .dwattr $C$DW$150, DW_AT_decl_line(0x107)
    2861                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2862            
    2863            $C$DW$151       .dwtag  DW_TAG_member
    2864                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2865                    .dwattr $C$DW$151, DW_AT_name("clockSourceDivider")
    2866                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("clockSourceDivider")
    2867                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2868                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2869                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2870                    .dwattr $C$DW$151, DW_AT_decl_line(0x11e)
    2871                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2872            
    2873            $C$DW$152       .dwtag  DW_TAG_member
    2874                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2875                    .dwattr $C$DW$152, DW_AT_name("timerPeriod")
    2876                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("timerPeriod")
    2877                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2878                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2879                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2880                    .dwattr $C$DW$152, DW_AT_decl_line(0x120)
    2881                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    2882            
    2883            $C$DW$153       .dwtag  DW_TAG_member
    2884                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    2885                    .dwattr $C$DW$153, DW_AT_name("timerInterruptEnable_TBIE")
    2886                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2887                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2888                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2889                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2890                    .dwattr $C$DW$153, DW_AT_decl_line(0x125)
    2891                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2892            
    2893            $C$DW$154       .dwtag  DW_TAG_member
    2894                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    2895                    .dwattr $C$DW$154, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2896                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2897                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2898                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2899                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2900                    .dwattr $C$DW$154, DW_AT_decl_line(0x12a)
    2901                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2902            
    2903            $C$DW$155       .dwtag  DW_TAG_member
    2904                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    2905                    .dwattr $C$DW$155, DW_AT_name("timerClear")
    2906                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("timerClear")
    2907                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   55

    2908                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2909                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2910                    .dwattr $C$DW$155, DW_AT_decl_line(0x130)
    2911                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2912            
    2913            $C$DW$156       .dwtag  DW_TAG_member
    2914                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$30)
    2915                    .dwattr $C$DW$156, DW_AT_name("startTimer")
    2916                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("startTimer")
    2917                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2918                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2919                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2920                    .dwattr $C$DW$156, DW_AT_decl_line(0x132)
    2921                    .dwattr $C$DW$156, DW_AT_decl_column(0x0a)
    2922            
    2923                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2924                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    2925                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    2926                    .dwendtag $C$DW$T$38
    2927            
    2928            $C$DW$T$72      .dwtag  DW_TAG_typedef
    2929                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    2930                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    2931                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2932                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2933                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    2934                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    2935            
    2936            
    2937            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2938                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    2939                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    2940            $C$DW$157       .dwtag  DW_TAG_member
    2941                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    2942                    .dwattr $C$DW$157, DW_AT_name("clockSource")
    2943                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("clockSource")
    2944                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2945                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2946                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2947                    .dwattr $C$DW$157, DW_AT_decl_line(0x60)
    2948                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2949            
    2950            $C$DW$158       .dwtag  DW_TAG_member
    2951                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    2952                    .dwattr $C$DW$158, DW_AT_name("clockSourceDivider")
    2953                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSourceDivider")
    2954                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2955                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2956                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2957                    .dwattr $C$DW$158, DW_AT_decl_line(0x77)
    2958                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2959            
    2960            $C$DW$159       .dwtag  DW_TAG_member
    2961                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    2962                    .dwattr $C$DW$159, DW_AT_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   56

    2963                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("timerPeriod")
    2964                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2965                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2966                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2967                    .dwattr $C$DW$159, DW_AT_decl_line(0x7a)
    2968                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2969            
    2970            $C$DW$160       .dwtag  DW_TAG_member
    2971                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    2972                    .dwattr $C$DW$160, DW_AT_name("timerInterruptEnable_TBIE")
    2973                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2974                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2975                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2976                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2977                    .dwattr $C$DW$160, DW_AT_decl_line(0x7f)
    2978                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2979            
    2980            $C$DW$161       .dwtag  DW_TAG_member
    2981                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    2982                    .dwattr $C$DW$161, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2983                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2984                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2985                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2986                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2987                    .dwattr $C$DW$161, DW_AT_decl_line(0x84)
    2988                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    2989            
    2990            $C$DW$162       .dwtag  DW_TAG_member
    2991                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    2992                    .dwattr $C$DW$162, DW_AT_name("timerClear")
    2993                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("timerClear")
    2994                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2995                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2996                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2997                    .dwattr $C$DW$162, DW_AT_decl_line(0x8a)
    2998                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    2999            
    3000            $C$DW$163       .dwtag  DW_TAG_member
    3001                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$30)
    3002                    .dwattr $C$DW$163, DW_AT_name("startTimer")
    3003                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("startTimer")
    3004                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3005                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3006                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3007                    .dwattr $C$DW$163, DW_AT_decl_line(0x8c)
    3008                    .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    3009            
    3010                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3011                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    3012                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    3013                    .dwendtag $C$DW$T$39
    3014            
    3015            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3016                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3017                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   57

    3018                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3019                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3020                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3021                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3022            
    3023            
    3024            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3025                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3026                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3027            $C$DW$164       .dwtag  DW_TAG_member
    3028                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    3029                    .dwattr $C$DW$164, DW_AT_name("clockSource")
    3030                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("clockSource")
    3031                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3033                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3034                    .dwattr $C$DW$164, DW_AT_decl_line(0x20)
    3035                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    3036            
    3037            $C$DW$165       .dwtag  DW_TAG_member
    3038                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3039                    .dwattr $C$DW$165, DW_AT_name("clockSourceDivider")
    3040                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("clockSourceDivider")
    3041                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3042                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3043                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3044                    .dwattr $C$DW$165, DW_AT_decl_line(0x37)
    3045                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3046            
    3047            $C$DW$166       .dwtag  DW_TAG_member
    3048                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3049                    .dwattr $C$DW$166, DW_AT_name("timerPeriod")
    3050                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("timerPeriod")
    3051                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3052                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3053                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3054                    .dwattr $C$DW$166, DW_AT_decl_line(0x39)
    3055                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3056            
    3057            $C$DW$167       .dwtag  DW_TAG_member
    3058                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3059                    .dwattr $C$DW$167, DW_AT_name("compareRegister")
    3060                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("compareRegister")
    3061                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3062                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3063                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3064                    .dwattr $C$DW$167, DW_AT_decl_line(0x44)
    3065                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3066            
    3067            $C$DW$168       .dwtag  DW_TAG_member
    3068                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3069                    .dwattr $C$DW$168, DW_AT_name("compareOutputMode")
    3070                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("compareOutputMode")
    3071                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3072                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   58

    3073                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3074                    .dwattr $C$DW$168, DW_AT_decl_line(0x4f)
    3075                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3076            
    3077            $C$DW$169       .dwtag  DW_TAG_member
    3078                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3079                    .dwattr $C$DW$169, DW_AT_name("dutyCycle")
    3080                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("dutyCycle")
    3081                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3082                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3083                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3084                    .dwattr $C$DW$169, DW_AT_decl_line(0x51)
    3085                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3086            
    3087                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3088                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3089                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3090                    .dwendtag $C$DW$T$40
    3091            
    3092            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3093                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3094                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3095                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3096                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3097                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3098                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3099            
    3100            
    3101            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3102                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    3103                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3104            $C$DW$170       .dwtag  DW_TAG_member
    3105                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$24)
    3106                    .dwattr $C$DW$170, DW_AT_name("selectClockSource")
    3107                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("selectClockSource")
    3108                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3109                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3110                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3111                    .dwattr $C$DW$170, DW_AT_decl_line(0x1c)
    3112                    .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    3113            
    3114            $C$DW$171       .dwtag  DW_TAG_member
    3115                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3116                    .dwattr $C$DW$171, DW_AT_name("clockPrescalar")
    3117                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("clockPrescalar")
    3118                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3119                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3120                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3121                    .dwattr $C$DW$171, DW_AT_decl_line(0x1e)
    3122                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3123            
    3124            $C$DW$172       .dwtag  DW_TAG_member
    3125                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$24)
    3126                    .dwattr $C$DW$172, DW_AT_name("firstModReg")
    3127                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("firstModReg")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   59

    3128                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3129                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3130                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3131                    .dwattr $C$DW$172, DW_AT_decl_line(0x22)
    3132                    .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    3133            
    3134            $C$DW$173       .dwtag  DW_TAG_member
    3135                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$24)
    3136                    .dwattr $C$DW$173, DW_AT_name("secondModReg")
    3137                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("secondModReg")
    3138                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3139                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3140                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3141                    .dwattr $C$DW$173, DW_AT_decl_line(0x26)
    3142                    .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    3143            
    3144            $C$DW$174       .dwtag  DW_TAG_member
    3145                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$24)
    3146                    .dwattr $C$DW$174, DW_AT_name("parity")
    3147                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("parity")
    3148                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3149                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3150                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3151                    .dwattr $C$DW$174, DW_AT_decl_line(0x2c)
    3152                    .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    3153            
    3154            $C$DW$175       .dwtag  DW_TAG_member
    3155                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$24)
    3156                    .dwattr $C$DW$175, DW_AT_name("msborLsbFirst")
    3157                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("msborLsbFirst")
    3158                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3159                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3160                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3161                    .dwattr $C$DW$175, DW_AT_decl_line(0x31)
    3162                    .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    3163            
    3164            $C$DW$176       .dwtag  DW_TAG_member
    3165                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$24)
    3166                    .dwattr $C$DW$176, DW_AT_name("numberofStopBits")
    3167                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("numberofStopBits")
    3168                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3169                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3170                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3171                    .dwattr $C$DW$176, DW_AT_decl_line(0x36)
    3172                    .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    3173            
    3174            $C$DW$177       .dwtag  DW_TAG_member
    3175                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$24)
    3176                    .dwattr $C$DW$177, DW_AT_name("uartMode")
    3177                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("uartMode")
    3178                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3179                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3180                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3181                    .dwattr $C$DW$177, DW_AT_decl_line(0x3d)
    3182                    .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   60

    3183            
    3184            $C$DW$178       .dwtag  DW_TAG_member
    3185                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$24)
    3186                    .dwattr $C$DW$178, DW_AT_name("overSampling")
    3187                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("overSampling")
    3188                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3189                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3190                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3191                    .dwattr $C$DW$178, DW_AT_decl_line(0x42)
    3192                    .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    3193            
    3194                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3195                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    3196                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3197                    .dwendtag $C$DW$T$41
    3198            
    3199            $C$DW$T$75      .dwtag  DW_TAG_typedef
    3200                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    3201                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    3202                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3203                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3204                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    3205                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3206            
    3207            
    3208            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3209                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3210                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    3211            $C$DW$179       .dwtag  DW_TAG_member
    3212                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$43)
    3213                    .dwattr $C$DW$179, DW_AT_name("clockSourceFrequency")
    3214                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("clockSourceFrequency")
    3215                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3216                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3217                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3218                    .dwattr $C$DW$179, DW_AT_decl_line(0x31)
    3219                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3220            
    3221            $C$DW$180       .dwtag  DW_TAG_member
    3222                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$43)
    3223                    .dwattr $C$DW$180, DW_AT_name("desiredSpiClock")
    3224                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("desiredSpiClock")
    3225                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3226                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3227                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3228                    .dwattr $C$DW$180, DW_AT_decl_line(0x33)
    3229                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3230            
    3231                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3232                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    3233                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3234                    .dwendtag $C$DW$T$44
    3235            
    3236            $C$DW$T$76      .dwtag  DW_TAG_typedef
    3237                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:56 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Altitude.asm                                                         PAGE   61

    3238                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    3239                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3240                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3241                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    3242                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3243            
    3244            
    3245            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3246                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    3247                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    3248            $C$DW$181       .dwtag  DW_TAG_member
    3249                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$24)
    3250                    .dwattr $C$DW$181, DW_AT_name("selectClockSource")
    3251                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("selectClockSource")
    3252                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3253                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3254                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3255                    .dwattr $C$DW$181, DW_AT_decl_line(0x14)
    3256                    .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    3257            
    3258            $C$DW$182       .dwtag  DW_TAG_member
    3259                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$43)
    3260                    .dwattr $C$DW$182, DW_AT_name("clockSourceFrequency")
    3261                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("clockSourceFrequency")
    3262                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3263                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3264                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3265                    .dwattr $C$DW$182, DW_AT_decl_line(0x16)
    3266                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3267            
    3268            $C$DW$183       .dwtag  DW_TAG_member
    3269                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$43)
    3270                    .dwattr $C$DW$183, DW_AT_name("desiredSpiClock")
    3271                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("desiredSpiClock")
    3272                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3273                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3274                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3275                    .dwattr $C$DW$183, DW_AT_decl_line(0x18)
    3276                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3277            
    3278            $C$DW$184       .dwtag  DW_TAG_member
    3279                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    3280                    .dwattr $C$DW$184, DW_AT_name("msbFirst")
    3281                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("msbFirst")
    3282                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3283                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3284                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3285                    .dwattr $C$DW$184, DW_AT_decl_line(0x1d)
    3286                    .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    3287            
    3288            $C$DW$185       .dwtag  DW_TAG_member
    3289                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$24)
