MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:02 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/calcs.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12                    .global mode
      13                    .common mode,2,2
      14            $C$DW$1 .dwtag  DW_TAG_variable
      15                    .dwattr $C$DW$1, DW_AT_name("mode")
      16                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("mode")

    4000            $C$DW$233       .dwtag  DW_TAG_enumerator
    4001                    .dwattr $C$DW$233, DW_AT_name("crc2")
    4002                    .dwattr $C$DW$233, DW_AT_const_value(0x06)
    4003                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4004                    .dwattr $C$DW$233, DW_AT_decl_line(0x76)
    4005                    .dwattr $C$DW$233, DW_AT_decl_column(0x05)
    4006            
    4007            $C$DW$234       .dwtag  DW_TAG_enumerator
    4008                    .dwattr $C$DW$234, DW_AT_name("ack")
    4009                    .dwattr $C$DW$234, DW_AT_const_value(0x07)
    4010                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4011                    .dwattr $C$DW$234, DW_AT_decl_line(0x77)
    4012                    .dwattr $C$DW$234, DW_AT_decl_column(0x05)
    4013            
    4014            $C$DW$235       .dwtag  DW_TAG_enumerator
    4015                    .dwattr $C$DW$235, DW_AT_name("var")
    4016                    .dwattr $C$DW$235, DW_AT_const_value(0x08)
    4017                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4018                    .dwattr $C$DW$235, DW_AT_decl_line(0x78)
    4019                    .dwattr $C$DW$235, DW_AT_decl_column(0x05)
    4020            
    4021            $C$DW$236       .dwtag  DW_TAG_enumerator
    4022                    .dwattr $C$DW$236, DW_AT_name("UGmsg")
    4023                    .dwattr $C$DW$236, DW_AT_const_value(0x09)
    4024                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4025                    .dwattr $C$DW$236, DW_AT_decl_line(0x79)
    4026                    .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    4027            
    4028                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4029                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    4030                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    4031                    .dwendtag $C$DW$T$57
    4032            
    4033            $C$DW$T$58      .dwtag  DW_TAG_typedef
    4034                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    4035                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4036                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4037                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4038                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    4039                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4040            
    4041            
    4042            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    4043                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    4044            $C$DW$237       .dwtag  DW_TAG_enumerator
    4045                    .dwattr $C$DW$237, DW_AT_name("init")
    4046                    .dwattr $C$DW$237, DW_AT_const_value(0x00)
    4047                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4048                    .dwattr $C$DW$237, DW_AT_decl_line(0x80)
    4049                    .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    4050            
    4051            $C$DW$238       .dwtag  DW_TAG_enumerator
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   83

    4052                    .dwattr $C$DW$238, DW_AT_name("running")
    4053                    .dwattr $C$DW$238, DW_AT_const_value(0x01)
    4054                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4055                    .dwattr $C$DW$238, DW_AT_decl_line(0x80)
    4056                    .dwattr $C$DW$238, DW_AT_decl_column(0x0b)
    4057            
    4058            $C$DW$239       .dwtag  DW_TAG_enumerator
    4059                    .dwattr $C$DW$239, DW_AT_name("wait")
    4060                    .dwattr $C$DW$239, DW_AT_const_value(0x02)
    4061                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4062                    .dwattr $C$DW$239, DW_AT_decl_line(0x80)
    4063                    .dwattr $C$DW$239, DW_AT_decl_column(0x14)
    4064            
    4065                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4066                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    4067                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4068                    .dwendtag $C$DW$T$59
    4069            
    4070            $C$DW$T$60      .dwtag  DW_TAG_typedef
    4071                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    4072                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4073                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4074                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4075                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    4076                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    4077            
    4078            
    4079            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4080                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4081            $C$DW$240       .dwtag  DW_TAG_member
    4082                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$14)
    4083                    .dwattr $C$DW$240, DW_AT_name("__max_align1")
    4084                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("__max_align1")
    4085                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4086                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4087                    .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4088                    .dwattr $C$DW$240, DW_AT_decl_line(0x7b)
    4089                    .dwattr $C$DW$240, DW_AT_decl_column(0x0c)
    4090            
    4091            $C$DW$241       .dwtag  DW_TAG_member
    4092                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$18)
    4093                    .dwattr $C$DW$241, DW_AT_name("__max_align2")
    4094                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("__max_align2")
    4095                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4096                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4097                    .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4098                    .dwattr $C$DW$241, DW_AT_decl_line(0x7c)
    4099                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4100            
    4101                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4102                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    4103                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4104                    .dwendtag $C$DW$T$22
    4105            
    4106            $C$DW$T$61      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   84

    4107                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    4108                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    4109                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4110                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4111                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    4112                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    4113            
    4114            
    4115            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4116                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    4117                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    4118            $C$DW$242       .dwtag  DW_TAG_member
    4119                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$24)
    4120                    .dwattr $C$DW$242, DW_AT_name("memoryBufferControlIndex")
    4121                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    4122                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4123                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4124                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4125                    .dwattr $C$DW$242, DW_AT_decl_line(0x27)
    4126                    .dwattr $C$DW$242, DW_AT_decl_column(0x0d)
    4127            
    4128            $C$DW$243       .dwtag  DW_TAG_member
    4129                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$24)
    4130                    .dwattr $C$DW$243, DW_AT_name("inputSourceSelect")
    4131                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("inputSourceSelect")
    4132                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4133                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4134                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4135                    .dwattr $C$DW$243, DW_AT_decl_line(0x3b)
    4136                    .dwattr $C$DW$243, DW_AT_decl_column(0x0d)
    4137            
    4138            $C$DW$244       .dwtag  DW_TAG_member
    4139                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$24)
    4140                    .dwattr $C$DW$244, DW_AT_name("positiveRefVoltageSourceSelect")
    4141                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    4142                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4143                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4144                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4145                    .dwattr $C$DW$244, DW_AT_decl_line(0x42)
    4146                    .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    4147            
    4148            $C$DW$245       .dwtag  DW_TAG_member
    4149                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$24)
    4150                    .dwattr $C$DW$245, DW_AT_name("negativeRefVoltageSourceSelect")
    4151                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    4152                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4153                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4154                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4155                    .dwattr $C$DW$245, DW_AT_decl_line(0x48)
    4156                    .dwattr $C$DW$245, DW_AT_decl_column(0x0d)
    4157            
    4158            $C$DW$246       .dwtag  DW_TAG_member
    4159                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$24)
    4160                    .dwattr $C$DW$246, DW_AT_name("endOfSequence")
    4161                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("endOfSequence")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   85

    4162                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4163                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4164                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4165                    .dwattr $C$DW$246, DW_AT_decl_line(0x51)
    4166                    .dwattr $C$DW$246, DW_AT_decl_column(0x0d)
    4167            
    4168                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4169                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    4170                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4171                    .dwendtag $C$DW$T$25
    4172            
    4173            $C$DW$T$62      .dwtag  DW_TAG_typedef
    4174                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    4175                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    4176                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4177                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4178                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    4179                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    4180            
    4181            
    4182            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4183                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    4184                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    4185            $C$DW$247       .dwtag  DW_TAG_member
    4186                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    4187                    .dwattr $C$DW$247, DW_AT_name("captureRegister")
    4188                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("captureRegister")
    4189                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4190                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4191                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4192                    .dwattr $C$DW$247, DW_AT_decl_line(0x58)
    4193                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4194            
    4195            $C$DW$248       .dwtag  DW_TAG_member
    4196                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4197                    .dwattr $C$DW$248, DW_AT_name("captureMode")
    4198                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("captureMode")
    4199                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4200                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4201                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4202                    .dwattr $C$DW$248, DW_AT_decl_line(0x5f)
    4203                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4204            
    4205            $C$DW$249       .dwtag  DW_TAG_member
    4206                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    4207                    .dwattr $C$DW$249, DW_AT_name("captureInputSelect")
    4208                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("captureInputSelect")
    4209                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4210                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4211                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4212                    .dwattr $C$DW$249, DW_AT_decl_line(0x66)
    4213                    .dwattr $C$DW$249, DW_AT_decl_column(0x0e)
    4214            
    4215            $C$DW$250       .dwtag  DW_TAG_member
    4216                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   86

    4217                    .dwattr $C$DW$250, DW_AT_name("synchronizeCaptureSource")
    4218                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4219                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4220                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4221                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4222                    .dwattr $C$DW$250, DW_AT_decl_line(0x6b)
    4223                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4224            
    4225            $C$DW$251       .dwtag  DW_TAG_member
    4226                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4227                    .dwattr $C$DW$251, DW_AT_name("captureInterruptEnable")
    4228                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("captureInterruptEnable")
    4229                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4230                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4231                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4232                    .dwattr $C$DW$251, DW_AT_decl_line(0x70)
    4233                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4234            
    4235            $C$DW$252       .dwtag  DW_TAG_member
    4236                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    4237                    .dwattr $C$DW$252, DW_AT_name("captureOutputMode")
    4238                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("captureOutputMode")
    4239                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4240                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4241                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4242                    .dwattr $C$DW$252, DW_AT_decl_line(0x7b)
    4243                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    4244            
    4245                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4246                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    4247                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4248                    .dwendtag $C$DW$T$28
    4249            
    4250            $C$DW$T$63      .dwtag  DW_TAG_typedef
    4251                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    4252                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    4253                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4254                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4255                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    4256                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    4257            
    4258            
    4259            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4260                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    4261                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4262            $C$DW$253       .dwtag  DW_TAG_member
    4263                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    4264                    .dwattr $C$DW$253, DW_AT_name("compareRegister")
    4265                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("compareRegister")
    4266                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4267                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4268                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4269                    .dwattr $C$DW$253, DW_AT_decl_line(0x145)
    4270                    .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    4271            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   87

    4272            $C$DW$254       .dwtag  DW_TAG_member
    4273                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4274                    .dwattr $C$DW$254, DW_AT_name("compareInterruptEnable")
    4275                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("compareInterruptEnable")
    4276                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4277                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4278                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4279                    .dwattr $C$DW$254, DW_AT_decl_line(0x14a)
    4280                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4281            
    4282            $C$DW$255       .dwtag  DW_TAG_member
    4283                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4284                    .dwattr $C$DW$255, DW_AT_name("compareOutputMode")
    4285                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("compareOutputMode")
    4286                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4287                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4288                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4289                    .dwattr $C$DW$255, DW_AT_decl_line(0x155)
    4290                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4291            
    4292            $C$DW$256       .dwtag  DW_TAG_member
    4293                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4294                    .dwattr $C$DW$256, DW_AT_name("compareValue")
    4295                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("compareValue")
    4296                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4297                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4298                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4299                    .dwattr $C$DW$256, DW_AT_decl_line(0x157)
    4300                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4301            
    4302                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4303                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4304                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4305                    .dwendtag $C$DW$T$29
    4306            
    4307            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4308                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4309                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4310                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4311                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4312                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4313                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    4314            
    4315            
    4316            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4317                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    4318                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4319            $C$DW$257       .dwtag  DW_TAG_member
    4320                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4321                    .dwattr $C$DW$257, DW_AT_name("clockSource")
    4322                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("clockSource")
    4323                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4324                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4325                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4326                    .dwattr $C$DW$257, DW_AT_decl_line(0x20)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   88

    4327                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4328            
    4329            $C$DW$258       .dwtag  DW_TAG_member
    4330                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    4331                    .dwattr $C$DW$258, DW_AT_name("clockSourceDivider")
    4332                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("clockSourceDivider")
    4333                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4334                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4335                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4336                    .dwattr $C$DW$258, DW_AT_decl_line(0x37)
    4337                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    4338            
    4339            $C$DW$259       .dwtag  DW_TAG_member
    4340                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    4341                    .dwattr $C$DW$259, DW_AT_name("timerInterruptEnable_TAIE")
    4342                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4343                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4344                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4345                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4346                    .dwattr $C$DW$259, DW_AT_decl_line(0x3c)
    4347                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4348            
    4349            $C$DW$260       .dwtag  DW_TAG_member
    4350                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    4351                    .dwattr $C$DW$260, DW_AT_name("timerClear")
    4352                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("timerClear")
    4353                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4354                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4355                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4356                    .dwattr $C$DW$260, DW_AT_decl_line(0x42)
    4357                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    4358            
    4359            $C$DW$261       .dwtag  DW_TAG_member
    4360                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$30)
    4361                    .dwattr $C$DW$261, DW_AT_name("startTimer")
    4362                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("startTimer")
    4363                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4364                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4365                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4366                    .dwattr $C$DW$261, DW_AT_decl_line(0x44)
    4367                    .dwattr $C$DW$261, DW_AT_decl_column(0x0a)
    4368            
    4369                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4370                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    4371                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4372                    .dwendtag $C$DW$T$31
    4373            
    4374            $C$DW$T$65      .dwtag  DW_TAG_typedef
    4375                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    4376                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    4377                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4378                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4379                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    4380                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4381            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   89

    4382            
    4383            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4384                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    4385                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    4386            $C$DW$262       .dwtag  DW_TAG_member
    4387                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    4388                    .dwattr $C$DW$262, DW_AT_name("clockSource")
    4389                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("clockSource")
    4390                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4391                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4392                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4393                    .dwattr $C$DW$262, DW_AT_decl_line(0x8b)
    4394                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    4395            
    4396            $C$DW$263       .dwtag  DW_TAG_member
    4397                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    4398                    .dwattr $C$DW$263, DW_AT_name("clockSourceDivider")
    4399                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("clockSourceDivider")
    4400                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4401                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4402                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4403                    .dwattr $C$DW$263, DW_AT_decl_line(0xa2)
    4404                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    4405            
    4406            $C$DW$264       .dwtag  DW_TAG_member
    4407                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    4408                    .dwattr $C$DW$264, DW_AT_name("timerPeriod")
    4409                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("timerPeriod")
    4410                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4411                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4412                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4413                    .dwattr $C$DW$264, DW_AT_decl_line(0xa4)
    4414                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    4415            
    4416            $C$DW$265       .dwtag  DW_TAG_member
    4417                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    4418                    .dwattr $C$DW$265, DW_AT_name("timerInterruptEnable_TAIE")
    4419                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4420                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4421                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4422                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4423                    .dwattr $C$DW$265, DW_AT_decl_line(0xa9)
    4424                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    4425            
    4426            $C$DW$266       .dwtag  DW_TAG_member
    4427                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    4428                    .dwattr $C$DW$266, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4429                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4430                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4431                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4432                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4433                    .dwattr $C$DW$266, DW_AT_decl_line(0xae)
    4434                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    4435            
    4436            $C$DW$267       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   90

    4437                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    4438                    .dwattr $C$DW$267, DW_AT_name("timerClear")
    4439                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("timerClear")
    4440                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4441                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4442                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4443                    .dwattr $C$DW$267, DW_AT_decl_line(0xb4)
    4444                    .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    4445            
    4446            $C$DW$268       .dwtag  DW_TAG_member
    4447                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$30)
    4448                    .dwattr $C$DW$268, DW_AT_name("startTimer")
    4449                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("startTimer")
    4450                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4451                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4452                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4453                    .dwattr $C$DW$268, DW_AT_decl_line(0xb6)
    4454                    .dwattr $C$DW$268, DW_AT_decl_column(0x0a)
    4455            
    4456                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4457                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    4458                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4459                    .dwendtag $C$DW$T$32
    4460            
    4461            $C$DW$T$66      .dwtag  DW_TAG_typedef
    4462                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    4463                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    4464                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4465                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4466                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    4467                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    4468            
    4469            
    4470            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4471                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    4472                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    4473            $C$DW$269       .dwtag  DW_TAG_member
    4474                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    4475                    .dwattr $C$DW$269, DW_AT_name("clockSource")
    4476                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("clockSource")
    4477                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4478                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4479                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4480                    .dwattr $C$DW$269, DW_AT_decl_line(0x105)
    4481                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    4482            
    4483            $C$DW$270       .dwtag  DW_TAG_member
    4484                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    4485                    .dwattr $C$DW$270, DW_AT_name("clockSourceDivider")
    4486                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("clockSourceDivider")
    4487                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4488                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4489                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4490                    .dwattr $C$DW$270, DW_AT_decl_line(0x11c)
    4491                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   91

    4492            
    4493            $C$DW$271       .dwtag  DW_TAG_member
    4494                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    4495                    .dwattr $C$DW$271, DW_AT_name("timerPeriod")
    4496                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("timerPeriod")
    4497                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4498                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4499                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4500                    .dwattr $C$DW$271, DW_AT_decl_line(0x11f)
    4501                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    4502            
    4503            $C$DW$272       .dwtag  DW_TAG_member
    4504                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    4505                    .dwattr $C$DW$272, DW_AT_name("timerInterruptEnable_TAIE")
    4506                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4507                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4508                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4509                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4510                    .dwattr $C$DW$272, DW_AT_decl_line(0x124)
    4511                    .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
    4512            
    4513            $C$DW$273       .dwtag  DW_TAG_member
    4514                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    4515                    .dwattr $C$DW$273, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4516                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4517                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4518                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4519                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4520                    .dwattr $C$DW$273, DW_AT_decl_line(0x129)
    4521                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    4522            
    4523            $C$DW$274       .dwtag  DW_TAG_member
    4524                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    4525                    .dwattr $C$DW$274, DW_AT_name("timerClear")
    4526                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("timerClear")
    4527                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4528                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4529                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4530                    .dwattr $C$DW$274, DW_AT_decl_line(0x12f)
    4531                    .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    4532            
    4533            $C$DW$275       .dwtag  DW_TAG_member
    4534                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$30)
    4535                    .dwattr $C$DW$275, DW_AT_name("startTimer")
    4536                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("startTimer")
    4537                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4538                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4539                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4540                    .dwattr $C$DW$275, DW_AT_decl_line(0x131)
    4541                    .dwattr $C$DW$275, DW_AT_decl_column(0x0a)
    4542            
    4543                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4544                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    4545                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4546                    .dwendtag $C$DW$T$33
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   92

    4547            
    4548            $C$DW$T$67      .dwtag  DW_TAG_typedef
    4549                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    4550                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    4551                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4552                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4553                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    4554                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    4555            
    4556            
    4557            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4558                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    4559                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    4560            $C$DW$276       .dwtag  DW_TAG_member
    4561                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    4562                    .dwattr $C$DW$276, DW_AT_name("clockSource")
    4563                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("clockSource")
    4564                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4565                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4566                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4567                    .dwattr $C$DW$276, DW_AT_decl_line(0xc5)
    4568                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    4569            
    4570            $C$DW$277       .dwtag  DW_TAG_member
    4571                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    4572                    .dwattr $C$DW$277, DW_AT_name("clockSourceDivider")
    4573                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("clockSourceDivider")
    4574                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4575                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4576                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4577                    .dwattr $C$DW$277, DW_AT_decl_line(0xdc)
    4578                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    4579            
    4580            $C$DW$278       .dwtag  DW_TAG_member
    4581                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    4582                    .dwattr $C$DW$278, DW_AT_name("timerPeriod")
    4583                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("timerPeriod")
    4584                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4585                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4586                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4587                    .dwattr $C$DW$278, DW_AT_decl_line(0xde)
    4588                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    4589            
    4590            $C$DW$279       .dwtag  DW_TAG_member
    4591                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    4592                    .dwattr $C$DW$279, DW_AT_name("compareRegister")
    4593                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("compareRegister")
    4594                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4595                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4596                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4597                    .dwattr $C$DW$279, DW_AT_decl_line(0xe9)
    4598                    .dwattr $C$DW$279, DW_AT_decl_column(0x0e)
    4599            
    4600            $C$DW$280       .dwtag  DW_TAG_member
    4601                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   93

    4602                    .dwattr $C$DW$280, DW_AT_name("compareOutputMode")
    4603                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("compareOutputMode")
    4604                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4605                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4606                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4607                    .dwattr $C$DW$280, DW_AT_decl_line(0xf4)
    4608                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    4609            
    4610            $C$DW$281       .dwtag  DW_TAG_member
    4611                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    4612                    .dwattr $C$DW$281, DW_AT_name("dutyCycle")
    4613                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("dutyCycle")
    4614                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4615                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4616                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4617                    .dwattr $C$DW$281, DW_AT_decl_line(0xf6)
    4618                    .dwattr $C$DW$281, DW_AT_decl_column(0x0e)
    4619            
    4620                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4621                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    4622                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4623                    .dwendtag $C$DW$T$34
    4624            
    4625            $C$DW$T$68      .dwtag  DW_TAG_typedef
    4626                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    4627                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    4628                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4629                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4630                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    4631                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    4632            
    4633            
    4634            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4635                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    4636                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    4637            $C$DW$282       .dwtag  DW_TAG_member
    4638                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$27)
    4639                    .dwattr $C$DW$282, DW_AT_name("captureRegister")
    4640                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("captureRegister")
    4641                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4642                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4643                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4644                    .dwattr $C$DW$282, DW_AT_decl_line(0xa0)
    4645                    .dwattr $C$DW$282, DW_AT_decl_column(0x0e)
    4646            
    4647            $C$DW$283       .dwtag  DW_TAG_member
    4648                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    4649                    .dwattr $C$DW$283, DW_AT_name("captureMode")
    4650                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("captureMode")
    4651                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4652                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4653                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4654                    .dwattr $C$DW$283, DW_AT_decl_line(0xa7)
    4655                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    4656            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   94

    4657            $C$DW$284       .dwtag  DW_TAG_member
    4658                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    4659                    .dwattr $C$DW$284, DW_AT_name("captureInputSelect")
    4660                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("captureInputSelect")
    4661                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4662                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4663                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4664                    .dwattr $C$DW$284, DW_AT_decl_line(0xae)
    4665                    .dwattr $C$DW$284, DW_AT_decl_column(0x0e)
    4666            
    4667            $C$DW$285       .dwtag  DW_TAG_member
    4668                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    4669                    .dwattr $C$DW$285, DW_AT_name("synchronizeCaptureSource")
    4670                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4671                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4672                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4673                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4674                    .dwattr $C$DW$285, DW_AT_decl_line(0xb3)
    4675                    .dwattr $C$DW$285, DW_AT_decl_column(0x0e)
    4676            
    4677            $C$DW$286       .dwtag  DW_TAG_member
    4678                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    4679                    .dwattr $C$DW$286, DW_AT_name("captureInterruptEnable")
    4680                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("captureInterruptEnable")
    4681                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4682                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4683                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4684                    .dwattr $C$DW$286, DW_AT_decl_line(0xb8)
    4685                    .dwattr $C$DW$286, DW_AT_decl_column(0x0e)
    4686            
    4687            $C$DW$287       .dwtag  DW_TAG_member
    4688                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    4689                    .dwattr $C$DW$287, DW_AT_name("captureOutputMode")
    4690                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("captureOutputMode")
    4691                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4692                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4693                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4694                    .dwattr $C$DW$287, DW_AT_decl_line(0xc3)
    4695                    .dwattr $C$DW$287, DW_AT_decl_column(0x0e)
    4696            
    4697                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4698                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    4699                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4700                    .dwendtag $C$DW$T$35
    4701            
    4702            $C$DW$T$69      .dwtag  DW_TAG_typedef
    4703                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4704                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4705                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4706                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4707                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4708                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4709            
    4710            
    4711            $C$DW$T$36      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   95

    4712                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4713                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4714            $C$DW$288       .dwtag  DW_TAG_member
    4715                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
    4716                    .dwattr $C$DW$288, DW_AT_name("compareRegister")
    4717                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("compareRegister")
    4718                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4719                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4720                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4721                    .dwattr $C$DW$288, DW_AT_decl_line(0x146)
    4722                    .dwattr $C$DW$288, DW_AT_decl_column(0x0e)
    4723            
    4724            $C$DW$289       .dwtag  DW_TAG_member
    4725                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    4726                    .dwattr $C$DW$289, DW_AT_name("compareInterruptEnable")
    4727                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("compareInterruptEnable")
    4728                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4729                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4730                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4731                    .dwattr $C$DW$289, DW_AT_decl_line(0x14b)
    4732                    .dwattr $C$DW$289, DW_AT_decl_column(0x0e)
    4733            
    4734            $C$DW$290       .dwtag  DW_TAG_member
    4735                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$27)
    4736                    .dwattr $C$DW$290, DW_AT_name("compareOutputMode")
    4737                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("compareOutputMode")
    4738                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4739                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4740                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4741                    .dwattr $C$DW$290, DW_AT_decl_line(0x156)
    4742                    .dwattr $C$DW$290, DW_AT_decl_column(0x0e)
    4743            
    4744            $C$DW$291       .dwtag  DW_TAG_member
    4745                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$27)
    4746                    .dwattr $C$DW$291, DW_AT_name("compareValue")
    4747                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("compareValue")
    4748                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4749                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4750                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4751                    .dwattr $C$DW$291, DW_AT_decl_line(0x158)
    4752                    .dwattr $C$DW$291, DW_AT_decl_column(0x0e)
    4753            
    4754                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4755                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4756                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4757                    .dwendtag $C$DW$T$36
    4758            
    4759            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4760                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4761                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    4762                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4763                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4764                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4765                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4766            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   96

    4767            
    4768            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4769                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4770                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4771            $C$DW$292       .dwtag  DW_TAG_member
    4772                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
    4773                    .dwattr $C$DW$292, DW_AT_name("clockSource")
    4774                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("clockSource")
    4775                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4776                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4777                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4778                    .dwattr $C$DW$292, DW_AT_decl_line(0xd3)
    4779                    .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    4780            
    4781            $C$DW$293       .dwtag  DW_TAG_member
    4782                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$27)
    4783                    .dwattr $C$DW$293, DW_AT_name("clockSourceDivider")
    4784                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("clockSourceDivider")
    4785                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4786                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4787                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4788                    .dwattr $C$DW$293, DW_AT_decl_line(0xea)
    4789                    .dwattr $C$DW$293, DW_AT_decl_column(0x0e)
    4790            
    4791            $C$DW$294       .dwtag  DW_TAG_member
    4792                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$27)
    4793                    .dwattr $C$DW$294, DW_AT_name("timerInterruptEnable_TBIE")
    4794                    .dwattr $C$DW$294, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4795                    .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4796                    .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4797                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4798                    .dwattr $C$DW$294, DW_AT_decl_line(0xef)
    4799                    .dwattr $C$DW$294, DW_AT_decl_column(0x0e)
    4800            
    4801            $C$DW$295       .dwtag  DW_TAG_member
    4802                    .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$27)
    4803                    .dwattr $C$DW$295, DW_AT_name("timerClear")
    4804                    .dwattr $C$DW$295, DW_AT_TI_symbol_name("timerClear")
    4805                    .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4806                    .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4807                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4808                    .dwattr $C$DW$295, DW_AT_decl_line(0xf5)
    4809                    .dwattr $C$DW$295, DW_AT_decl_column(0x0e)
    4810            
    4811            $C$DW$296       .dwtag  DW_TAG_member
    4812                    .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$30)
    4813                    .dwattr $C$DW$296, DW_AT_name("startTimer")
    4814                    .dwattr $C$DW$296, DW_AT_TI_symbol_name("startTimer")
    4815                    .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4816                    .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4817                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4818                    .dwattr $C$DW$296, DW_AT_decl_line(0xf7)
    4819                    .dwattr $C$DW$296, DW_AT_decl_column(0x0a)
    4820            
    4821                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   97

    4822                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4823                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4824                    .dwendtag $C$DW$T$37
    4825            
    4826            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4827                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4828                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4829                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4830                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4831                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4832                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4833            
    4834            
    4835            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4836                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4837                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4838            $C$DW$297       .dwtag  DW_TAG_member
    4839                    .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$27)
    4840                    .dwattr $C$DW$297, DW_AT_name("clockSource")
    4841                    .dwattr $C$DW$297, DW_AT_TI_symbol_name("clockSource")
    4842                    .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4843                    .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4844                    .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4845                    .dwattr $C$DW$297, DW_AT_decl_line(0x107)
    4846                    .dwattr $C$DW$297, DW_AT_decl_column(0x0e)
    4847            
    4848            $C$DW$298       .dwtag  DW_TAG_member
    4849                    .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$27)
    4850                    .dwattr $C$DW$298, DW_AT_name("clockSourceDivider")
    4851                    .dwattr $C$DW$298, DW_AT_TI_symbol_name("clockSourceDivider")
    4852                    .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4853                    .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4854                    .dwattr $C$DW$298, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4855                    .dwattr $C$DW$298, DW_AT_decl_line(0x11e)
    4856                    .dwattr $C$DW$298, DW_AT_decl_column(0x0e)
    4857            
    4858            $C$DW$299       .dwtag  DW_TAG_member
    4859                    .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$27)
    4860                    .dwattr $C$DW$299, DW_AT_name("timerPeriod")
    4861                    .dwattr $C$DW$299, DW_AT_TI_symbol_name("timerPeriod")
    4862                    .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4863                    .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4864                    .dwattr $C$DW$299, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4865                    .dwattr $C$DW$299, DW_AT_decl_line(0x120)
    4866                    .dwattr $C$DW$299, DW_AT_decl_column(0x0e)
    4867            
    4868            $C$DW$300       .dwtag  DW_TAG_member
    4869                    .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$27)
    4870                    .dwattr $C$DW$300, DW_AT_name("timerInterruptEnable_TBIE")
    4871                    .dwattr $C$DW$300, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4872                    .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4873                    .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4874                    .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4875                    .dwattr $C$DW$300, DW_AT_decl_line(0x125)
    4876                    .dwattr $C$DW$300, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   98

    4877            
    4878            $C$DW$301       .dwtag  DW_TAG_member
    4879                    .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$27)
    4880                    .dwattr $C$DW$301, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4881                    .dwattr $C$DW$301, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4882                    .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4883                    .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4884                    .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4885                    .dwattr $C$DW$301, DW_AT_decl_line(0x12a)
    4886                    .dwattr $C$DW$301, DW_AT_decl_column(0x0e)
    4887            
    4888            $C$DW$302       .dwtag  DW_TAG_member
    4889                    .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$27)
    4890                    .dwattr $C$DW$302, DW_AT_name("timerClear")
    4891                    .dwattr $C$DW$302, DW_AT_TI_symbol_name("timerClear")
    4892                    .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4893                    .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4894                    .dwattr $C$DW$302, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4895                    .dwattr $C$DW$302, DW_AT_decl_line(0x130)
    4896                    .dwattr $C$DW$302, DW_AT_decl_column(0x0e)
    4897            
    4898            $C$DW$303       .dwtag  DW_TAG_member
    4899                    .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$30)
    4900                    .dwattr $C$DW$303, DW_AT_name("startTimer")
    4901                    .dwattr $C$DW$303, DW_AT_TI_symbol_name("startTimer")
    4902                    .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4903                    .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4904                    .dwattr $C$DW$303, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4905                    .dwattr $C$DW$303, DW_AT_decl_line(0x132)
    4906                    .dwattr $C$DW$303, DW_AT_decl_column(0x0a)
    4907            
    4908                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4909                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4910                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4911                    .dwendtag $C$DW$T$38
    4912            
    4913            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4914                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4915                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4916                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4917                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4918                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4919                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4920            
    4921            
    4922            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4923                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4924                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4925            $C$DW$304       .dwtag  DW_TAG_member
    4926                    .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$27)
    4927                    .dwattr $C$DW$304, DW_AT_name("clockSource")
    4928                    .dwattr $C$DW$304, DW_AT_TI_symbol_name("clockSource")
    4929                    .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4930                    .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4931                    .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE   99

    4932                    .dwattr $C$DW$304, DW_AT_decl_line(0x60)
    4933                    .dwattr $C$DW$304, DW_AT_decl_column(0x0e)
    4934            
    4935            $C$DW$305       .dwtag  DW_TAG_member
    4936                    .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$27)
    4937                    .dwattr $C$DW$305, DW_AT_name("clockSourceDivider")
    4938                    .dwattr $C$DW$305, DW_AT_TI_symbol_name("clockSourceDivider")
    4939                    .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4940                    .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4941                    .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4942                    .dwattr $C$DW$305, DW_AT_decl_line(0x77)
    4943                    .dwattr $C$DW$305, DW_AT_decl_column(0x0e)
    4944            
    4945            $C$DW$306       .dwtag  DW_TAG_member
    4946                    .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$27)
    4947                    .dwattr $C$DW$306, DW_AT_name("timerPeriod")
    4948                    .dwattr $C$DW$306, DW_AT_TI_symbol_name("timerPeriod")
    4949                    .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4950                    .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4951                    .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4952                    .dwattr $C$DW$306, DW_AT_decl_line(0x7a)
    4953                    .dwattr $C$DW$306, DW_AT_decl_column(0x0e)
    4954            
    4955            $C$DW$307       .dwtag  DW_TAG_member
    4956                    .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$27)
    4957                    .dwattr $C$DW$307, DW_AT_name("timerInterruptEnable_TBIE")
    4958                    .dwattr $C$DW$307, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4959                    .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4960                    .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4961                    .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4962                    .dwattr $C$DW$307, DW_AT_decl_line(0x7f)
    4963                    .dwattr $C$DW$307, DW_AT_decl_column(0x0e)
    4964            
    4965            $C$DW$308       .dwtag  DW_TAG_member
    4966                    .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$27)
    4967                    .dwattr $C$DW$308, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4968                    .dwattr $C$DW$308, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4969                    .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4970                    .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4971                    .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4972                    .dwattr $C$DW$308, DW_AT_decl_line(0x84)
    4973                    .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    4974            
    4975            $C$DW$309       .dwtag  DW_TAG_member
    4976                    .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$27)
    4977                    .dwattr $C$DW$309, DW_AT_name("timerClear")
    4978                    .dwattr $C$DW$309, DW_AT_TI_symbol_name("timerClear")
    4979                    .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4980                    .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4981                    .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4982                    .dwattr $C$DW$309, DW_AT_decl_line(0x8a)
    4983                    .dwattr $C$DW$309, DW_AT_decl_column(0x0e)
    4984            
    4985            $C$DW$310       .dwtag  DW_TAG_member
    4986                    .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE  100

    4987                    .dwattr $C$DW$310, DW_AT_name("startTimer")
    4988                    .dwattr $C$DW$310, DW_AT_TI_symbol_name("startTimer")
    4989                    .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4990                    .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4991                    .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4992                    .dwattr $C$DW$310, DW_AT_decl_line(0x8c)
    4993                    .dwattr $C$DW$310, DW_AT_decl_column(0x0a)
    4994            
    4995                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4996                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4997                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    4998                    .dwendtag $C$DW$T$39
    4999            
    5000            $C$DW$T$73      .dwtag  DW_TAG_typedef
    5001                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    5002                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    5003                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5004                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5005                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    5006                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    5007            
    5008            
    5009            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5010                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    5011                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    5012            $C$DW$311       .dwtag  DW_TAG_member
    5013                    .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$27)
    5014                    .dwattr $C$DW$311, DW_AT_name("clockSource")
    5015                    .dwattr $C$DW$311, DW_AT_TI_symbol_name("clockSource")
    5016                    .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5017                    .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5018                    .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5019                    .dwattr $C$DW$311, DW_AT_decl_line(0x20)
    5020                    .dwattr $C$DW$311, DW_AT_decl_column(0x0e)
    5021            
    5022            $C$DW$312       .dwtag  DW_TAG_member
    5023                    .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    5024                    .dwattr $C$DW$312, DW_AT_name("clockSourceDivider")
    5025                    .dwattr $C$DW$312, DW_AT_TI_symbol_name("clockSourceDivider")
    5026                    .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5027                    .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5028                    .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5029                    .dwattr $C$DW$312, DW_AT_decl_line(0x37)
    5030                    .dwattr $C$DW$312, DW_AT_decl_column(0x0e)
    5031            
    5032            $C$DW$313       .dwtag  DW_TAG_member
    5033                    .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$27)
    5034                    .dwattr $C$DW$313, DW_AT_name("timerPeriod")
    5035                    .dwattr $C$DW$313, DW_AT_TI_symbol_name("timerPeriod")
    5036                    .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5037                    .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5038                    .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5039                    .dwattr $C$DW$313, DW_AT_decl_line(0x39)
    5040                    .dwattr $C$DW$313, DW_AT_decl_column(0x0e)
    5041            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE  101

    5042            $C$DW$314       .dwtag  DW_TAG_member
    5043                    .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$27)
    5044                    .dwattr $C$DW$314, DW_AT_name("compareRegister")
    5045                    .dwattr $C$DW$314, DW_AT_TI_symbol_name("compareRegister")
    5046                    .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5047                    .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5048                    .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5049                    .dwattr $C$DW$314, DW_AT_decl_line(0x44)
    5050                    .dwattr $C$DW$314, DW_AT_decl_column(0x0e)
    5051            
    5052            $C$DW$315       .dwtag  DW_TAG_member
    5053                    .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$27)
    5054                    .dwattr $C$DW$315, DW_AT_name("compareOutputMode")
    5055                    .dwattr $C$DW$315, DW_AT_TI_symbol_name("compareOutputMode")
    5056                    .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5057                    .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5058                    .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5059                    .dwattr $C$DW$315, DW_AT_decl_line(0x4f)
    5060                    .dwattr $C$DW$315, DW_AT_decl_column(0x0e)
    5061            
    5062            $C$DW$316       .dwtag  DW_TAG_member
    5063                    .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$27)
    5064                    .dwattr $C$DW$316, DW_AT_name("dutyCycle")
    5065                    .dwattr $C$DW$316, DW_AT_TI_symbol_name("dutyCycle")
    5066                    .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5067                    .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5068                    .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5069                    .dwattr $C$DW$316, DW_AT_decl_line(0x51)
    5070                    .dwattr $C$DW$316, DW_AT_decl_column(0x0e)
    5071            
    5072                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5073                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    5074                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    5075                    .dwendtag $C$DW$T$40
    5076            
    5077            $C$DW$T$74      .dwtag  DW_TAG_typedef
    5078                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    5079                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    5080                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5081                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5082                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    5083                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    5084            
    5085            
    5086            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5087                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    5088                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    5089            $C$DW$317       .dwtag  DW_TAG_member
    5090                    .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$24)
    5091                    .dwattr $C$DW$317, DW_AT_name("selectClockSource")
    5092                    .dwattr $C$DW$317, DW_AT_TI_symbol_name("selectClockSource")
    5093                    .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5094                    .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5095                    .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5096                    .dwattr $C$DW$317, DW_AT_decl_line(0x1c)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE  102

    5097                    .dwattr $C$DW$317, DW_AT_decl_column(0x0d)
    5098            
    5099            $C$DW$318       .dwtag  DW_TAG_member
    5100                    .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$27)
    5101                    .dwattr $C$DW$318, DW_AT_name("clockPrescalar")
    5102                    .dwattr $C$DW$318, DW_AT_TI_symbol_name("clockPrescalar")
    5103                    .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5104                    .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5105                    .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5106                    .dwattr $C$DW$318, DW_AT_decl_line(0x1e)
    5107                    .dwattr $C$DW$318, DW_AT_decl_column(0x0e)
    5108            
    5109            $C$DW$319       .dwtag  DW_TAG_member
    5110                    .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$24)
    5111                    .dwattr $C$DW$319, DW_AT_name("firstModReg")
    5112                    .dwattr $C$DW$319, DW_AT_TI_symbol_name("firstModReg")
    5113                    .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5114                    .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5115                    .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5116                    .dwattr $C$DW$319, DW_AT_decl_line(0x22)
    5117                    .dwattr $C$DW$319, DW_AT_decl_column(0x0d)
    5118            
    5119            $C$DW$320       .dwtag  DW_TAG_member
    5120                    .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$24)
    5121                    .dwattr $C$DW$320, DW_AT_name("secondModReg")
    5122                    .dwattr $C$DW$320, DW_AT_TI_symbol_name("secondModReg")
    5123                    .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5124                    .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5125                    .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5126                    .dwattr $C$DW$320, DW_AT_decl_line(0x26)
    5127                    .dwattr $C$DW$320, DW_AT_decl_column(0x0d)
    5128            
    5129            $C$DW$321       .dwtag  DW_TAG_member
    5130                    .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$24)
    5131                    .dwattr $C$DW$321, DW_AT_name("parity")
    5132                    .dwattr $C$DW$321, DW_AT_TI_symbol_name("parity")
    5133                    .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5134                    .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5135                    .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5136                    .dwattr $C$DW$321, DW_AT_decl_line(0x2c)
    5137                    .dwattr $C$DW$321, DW_AT_decl_column(0x0d)
    5138            
    5139            $C$DW$322       .dwtag  DW_TAG_member
    5140                    .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$24)
    5141                    .dwattr $C$DW$322, DW_AT_name("msborLsbFirst")
    5142                    .dwattr $C$DW$322, DW_AT_TI_symbol_name("msborLsbFirst")
    5143                    .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5144                    .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5145                    .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5146                    .dwattr $C$DW$322, DW_AT_decl_line(0x31)
    5147                    .dwattr $C$DW$322, DW_AT_decl_column(0x0d)
    5148            
    5149            $C$DW$323       .dwtag  DW_TAG_member
    5150                    .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$24)
    5151                    .dwattr $C$DW$323, DW_AT_name("numberofStopBits")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE  103

    5152                    .dwattr $C$DW$323, DW_AT_TI_symbol_name("numberofStopBits")
    5153                    .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5154                    .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5155                    .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5156                    .dwattr $C$DW$323, DW_AT_decl_line(0x36)
    5157                    .dwattr $C$DW$323, DW_AT_decl_column(0x0d)
    5158            
    5159            $C$DW$324       .dwtag  DW_TAG_member
    5160                    .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$24)
    5161                    .dwattr $C$DW$324, DW_AT_name("uartMode")
    5162                    .dwattr $C$DW$324, DW_AT_TI_symbol_name("uartMode")
    5163                    .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5164                    .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5165                    .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5166                    .dwattr $C$DW$324, DW_AT_decl_line(0x3d)
    5167                    .dwattr $C$DW$324, DW_AT_decl_column(0x0d)
    5168            
    5169            $C$DW$325       .dwtag  DW_TAG_member
    5170                    .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$24)
    5171                    .dwattr $C$DW$325, DW_AT_name("overSampling")
    5172                    .dwattr $C$DW$325, DW_AT_TI_symbol_name("overSampling")
    5173                    .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5174                    .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5175                    .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5176                    .dwattr $C$DW$325, DW_AT_decl_line(0x42)
    5177                    .dwattr $C$DW$325, DW_AT_decl_column(0x0d)
    5178            
    5179                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5180                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    5181                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5182                    .dwendtag $C$DW$T$41
    5183            
    5184            $C$DW$T$75      .dwtag  DW_TAG_typedef
    5185                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    5186                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    5187                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5188                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5189                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    5190                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    5191            
    5192            
    5193            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5194                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5195                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    5196            $C$DW$326       .dwtag  DW_TAG_member
    5197                    .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$43)
    5198                    .dwattr $C$DW$326, DW_AT_name("clockSourceFrequency")
    5199                    .dwattr $C$DW$326, DW_AT_TI_symbol_name("clockSourceFrequency")
    5200                    .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5201                    .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5202                    .dwattr $C$DW$326, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5203                    .dwattr $C$DW$326, DW_AT_decl_line(0x31)
    5204                    .dwattr $C$DW$326, DW_AT_decl_column(0x0e)
    5205            
    5206            $C$DW$327       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE  104

    5207                    .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$43)
    5208                    .dwattr $C$DW$327, DW_AT_name("desiredSpiClock")
    5209                    .dwattr $C$DW$327, DW_AT_TI_symbol_name("desiredSpiClock")
    5210                    .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5211                    .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5212                    .dwattr $C$DW$327, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5213                    .dwattr $C$DW$327, DW_AT_decl_line(0x33)
    5214                    .dwattr $C$DW$327, DW_AT_decl_column(0x0e)
    5215            
    5216                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5217                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    5218                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    5219                    .dwendtag $C$DW$T$44
    5220            
    5221            $C$DW$T$76      .dwtag  DW_TAG_typedef
    5222                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5223                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    5224                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5225                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5226                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    5227                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    5228            
    5229            
    5230            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5231                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    5232                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    5233            $C$DW$328       .dwtag  DW_TAG_member
    5234                    .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$24)
    5235                    .dwattr $C$DW$328, DW_AT_name("selectClockSource")
    5236                    .dwattr $C$DW$328, DW_AT_TI_symbol_name("selectClockSource")
    5237                    .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5238                    .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5239                    .dwattr $C$DW$328, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5240                    .dwattr $C$DW$328, DW_AT_decl_line(0x14)
    5241                    .dwattr $C$DW$328, DW_AT_decl_column(0x0d)
    5242            
    5243            $C$DW$329       .dwtag  DW_TAG_member
    5244                    .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$43)
    5245                    .dwattr $C$DW$329, DW_AT_name("clockSourceFrequency")
    5246                    .dwattr $C$DW$329, DW_AT_TI_symbol_name("clockSourceFrequency")
    5247                    .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5248                    .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5249                    .dwattr $C$DW$329, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5250                    .dwattr $C$DW$329, DW_AT_decl_line(0x16)
    5251                    .dwattr $C$DW$329, DW_AT_decl_column(0x0e)
    5252            
    5253            $C$DW$330       .dwtag  DW_TAG_member
    5254                    .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$43)
    5255                    .dwattr $C$DW$330, DW_AT_name("desiredSpiClock")
    5256                    .dwattr $C$DW$330, DW_AT_TI_symbol_name("desiredSpiClock")
    5257                    .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5258                    .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5259                    .dwattr $C$DW$330, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5260                    .dwattr $C$DW$330, DW_AT_decl_line(0x18)
    5261                    .dwattr $C$DW$330, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
calcs.asm                                                            PAGE  105

    5262            
    5263            $C$DW$331       .dwtag  DW_TAG_member
    5264                    .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$24)
    5265                    .dwattr $C$DW$331, DW_AT_name("msbFirst")
    5266                    .dwattr $C$DW$331, DW_AT_TI_symbol_name("msbFirst")
    5267                    .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5268                    .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5269                    .dwattr $C$DW$331, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5270                    .dwattr $C$DW$331, DW_AT_decl_line(0x1d)
    5271                    .dwattr $C$DW$331, DW_AT_decl_column(0x0d)
