MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:57 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Cool_Down_off.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PBOUT_L")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PBOUT_L")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$89)

    2770                    .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2771                    .dwattr $C$DW$134, DW_AT_decl_line(0x76)
    2772                    .dwattr $C$DW$134, DW_AT_decl_column(0x05)
    2773            
    2774            $C$DW$135       .dwtag  DW_TAG_enumerator
    2775                    .dwattr $C$DW$135, DW_AT_name("ack")
    2776                    .dwattr $C$DW$135, DW_AT_const_value(0x07)
    2777                    .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2778                    .dwattr $C$DW$135, DW_AT_decl_line(0x77)
    2779                    .dwattr $C$DW$135, DW_AT_decl_column(0x05)
    2780            
    2781            $C$DW$136       .dwtag  DW_TAG_enumerator
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   55

    2782                    .dwattr $C$DW$136, DW_AT_name("var")
    2783                    .dwattr $C$DW$136, DW_AT_const_value(0x08)
    2784                    .dwattr $C$DW$136, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2785                    .dwattr $C$DW$136, DW_AT_decl_line(0x78)
    2786                    .dwattr $C$DW$136, DW_AT_decl_column(0x05)
    2787            
    2788            $C$DW$137       .dwtag  DW_TAG_enumerator
    2789                    .dwattr $C$DW$137, DW_AT_name("UGmsg")
    2790                    .dwattr $C$DW$137, DW_AT_const_value(0x09)
    2791                    .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2792                    .dwattr $C$DW$137, DW_AT_decl_line(0x79)
    2793                    .dwattr $C$DW$137, DW_AT_decl_column(0x05)
    2794            
    2795                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2796                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2797                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2798                    .dwendtag $C$DW$T$57
    2799            
    2800            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2801                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2802                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2803                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2804                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2805                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    2806                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2807            
    2808            
    2809            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2810                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2811            $C$DW$138       .dwtag  DW_TAG_enumerator
    2812                    .dwattr $C$DW$138, DW_AT_name("init")
    2813                    .dwattr $C$DW$138, DW_AT_const_value(0x00)
    2814                    .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2815                    .dwattr $C$DW$138, DW_AT_decl_line(0x80)
    2816                    .dwattr $C$DW$138, DW_AT_decl_column(0x05)
    2817            
    2818            $C$DW$139       .dwtag  DW_TAG_enumerator
    2819                    .dwattr $C$DW$139, DW_AT_name("running")
    2820                    .dwattr $C$DW$139, DW_AT_const_value(0x01)
    2821                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2822                    .dwattr $C$DW$139, DW_AT_decl_line(0x80)
    2823                    .dwattr $C$DW$139, DW_AT_decl_column(0x0b)
    2824            
    2825            $C$DW$140       .dwtag  DW_TAG_enumerator
    2826                    .dwattr $C$DW$140, DW_AT_name("wait")
    2827                    .dwattr $C$DW$140, DW_AT_const_value(0x02)
    2828                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2829                    .dwattr $C$DW$140, DW_AT_decl_line(0x80)
    2830                    .dwattr $C$DW$140, DW_AT_decl_column(0x14)
    2831            
    2832                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2833                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2834                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    2835                    .dwendtag $C$DW$T$59
    2836            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   56

    2837            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2838                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2839                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2840                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2841                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2842                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2843                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2844            
    2845            
    2846            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2847                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2848            $C$DW$141       .dwtag  DW_TAG_member
    2849                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$14)
    2850                    .dwattr $C$DW$141, DW_AT_name("__max_align1")
    2851                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("__max_align1")
    2852                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2854                    .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2855                    .dwattr $C$DW$141, DW_AT_decl_line(0x7b)
    2856                    .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    2857            
    2858            $C$DW$142       .dwtag  DW_TAG_member
    2859                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$18)
    2860                    .dwattr $C$DW$142, DW_AT_name("__max_align2")
    2861                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("__max_align2")
    2862                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2863                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2864                    .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2865                    .dwattr $C$DW$142, DW_AT_decl_line(0x7c)
    2866                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2867            
    2868                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2869                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    2870                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2871                    .dwendtag $C$DW$T$22
    2872            
    2873            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2874                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    2875                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    2876                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2877                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2878                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    2879                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2880            
    2881            
    2882            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2883                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    2884                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    2885            $C$DW$143       .dwtag  DW_TAG_member
    2886                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$24)
    2887                    .dwattr $C$DW$143, DW_AT_name("memoryBufferControlIndex")
    2888                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    2889                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2890                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2891                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   57

    2892                    .dwattr $C$DW$143, DW_AT_decl_line(0x27)
    2893                    .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    2894            
    2895            $C$DW$144       .dwtag  DW_TAG_member
    2896                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$24)
    2897                    .dwattr $C$DW$144, DW_AT_name("inputSourceSelect")
    2898                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("inputSourceSelect")
    2899                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2900                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2901                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2902                    .dwattr $C$DW$144, DW_AT_decl_line(0x3b)
    2903                    .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    2904            
    2905            $C$DW$145       .dwtag  DW_TAG_member
    2906                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$24)
    2907                    .dwattr $C$DW$145, DW_AT_name("positiveRefVoltageSourceSelect")
    2908                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    2909                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2910                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2911                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2912                    .dwattr $C$DW$145, DW_AT_decl_line(0x42)
    2913                    .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    2914            
    2915            $C$DW$146       .dwtag  DW_TAG_member
    2916                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$24)
    2917                    .dwattr $C$DW$146, DW_AT_name("negativeRefVoltageSourceSelect")
    2918                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    2919                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2920                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2921                    .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2922                    .dwattr $C$DW$146, DW_AT_decl_line(0x48)
    2923                    .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    2924            
    2925            $C$DW$147       .dwtag  DW_TAG_member
    2926                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$24)
    2927                    .dwattr $C$DW$147, DW_AT_name("endOfSequence")
    2928                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("endOfSequence")
    2929                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2930                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2931                    .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2932                    .dwattr $C$DW$147, DW_AT_decl_line(0x51)
    2933                    .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    2934            
    2935                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2936                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    2937                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2938                    .dwendtag $C$DW$T$25
    2939            
    2940            $C$DW$T$62      .dwtag  DW_TAG_typedef
    2941                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    2942                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    2943                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2944                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2945                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    2946                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   58

    2947            
    2948            
    2949            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2950                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    2951                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2952            $C$DW$148       .dwtag  DW_TAG_member
    2953                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2954                    .dwattr $C$DW$148, DW_AT_name("captureRegister")
    2955                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("captureRegister")
    2956                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2957                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2958                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2959                    .dwattr $C$DW$148, DW_AT_decl_line(0x58)
    2960                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2961            
    2962            $C$DW$149       .dwtag  DW_TAG_member
    2963                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    2964                    .dwattr $C$DW$149, DW_AT_name("captureMode")
    2965                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("captureMode")
    2966                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2967                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2968                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2969                    .dwattr $C$DW$149, DW_AT_decl_line(0x5f)
    2970                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2971            
    2972            $C$DW$150       .dwtag  DW_TAG_member
    2973                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    2974                    .dwattr $C$DW$150, DW_AT_name("captureInputSelect")
    2975                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("captureInputSelect")
    2976                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2977                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2978                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2979                    .dwattr $C$DW$150, DW_AT_decl_line(0x66)
    2980                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2981            
    2982            $C$DW$151       .dwtag  DW_TAG_member
    2983                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2984                    .dwattr $C$DW$151, DW_AT_name("synchronizeCaptureSource")
    2985                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2986                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2987                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2988                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2989                    .dwattr $C$DW$151, DW_AT_decl_line(0x6b)
    2990                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2991            
    2992            $C$DW$152       .dwtag  DW_TAG_member
    2993                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2994                    .dwattr $C$DW$152, DW_AT_name("captureInterruptEnable")
    2995                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("captureInterruptEnable")
    2996                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2997                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2998                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2999                    .dwattr $C$DW$152, DW_AT_decl_line(0x70)
    3000                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    3001            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   59

    3002            $C$DW$153       .dwtag  DW_TAG_member
    3003                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    3004                    .dwattr $C$DW$153, DW_AT_name("captureOutputMode")
    3005                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("captureOutputMode")
    3006                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3007                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3008                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3009                    .dwattr $C$DW$153, DW_AT_decl_line(0x7b)
    3010                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    3011            
    3012                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3013                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3014                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3015                    .dwendtag $C$DW$T$28
    3016            
    3017            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3018                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3019                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3020                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3021                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3022                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3023                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3024            
    3025            
    3026            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3027                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3028                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3029            $C$DW$154       .dwtag  DW_TAG_member
    3030                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    3031                    .dwattr $C$DW$154, DW_AT_name("compareRegister")
    3032                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("compareRegister")
    3033                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3034                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3035                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3036                    .dwattr $C$DW$154, DW_AT_decl_line(0x145)
    3037                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    3038            
    3039            $C$DW$155       .dwtag  DW_TAG_member
    3040                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    3041                    .dwattr $C$DW$155, DW_AT_name("compareInterruptEnable")
    3042                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("compareInterruptEnable")
    3043                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3044                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3045                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3046                    .dwattr $C$DW$155, DW_AT_decl_line(0x14a)
    3047                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    3048            
    3049            $C$DW$156       .dwtag  DW_TAG_member
    3050                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    3051                    .dwattr $C$DW$156, DW_AT_name("compareOutputMode")
    3052                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("compareOutputMode")
    3053                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3054                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3055                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3056                    .dwattr $C$DW$156, DW_AT_decl_line(0x155)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   60

    3057                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    3058            
    3059            $C$DW$157       .dwtag  DW_TAG_member
    3060                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    3061                    .dwattr $C$DW$157, DW_AT_name("compareValue")
    3062                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("compareValue")
    3063                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3064                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3065                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3066                    .dwattr $C$DW$157, DW_AT_decl_line(0x157)
    3067                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    3068            
    3069                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3070                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3071                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3072                    .dwendtag $C$DW$T$29
    3073            
    3074            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3075                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3076                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3077                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3078                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3079                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3080                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3081            
    3082            
    3083            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3084                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3085                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3086            $C$DW$158       .dwtag  DW_TAG_member
    3087                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    3088                    .dwattr $C$DW$158, DW_AT_name("clockSource")
    3089                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSource")
    3090                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3091                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3092                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3093                    .dwattr $C$DW$158, DW_AT_decl_line(0x20)
    3094                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    3095            
    3096            $C$DW$159       .dwtag  DW_TAG_member
    3097                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    3098                    .dwattr $C$DW$159, DW_AT_name("clockSourceDivider")
    3099                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("clockSourceDivider")
    3100                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3101                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3102                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3103                    .dwattr $C$DW$159, DW_AT_decl_line(0x37)
    3104                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    3105            
    3106            $C$DW$160       .dwtag  DW_TAG_member
    3107                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    3108                    .dwattr $C$DW$160, DW_AT_name("timerInterruptEnable_TAIE")
    3109                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3110                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3111                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   61

    3112                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3113                    .dwattr $C$DW$160, DW_AT_decl_line(0x3c)
    3114                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    3115            
    3116            $C$DW$161       .dwtag  DW_TAG_member
    3117                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3118                    .dwattr $C$DW$161, DW_AT_name("timerClear")
    3119                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerClear")
    3120                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3121                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3122                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3123                    .dwattr $C$DW$161, DW_AT_decl_line(0x42)
    3124                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3125            
    3126            $C$DW$162       .dwtag  DW_TAG_member
    3127                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$30)
    3128                    .dwattr $C$DW$162, DW_AT_name("startTimer")
    3129                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("startTimer")
    3130                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3131                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3132                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3133                    .dwattr $C$DW$162, DW_AT_decl_line(0x44)
    3134                    .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    3135            
    3136                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3137                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3138                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3139                    .dwendtag $C$DW$T$31
    3140            
    3141            $C$DW$T$65      .dwtag  DW_TAG_typedef
    3142                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3143                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    3144                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3145                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3146                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3147                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3148            
    3149            
    3150            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3151                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3152                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3153            $C$DW$163       .dwtag  DW_TAG_member
    3154                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3155                    .dwattr $C$DW$163, DW_AT_name("clockSource")
    3156                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("clockSource")
    3157                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3159                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3160                    .dwattr $C$DW$163, DW_AT_decl_line(0x8b)
    3161                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3162            
    3163            $C$DW$164       .dwtag  DW_TAG_member
    3164                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    3165                    .dwattr $C$DW$164, DW_AT_name("clockSourceDivider")
    3166                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   62

    3167                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3168                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3169                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3170                    .dwattr $C$DW$164, DW_AT_decl_line(0xa2)
    3171                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    3172            
    3173            $C$DW$165       .dwtag  DW_TAG_member
    3174                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3175                    .dwattr $C$DW$165, DW_AT_name("timerPeriod")
    3176                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("timerPeriod")
    3177                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3178                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3179                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3180                    .dwattr $C$DW$165, DW_AT_decl_line(0xa4)
    3181                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3182            
    3183            $C$DW$166       .dwtag  DW_TAG_member
    3184                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3185                    .dwattr $C$DW$166, DW_AT_name("timerInterruptEnable_TAIE")
    3186                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3187                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3188                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3189                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3190                    .dwattr $C$DW$166, DW_AT_decl_line(0xa9)
    3191                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3192            
    3193            $C$DW$167       .dwtag  DW_TAG_member
    3194                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3195                    .dwattr $C$DW$167, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3196                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3197                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3198                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3199                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3200                    .dwattr $C$DW$167, DW_AT_decl_line(0xae)
    3201                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3202            
    3203            $C$DW$168       .dwtag  DW_TAG_member
    3204                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3205                    .dwattr $C$DW$168, DW_AT_name("timerClear")
    3206                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("timerClear")
    3207                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3208                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3209                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3210                    .dwattr $C$DW$168, DW_AT_decl_line(0xb4)
    3211                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3212            
    3213            $C$DW$169       .dwtag  DW_TAG_member
    3214                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$30)
    3215                    .dwattr $C$DW$169, DW_AT_name("startTimer")
    3216                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("startTimer")
    3217                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3218                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3219                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3220                    .dwattr $C$DW$169, DW_AT_decl_line(0xb6)
    3221                    .dwattr $C$DW$169, DW_AT_decl_column(0x0a)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   63

    3222            
    3223                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3224                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3225                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3226                    .dwendtag $C$DW$T$32
    3227            
    3228            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3229                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3230                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3231                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3232                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3233                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3234                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3235            
    3236            
    3237            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3238                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3239                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3240            $C$DW$170       .dwtag  DW_TAG_member
    3241                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3242                    .dwattr $C$DW$170, DW_AT_name("clockSource")
    3243                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("clockSource")
    3244                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3245                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3246                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3247                    .dwattr $C$DW$170, DW_AT_decl_line(0x105)
    3248                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3249            
    3250            $C$DW$171       .dwtag  DW_TAG_member
    3251                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3252                    .dwattr $C$DW$171, DW_AT_name("clockSourceDivider")
    3253                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("clockSourceDivider")
    3254                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3255                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3256                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3257                    .dwattr $C$DW$171, DW_AT_decl_line(0x11c)
    3258                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3259            
    3260            $C$DW$172       .dwtag  DW_TAG_member
    3261                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3262                    .dwattr $C$DW$172, DW_AT_name("timerPeriod")
    3263                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("timerPeriod")
    3264                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3265                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3266                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3267                    .dwattr $C$DW$172, DW_AT_decl_line(0x11f)
    3268                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3269            
    3270            $C$DW$173       .dwtag  DW_TAG_member
    3271                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3272                    .dwattr $C$DW$173, DW_AT_name("timerInterruptEnable_TAIE")
    3273                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3274                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3275                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3276                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   64

    3277                    .dwattr $C$DW$173, DW_AT_decl_line(0x124)
    3278                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3279            
    3280            $C$DW$174       .dwtag  DW_TAG_member
    3281                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3282                    .dwattr $C$DW$174, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3283                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3284                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3285                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3286                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3287                    .dwattr $C$DW$174, DW_AT_decl_line(0x129)
    3288                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    3289            
    3290            $C$DW$175       .dwtag  DW_TAG_member
    3291                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3292                    .dwattr $C$DW$175, DW_AT_name("timerClear")
    3293                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("timerClear")
    3294                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3295                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3296                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3297                    .dwattr $C$DW$175, DW_AT_decl_line(0x12f)
    3298                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3299            
    3300            $C$DW$176       .dwtag  DW_TAG_member
    3301                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$30)
    3302                    .dwattr $C$DW$176, DW_AT_name("startTimer")
    3303                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("startTimer")
    3304                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3305                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3306                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3307                    .dwattr $C$DW$176, DW_AT_decl_line(0x131)
    3308                    .dwattr $C$DW$176, DW_AT_decl_column(0x0a)
    3309            
    3310                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3311                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3312                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3313                    .dwendtag $C$DW$T$33
    3314            
    3315            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3316                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3317                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3318                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3319                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3320                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3321                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3322            
    3323            
    3324            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3325                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3326                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3327            $C$DW$177       .dwtag  DW_TAG_member
    3328                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3329                    .dwattr $C$DW$177, DW_AT_name("clockSource")
    3330                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("clockSource")
    3331                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   65

    3332                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3333                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3334                    .dwattr $C$DW$177, DW_AT_decl_line(0xc5)
    3335                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3336            
    3337            $C$DW$178       .dwtag  DW_TAG_member
    3338                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3339                    .dwattr $C$DW$178, DW_AT_name("clockSourceDivider")
    3340                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("clockSourceDivider")
    3341                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3342                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3343                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3344                    .dwattr $C$DW$178, DW_AT_decl_line(0xdc)
    3345                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3346            
    3347            $C$DW$179       .dwtag  DW_TAG_member
    3348                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3349                    .dwattr $C$DW$179, DW_AT_name("timerPeriod")
    3350                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("timerPeriod")
    3351                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3352                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3353                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3354                    .dwattr $C$DW$179, DW_AT_decl_line(0xde)
    3355                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3356            
    3357            $C$DW$180       .dwtag  DW_TAG_member
    3358                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3359                    .dwattr $C$DW$180, DW_AT_name("compareRegister")
    3360                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("compareRegister")
    3361                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3362                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3363                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3364                    .dwattr $C$DW$180, DW_AT_decl_line(0xe9)
    3365                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3366            
    3367            $C$DW$181       .dwtag  DW_TAG_member
    3368                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    3369                    .dwattr $C$DW$181, DW_AT_name("compareOutputMode")
    3370                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("compareOutputMode")
    3371                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3372                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3373                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3374                    .dwattr $C$DW$181, DW_AT_decl_line(0xf4)
    3375                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3376            
    3377            $C$DW$182       .dwtag  DW_TAG_member
    3378                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    3379                    .dwattr $C$DW$182, DW_AT_name("dutyCycle")
    3380                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("dutyCycle")
    3381                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3382                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3383                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3384                    .dwattr $C$DW$182, DW_AT_decl_line(0xf6)
    3385                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3386            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   66

    3387                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3388                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3389                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3390                    .dwendtag $C$DW$T$34
    3391            
    3392            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3393                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3394                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3395                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3396                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3397                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3398                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3399            
    3400            
    3401            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3402                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3403                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3404            $C$DW$183       .dwtag  DW_TAG_member
    3405                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3406                    .dwattr $C$DW$183, DW_AT_name("captureRegister")
    3407                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("captureRegister")
    3408                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3409                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3410                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3411                    .dwattr $C$DW$183, DW_AT_decl_line(0xa0)
    3412                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3413            
    3414            $C$DW$184       .dwtag  DW_TAG_member
    3415                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3416                    .dwattr $C$DW$184, DW_AT_name("captureMode")
    3417                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("captureMode")
    3418                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3419                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3420                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3421                    .dwattr $C$DW$184, DW_AT_decl_line(0xa7)
    3422                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3423            
    3424            $C$DW$185       .dwtag  DW_TAG_member
    3425                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$27)
    3426                    .dwattr $C$DW$185, DW_AT_name("captureInputSelect")
    3427                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("captureInputSelect")
    3428                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3429                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3430                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3431                    .dwattr $C$DW$185, DW_AT_decl_line(0xae)
    3432                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    3433            
    3434            $C$DW$186       .dwtag  DW_TAG_member
    3435                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3436                    .dwattr $C$DW$186, DW_AT_name("synchronizeCaptureSource")
    3437                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3438                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3439                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3440                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3441                    .dwattr $C$DW$186, DW_AT_decl_line(0xb3)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   67

    3442                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3443            
    3444            $C$DW$187       .dwtag  DW_TAG_member
    3445                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3446                    .dwattr $C$DW$187, DW_AT_name("captureInterruptEnable")
    3447                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("captureInterruptEnable")
    3448                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3449                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3450                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3451                    .dwattr $C$DW$187, DW_AT_decl_line(0xb8)
    3452                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3453            
    3454            $C$DW$188       .dwtag  DW_TAG_member
    3455                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3456                    .dwattr $C$DW$188, DW_AT_name("captureOutputMode")
    3457                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("captureOutputMode")
    3458                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3459                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3460                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3461                    .dwattr $C$DW$188, DW_AT_decl_line(0xc3)
    3462                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3463            
    3464                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3465                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3466                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3467                    .dwendtag $C$DW$T$35
    3468            
    3469            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3470                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3471                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    3472                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3473                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3474                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3475                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3476            
    3477            
    3478            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3479                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3480                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3481            $C$DW$189       .dwtag  DW_TAG_member
    3482                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3483                    .dwattr $C$DW$189, DW_AT_name("compareRegister")
    3484                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("compareRegister")
    3485                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3486                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3487                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3488                    .dwattr $C$DW$189, DW_AT_decl_line(0x146)
    3489                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3490            
    3491            $C$DW$190       .dwtag  DW_TAG_member
    3492                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3493                    .dwattr $C$DW$190, DW_AT_name("compareInterruptEnable")
    3494                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("compareInterruptEnable")
    3495                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3496                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   68

    3497                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3498                    .dwattr $C$DW$190, DW_AT_decl_line(0x14b)
    3499                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3500            
    3501            $C$DW$191       .dwtag  DW_TAG_member
    3502                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3503                    .dwattr $C$DW$191, DW_AT_name("compareOutputMode")
    3504                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("compareOutputMode")
    3505                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3506                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3507                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3508                    .dwattr $C$DW$191, DW_AT_decl_line(0x156)
    3509                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3510            
    3511            $C$DW$192       .dwtag  DW_TAG_member
    3512                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    3513                    .dwattr $C$DW$192, DW_AT_name("compareValue")
    3514                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("compareValue")
    3515                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3516                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3517                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3518                    .dwattr $C$DW$192, DW_AT_decl_line(0x158)
    3519                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    3520            
    3521                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3522                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3523                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3524                    .dwendtag $C$DW$T$36
    3525            
    3526            $C$DW$T$70      .dwtag  DW_TAG_typedef
    3527                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    3528                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    3529                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3530                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3531                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    3532                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3533            
    3534            
    3535            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3536                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    3537                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    3538            $C$DW$193       .dwtag  DW_TAG_member
    3539                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3540                    .dwattr $C$DW$193, DW_AT_name("clockSource")
    3541                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("clockSource")
    3542                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3543                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3544                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3545                    .dwattr $C$DW$193, DW_AT_decl_line(0xd3)
    3546                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3547            
    3548            $C$DW$194       .dwtag  DW_TAG_member
    3549                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3550                    .dwattr $C$DW$194, DW_AT_name("clockSourceDivider")
    3551                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   69

    3552                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3553                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3554                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3555                    .dwattr $C$DW$194, DW_AT_decl_line(0xea)
    3556                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3557            
    3558            $C$DW$195       .dwtag  DW_TAG_member
    3559                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3560                    .dwattr $C$DW$195, DW_AT_name("timerInterruptEnable_TBIE")
    3561                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3562                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3563                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3564                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3565                    .dwattr $C$DW$195, DW_AT_decl_line(0xef)
    3566                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3567            
    3568            $C$DW$196       .dwtag  DW_TAG_member
    3569                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3570                    .dwattr $C$DW$196, DW_AT_name("timerClear")
    3571                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("timerClear")
    3572                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3573                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3574                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3575                    .dwattr $C$DW$196, DW_AT_decl_line(0xf5)
    3576                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3577            
    3578            $C$DW$197       .dwtag  DW_TAG_member
    3579                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$30)
    3580                    .dwattr $C$DW$197, DW_AT_name("startTimer")
    3581                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("startTimer")
    3582                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3583                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3584                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3585                    .dwattr $C$DW$197, DW_AT_decl_line(0xf7)
    3586                    .dwattr $C$DW$197, DW_AT_decl_column(0x0a)
    3587            
    3588                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3589                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    3590                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3591                    .dwendtag $C$DW$T$37
    3592            
    3593            $C$DW$T$71      .dwtag  DW_TAG_typedef
    3594                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    3595                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    3596                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3597                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3598                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    3599                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    3600            
    3601            
    3602            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3603                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    3604                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    3605            $C$DW$198       .dwtag  DW_TAG_member
    3606                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   70

    3607                    .dwattr $C$DW$198, DW_AT_name("clockSource")
    3608                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("clockSource")
    3609                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3610                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3611                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3612                    .dwattr $C$DW$198, DW_AT_decl_line(0x107)
    3613                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3614            
    3615            $C$DW$199       .dwtag  DW_TAG_member
    3616                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    3617                    .dwattr $C$DW$199, DW_AT_name("clockSourceDivider")
    3618                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("clockSourceDivider")
    3619                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3620                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3621                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3622                    .dwattr $C$DW$199, DW_AT_decl_line(0x11e)
    3623                    .dwattr $C$DW$199, DW_AT_decl_column(0x0e)
    3624            
    3625            $C$DW$200       .dwtag  DW_TAG_member
    3626                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3627                    .dwattr $C$DW$200, DW_AT_name("timerPeriod")
    3628                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("timerPeriod")
    3629                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3630                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3631                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3632                    .dwattr $C$DW$200, DW_AT_decl_line(0x120)
    3633                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3634            
    3635            $C$DW$201       .dwtag  DW_TAG_member
    3636                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3637                    .dwattr $C$DW$201, DW_AT_name("timerInterruptEnable_TBIE")
    3638                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3639                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3640                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3641                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3642                    .dwattr $C$DW$201, DW_AT_decl_line(0x125)
    3643                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3644            
    3645            $C$DW$202       .dwtag  DW_TAG_member
    3646                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3647                    .dwattr $C$DW$202, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3648                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3649                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3650                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3651                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3652                    .dwattr $C$DW$202, DW_AT_decl_line(0x12a)
    3653                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3654            
    3655            $C$DW$203       .dwtag  DW_TAG_member
    3656                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3657                    .dwattr $C$DW$203, DW_AT_name("timerClear")
    3658                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("timerClear")
    3659                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3660                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3661                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   71

    3662                    .dwattr $C$DW$203, DW_AT_decl_line(0x130)
    3663                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3664            
    3665            $C$DW$204       .dwtag  DW_TAG_member
    3666                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$30)
    3667                    .dwattr $C$DW$204, DW_AT_name("startTimer")
    3668                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("startTimer")
    3669                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3670                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3671                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3672                    .dwattr $C$DW$204, DW_AT_decl_line(0x132)
    3673                    .dwattr $C$DW$204, DW_AT_decl_column(0x0a)
    3674            
    3675                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3676                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    3677                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3678                    .dwendtag $C$DW$T$38
    3679            
    3680            $C$DW$T$72      .dwtag  DW_TAG_typedef
    3681                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    3682                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    3683                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3684                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3685                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    3686                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3687            
    3688            
    3689            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3690                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    3691                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    3692            $C$DW$205       .dwtag  DW_TAG_member
    3693                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3694                    .dwattr $C$DW$205, DW_AT_name("clockSource")
    3695                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("clockSource")
    3696                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3697                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3698                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3699                    .dwattr $C$DW$205, DW_AT_decl_line(0x60)
    3700                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3701            
    3702            $C$DW$206       .dwtag  DW_TAG_member
    3703                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3704                    .dwattr $C$DW$206, DW_AT_name("clockSourceDivider")
    3705                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("clockSourceDivider")
    3706                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3707                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3708                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3709                    .dwattr $C$DW$206, DW_AT_decl_line(0x77)
    3710                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    3711            
    3712            $C$DW$207       .dwtag  DW_TAG_member
    3713                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3714                    .dwattr $C$DW$207, DW_AT_name("timerPeriod")
    3715                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("timerPeriod")
    3716                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   72

    3717                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3718                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3719                    .dwattr $C$DW$207, DW_AT_decl_line(0x7a)
    3720                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3721            
    3722            $C$DW$208       .dwtag  DW_TAG_member
    3723                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3724                    .dwattr $C$DW$208, DW_AT_name("timerInterruptEnable_TBIE")
    3725                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3726                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3727                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3728                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3729                    .dwattr $C$DW$208, DW_AT_decl_line(0x7f)
    3730                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3731            
    3732            $C$DW$209       .dwtag  DW_TAG_member
    3733                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3734                    .dwattr $C$DW$209, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3735                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3736                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3737                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3738                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3739                    .dwattr $C$DW$209, DW_AT_decl_line(0x84)
    3740                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3741            
    3742            $C$DW$210       .dwtag  DW_TAG_member
    3743                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3744                    .dwattr $C$DW$210, DW_AT_name("timerClear")
    3745                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("timerClear")
    3746                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3747                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3748                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3749                    .dwattr $C$DW$210, DW_AT_decl_line(0x8a)
    3750                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3751            
    3752            $C$DW$211       .dwtag  DW_TAG_member
    3753                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$30)
    3754                    .dwattr $C$DW$211, DW_AT_name("startTimer")
    3755                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("startTimer")
    3756                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3757                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3758                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3759                    .dwattr $C$DW$211, DW_AT_decl_line(0x8c)
    3760                    .dwattr $C$DW$211, DW_AT_decl_column(0x0a)
    3761            
    3762                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3763                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    3764                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    3765                    .dwendtag $C$DW$T$39
    3766            
    3767            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3768                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3769                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    3770                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3771                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   73

    3772                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3773                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3774            
    3775            
    3776            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3777                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3778                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3779            $C$DW$212       .dwtag  DW_TAG_member
    3780                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    3781                    .dwattr $C$DW$212, DW_AT_name("clockSource")
    3782                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("clockSource")
    3783                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3784                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3785                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3786                    .dwattr $C$DW$212, DW_AT_decl_line(0x20)
    3787                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3788            
    3789            $C$DW$213       .dwtag  DW_TAG_member
    3790                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    3791                    .dwattr $C$DW$213, DW_AT_name("clockSourceDivider")
    3792                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("clockSourceDivider")
    3793                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3794                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3795                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3796                    .dwattr $C$DW$213, DW_AT_decl_line(0x37)
    3797                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    3798            
    3799            $C$DW$214       .dwtag  DW_TAG_member
    3800                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    3801                    .dwattr $C$DW$214, DW_AT_name("timerPeriod")
    3802                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("timerPeriod")
    3803                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3804                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3805                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3806                    .dwattr $C$DW$214, DW_AT_decl_line(0x39)
    3807                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    3808            
    3809            $C$DW$215       .dwtag  DW_TAG_member
    3810                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    3811                    .dwattr $C$DW$215, DW_AT_name("compareRegister")
    3812                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("compareRegister")
    3813                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3814                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3815                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3816                    .dwattr $C$DW$215, DW_AT_decl_line(0x44)
    3817                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3818            
    3819            $C$DW$216       .dwtag  DW_TAG_member
    3820                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    3821                    .dwattr $C$DW$216, DW_AT_name("compareOutputMode")
    3822                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("compareOutputMode")
    3823                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3824                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3825                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3826                    .dwattr $C$DW$216, DW_AT_decl_line(0x4f)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   74

    3827                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    3828            
    3829            $C$DW$217       .dwtag  DW_TAG_member
    3830                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    3831                    .dwattr $C$DW$217, DW_AT_name("dutyCycle")
    3832                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("dutyCycle")
    3833                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3834                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3835                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3836                    .dwattr $C$DW$217, DW_AT_decl_line(0x51)
    3837                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    3838            
    3839                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3840                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3841                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3842                    .dwendtag $C$DW$T$40
    3843            
    3844            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3845                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3846                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3847                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3848                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3849                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3850                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3851            
    3852            
    3853            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3854                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    3855                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3856            $C$DW$218       .dwtag  DW_TAG_member
    3857                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$24)
    3858                    .dwattr $C$DW$218, DW_AT_name("selectClockSource")
    3859                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("selectClockSource")
    3860                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3862                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3863                    .dwattr $C$DW$218, DW_AT_decl_line(0x1c)
    3864                    .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    3865            
    3866            $C$DW$219       .dwtag  DW_TAG_member
    3867                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    3868                    .dwattr $C$DW$219, DW_AT_name("clockPrescalar")
    3869                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("clockPrescalar")
    3870                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3871                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3872                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3873                    .dwattr $C$DW$219, DW_AT_decl_line(0x1e)
    3874                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3875            
    3876            $C$DW$220       .dwtag  DW_TAG_member
    3877                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    3878                    .dwattr $C$DW$220, DW_AT_name("firstModReg")
    3879                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("firstModReg")
    3880                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3881                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   75

    3882                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3883                    .dwattr $C$DW$220, DW_AT_decl_line(0x22)
    3884                    .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    3885            
    3886            $C$DW$221       .dwtag  DW_TAG_member
    3887                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$24)
    3888                    .dwattr $C$DW$221, DW_AT_name("secondModReg")
    3889                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("secondModReg")
    3890                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3891                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3892                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3893                    .dwattr $C$DW$221, DW_AT_decl_line(0x26)
    3894                    .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    3895            
    3896            $C$DW$222       .dwtag  DW_TAG_member
    3897                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$24)
    3898                    .dwattr $C$DW$222, DW_AT_name("parity")
    3899                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("parity")
    3900                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3901                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3902                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3903                    .dwattr $C$DW$222, DW_AT_decl_line(0x2c)
    3904                    .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    3905            
    3906            $C$DW$223       .dwtag  DW_TAG_member
    3907                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$24)
    3908                    .dwattr $C$DW$223, DW_AT_name("msborLsbFirst")
    3909                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("msborLsbFirst")
    3910                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3911                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3912                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3913                    .dwattr $C$DW$223, DW_AT_decl_line(0x31)
    3914                    .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    3915            
    3916            $C$DW$224       .dwtag  DW_TAG_member
    3917                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$24)
    3918                    .dwattr $C$DW$224, DW_AT_name("numberofStopBits")
    3919                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("numberofStopBits")
    3920                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3921                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3922                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3923                    .dwattr $C$DW$224, DW_AT_decl_line(0x36)
    3924                    .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    3925            
    3926            $C$DW$225       .dwtag  DW_TAG_member
    3927                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$24)
    3928                    .dwattr $C$DW$225, DW_AT_name("uartMode")
    3929                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("uartMode")
    3930                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3931                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3932                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3933                    .dwattr $C$DW$225, DW_AT_decl_line(0x3d)
    3934                    .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    3935            
    3936            $C$DW$226       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   76

    3937                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$24)
    3938                    .dwattr $C$DW$226, DW_AT_name("overSampling")
    3939                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("overSampling")
    3940                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3941                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3942                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3943                    .dwattr $C$DW$226, DW_AT_decl_line(0x42)
    3944                    .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    3945            
    3946                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3947                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    3948                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3949                    .dwendtag $C$DW$T$41
    3950            
    3951            $C$DW$T$75      .dwtag  DW_TAG_typedef
    3952                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    3953                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    3954                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3955                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3956                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    3957                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3958            
    3959            
    3960            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3961                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3962                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    3963            $C$DW$227       .dwtag  DW_TAG_member
    3964                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$43)
    3965                    .dwattr $C$DW$227, DW_AT_name("clockSourceFrequency")
    3966                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("clockSourceFrequency")
    3967                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3968                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3969                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3970                    .dwattr $C$DW$227, DW_AT_decl_line(0x31)
    3971                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    3972            
    3973            $C$DW$228       .dwtag  DW_TAG_member
    3974                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$43)
    3975                    .dwattr $C$DW$228, DW_AT_name("desiredSpiClock")
    3976                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("desiredSpiClock")
    3977                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3978                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3979                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3980                    .dwattr $C$DW$228, DW_AT_decl_line(0x33)
    3981                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    3982            
    3983                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3984                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    3985                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3986                    .dwendtag $C$DW$T$44
    3987            
    3988            $C$DW$T$76      .dwtag  DW_TAG_typedef
    3989                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3990                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    3991                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:57 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Cool_Down_off.asm                                                    PAGE   77

    3992                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3993                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    3994                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3995            
    3996            
    3997            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3998                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    3999                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4000            $C$DW$229       .dwtag  DW_TAG_member
    4001                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$24)
    4002                    .dwattr $C$DW$229, DW_AT_name("selectClockSource")
    4003                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("selectClockSource")
    4004                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4005                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4006                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4007                    .dwattr $C$DW$229, DW_AT_decl_line(0x14)
    4008                    .dwattr $C$DW$229, DW_AT_decl_column(0x0d)
    4009            
    4010            $C$DW$230       .dwtag  DW_TAG_member
    4011                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$43)
    4012                    .dwattr $C$DW$230, DW_AT_name("clockSourceFrequency")
    4013                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("clockSourceFrequency")
    4014                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4015                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4016                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4017                    .dwattr $C$DW$230, DW_AT_decl_line(0x16)
    4018                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4019            
    4020            $C$DW$231       .dwtag  DW_TAG_member
    4021                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$43)
    4022                    .dwattr $C$DW$231, DW_AT_name("desiredSpiClock")
    4023                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("desiredSpiClock")
    4024                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4025                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4026                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4027                    .dwattr $C$DW$231, DW_AT_decl_line(0x18)
    4028                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4029            
    4030            $C$DW$232       .dwtag  DW_TAG_member
    4031                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$24)
    4032                    .dwattr $C$DW$232, DW_AT_name("msbFirst")
    4033                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("msbFirst")
    4034                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4035                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4036                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4037                    .dwattr $C$DW$232, DW_AT_decl_line(0x1d)
    4038                    .dwattr $C$DW$232, DW_AT_decl_column(0x0d)
    4039            
    4040            $C$DW$233       .dwtag  DW_TAG_member
    4041                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$24)
