MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:59:30 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Dallas.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PAIN_L")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PAIN_L")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$87)

    2877            $C$DW$129       .dwtag  DW_TAG_enumerator
    2878                    .dwattr $C$DW$129, DW_AT_name("crc2")
    2879                    .dwattr $C$DW$129, DW_AT_const_value(0x06)
    2880                    .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2881                    .dwattr $C$DW$129, DW_AT_decl_line(0x76)
    2882                    .dwattr $C$DW$129, DW_AT_decl_column(0x05)
    2883            
    2884            $C$DW$130       .dwtag  DW_TAG_enumerator
    2885                    .dwattr $C$DW$130, DW_AT_name("ack")
    2886                    .dwattr $C$DW$130, DW_AT_const_value(0x07)
    2887                    .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2888                    .dwattr $C$DW$130, DW_AT_decl_line(0x77)
    2889                    .dwattr $C$DW$130, DW_AT_decl_column(0x05)
    2890            
    2891            $C$DW$131       .dwtag  DW_TAG_enumerator
    2892                    .dwattr $C$DW$131, DW_AT_name("var")
    2893                    .dwattr $C$DW$131, DW_AT_const_value(0x08)
    2894                    .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2895                    .dwattr $C$DW$131, DW_AT_decl_line(0x78)
    2896                    .dwattr $C$DW$131, DW_AT_decl_column(0x05)
    2897            
    2898            $C$DW$132       .dwtag  DW_TAG_enumerator
    2899                    .dwattr $C$DW$132, DW_AT_name("UGmsg")
    2900                    .dwattr $C$DW$132, DW_AT_const_value(0x09)
    2901                    .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2902                    .dwattr $C$DW$132, DW_AT_decl_line(0x79)
    2903                    .dwattr $C$DW$132, DW_AT_decl_column(0x05)
    2904            
    2905                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2906                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2907                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2908                    .dwendtag $C$DW$T$57
    2909            
    2910            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2911                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2912                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2913                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2914                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2915                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    2916                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2917            
    2918            
    2919            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   58

    2920                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2921            $C$DW$133       .dwtag  DW_TAG_enumerator
    2922                    .dwattr $C$DW$133, DW_AT_name("init")
    2923                    .dwattr $C$DW$133, DW_AT_const_value(0x00)
    2924                    .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2925                    .dwattr $C$DW$133, DW_AT_decl_line(0x80)
    2926                    .dwattr $C$DW$133, DW_AT_decl_column(0x05)
    2927            
    2928            $C$DW$134       .dwtag  DW_TAG_enumerator
    2929                    .dwattr $C$DW$134, DW_AT_name("running")
    2930                    .dwattr $C$DW$134, DW_AT_const_value(0x01)
    2931                    .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2932                    .dwattr $C$DW$134, DW_AT_decl_line(0x80)
    2933                    .dwattr $C$DW$134, DW_AT_decl_column(0x0b)
    2934            
    2935            $C$DW$135       .dwtag  DW_TAG_enumerator
    2936                    .dwattr $C$DW$135, DW_AT_name("wait")
    2937                    .dwattr $C$DW$135, DW_AT_const_value(0x02)
    2938                    .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2939                    .dwattr $C$DW$135, DW_AT_decl_line(0x80)
    2940                    .dwattr $C$DW$135, DW_AT_decl_column(0x14)
    2941            
    2942                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2943                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2944                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    2945                    .dwendtag $C$DW$T$59
    2946            
    2947            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2948                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2949                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2950                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2951                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2952                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2953                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2954            
    2955            
    2956            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2957                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2958            $C$DW$136       .dwtag  DW_TAG_member
    2959                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$14)
    2960                    .dwattr $C$DW$136, DW_AT_name("__max_align1")
    2961                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("__max_align1")
    2962                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2963                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2964                    .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2965                    .dwattr $C$DW$136, DW_AT_decl_line(0x7b)
    2966                    .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    2967            
    2968            $C$DW$137       .dwtag  DW_TAG_member
    2969                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$18)
    2970                    .dwattr $C$DW$137, DW_AT_name("__max_align2")
    2971                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("__max_align2")
    2972                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2973                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2974                    .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   59

    2975                    .dwattr $C$DW$137, DW_AT_decl_line(0x7c)
    2976                    .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2977            
    2978                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2979                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    2980                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2981                    .dwendtag $C$DW$T$22
    2982            
    2983            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2984                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    2985                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    2986                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2987                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2988                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    2989                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2990            
    2991            
    2992            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2993                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    2994                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    2995            $C$DW$138       .dwtag  DW_TAG_member
    2996                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$24)
    2997                    .dwattr $C$DW$138, DW_AT_name("memoryBufferControlIndex")
    2998                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    2999                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3000                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    3001                    .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3002                    .dwattr $C$DW$138, DW_AT_decl_line(0x27)
    3003                    .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    3004            
    3005            $C$DW$139       .dwtag  DW_TAG_member
    3006                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$24)
    3007                    .dwattr $C$DW$139, DW_AT_name("inputSourceSelect")
    3008                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("inputSourceSelect")
    3009                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3010                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3011                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3012                    .dwattr $C$DW$139, DW_AT_decl_line(0x3b)
    3013                    .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    3014            
    3015            $C$DW$140       .dwtag  DW_TAG_member
    3016                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$24)
    3017                    .dwattr $C$DW$140, DW_AT_name("positiveRefVoltageSourceSelect")
    3018                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3019                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3020                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3021                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3022                    .dwattr $C$DW$140, DW_AT_decl_line(0x42)
    3023                    .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    3024            
    3025            $C$DW$141       .dwtag  DW_TAG_member
    3026                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$24)
    3027                    .dwattr $C$DW$141, DW_AT_name("negativeRefVoltageSourceSelect")
    3028                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3029                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   60

    3030                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3031                    .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3032                    .dwattr $C$DW$141, DW_AT_decl_line(0x48)
    3033                    .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    3034            
    3035            $C$DW$142       .dwtag  DW_TAG_member
    3036                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$24)
    3037                    .dwattr $C$DW$142, DW_AT_name("endOfSequence")
    3038                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("endOfSequence")
    3039                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3040                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3041                    .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3042                    .dwattr $C$DW$142, DW_AT_decl_line(0x51)
    3043                    .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    3044            
    3045                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3046                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3047                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3048                    .dwendtag $C$DW$T$25
    3049            
    3050            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3051                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3052                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3053                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3054                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3055                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3056                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3057            
    3058            
    3059            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3060                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3061                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3062            $C$DW$143       .dwtag  DW_TAG_member
    3063                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    3064                    .dwattr $C$DW$143, DW_AT_name("captureRegister")
    3065                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("captureRegister")
    3066                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3067                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    3068                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3069                    .dwattr $C$DW$143, DW_AT_decl_line(0x58)
    3070                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    3071            
    3072            $C$DW$144       .dwtag  DW_TAG_member
    3073                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    3074                    .dwattr $C$DW$144, DW_AT_name("captureMode")
    3075                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("captureMode")
    3076                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3077                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3078                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3079                    .dwattr $C$DW$144, DW_AT_decl_line(0x5f)
    3080                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    3081            
    3082            $C$DW$145       .dwtag  DW_TAG_member
    3083                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    3084                    .dwattr $C$DW$145, DW_AT_name("captureInputSelect")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   61

    3085                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("captureInputSelect")
    3086                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3087                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3088                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3089                    .dwattr $C$DW$145, DW_AT_decl_line(0x66)
    3090                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    3091            
    3092            $C$DW$146       .dwtag  DW_TAG_member
    3093                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    3094                    .dwattr $C$DW$146, DW_AT_name("synchronizeCaptureSource")
    3095                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3096                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3097                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3098                    .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3099                    .dwattr $C$DW$146, DW_AT_decl_line(0x6b)
    3100                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    3101            
    3102            $C$DW$147       .dwtag  DW_TAG_member
    3103                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    3104                    .dwattr $C$DW$147, DW_AT_name("captureInterruptEnable")
    3105                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("captureInterruptEnable")
    3106                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3107                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3108                    .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3109                    .dwattr $C$DW$147, DW_AT_decl_line(0x70)
    3110                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    3111            
    3112            $C$DW$148       .dwtag  DW_TAG_member
    3113                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    3114                    .dwattr $C$DW$148, DW_AT_name("captureOutputMode")
    3115                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("captureOutputMode")
    3116                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3117                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3118                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3119                    .dwattr $C$DW$148, DW_AT_decl_line(0x7b)
    3120                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    3121            
    3122                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3123                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3124                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3125                    .dwendtag $C$DW$T$28
    3126            
    3127            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3128                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3129                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3130                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3131                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3132                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3133                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3134            
    3135            
    3136            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3137                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3138                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3139            $C$DW$149       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   62

    3140                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    3141                    .dwattr $C$DW$149, DW_AT_name("compareRegister")
    3142                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("compareRegister")
    3143                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3144                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3145                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3146                    .dwattr $C$DW$149, DW_AT_decl_line(0x145)
    3147                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    3148            
    3149            $C$DW$150       .dwtag  DW_TAG_member
    3150                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    3151                    .dwattr $C$DW$150, DW_AT_name("compareInterruptEnable")
    3152                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("compareInterruptEnable")
    3153                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3154                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3155                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3156                    .dwattr $C$DW$150, DW_AT_decl_line(0x14a)
    3157                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    3158            
    3159            $C$DW$151       .dwtag  DW_TAG_member
    3160                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    3161                    .dwattr $C$DW$151, DW_AT_name("compareOutputMode")
    3162                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("compareOutputMode")
    3163                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3164                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3165                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3166                    .dwattr $C$DW$151, DW_AT_decl_line(0x155)
    3167                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    3168            
    3169            $C$DW$152       .dwtag  DW_TAG_member
    3170                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    3171                    .dwattr $C$DW$152, DW_AT_name("compareValue")
    3172                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("compareValue")
    3173                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3174                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3175                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3176                    .dwattr $C$DW$152, DW_AT_decl_line(0x157)
    3177                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    3178            
    3179                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3180                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3181                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3182                    .dwendtag $C$DW$T$29
    3183            
    3184            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3185                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3186                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3187                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3188                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3189                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3190                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3191            
    3192            
    3193            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3194                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   63

    3195                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3196            $C$DW$153       .dwtag  DW_TAG_member
    3197                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    3198                    .dwattr $C$DW$153, DW_AT_name("clockSource")
    3199                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("clockSource")
    3200                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3201                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3202                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3203                    .dwattr $C$DW$153, DW_AT_decl_line(0x20)
    3204                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    3205            
    3206            $C$DW$154       .dwtag  DW_TAG_member
    3207                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    3208                    .dwattr $C$DW$154, DW_AT_name("clockSourceDivider")
    3209                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("clockSourceDivider")
    3210                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3211                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3212                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3213                    .dwattr $C$DW$154, DW_AT_decl_line(0x37)
    3214                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    3215            
    3216            $C$DW$155       .dwtag  DW_TAG_member
    3217                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    3218                    .dwattr $C$DW$155, DW_AT_name("timerInterruptEnable_TAIE")
    3219                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3220                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3221                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3222                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3223                    .dwattr $C$DW$155, DW_AT_decl_line(0x3c)
    3224                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    3225            
    3226            $C$DW$156       .dwtag  DW_TAG_member
    3227                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    3228                    .dwattr $C$DW$156, DW_AT_name("timerClear")
    3229                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("timerClear")
    3230                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3231                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3232                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3233                    .dwattr $C$DW$156, DW_AT_decl_line(0x42)
    3234                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    3235            
    3236            $C$DW$157       .dwtag  DW_TAG_member
    3237                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$30)
    3238                    .dwattr $C$DW$157, DW_AT_name("startTimer")
    3239                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("startTimer")
    3240                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3241                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3242                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3243                    .dwattr $C$DW$157, DW_AT_decl_line(0x44)
    3244                    .dwattr $C$DW$157, DW_AT_decl_column(0x0a)
    3245            
    3246                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3247                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3248                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3249                    .dwendtag $C$DW$T$31
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   64

    3250            
    3251            $C$DW$T$65      .dwtag  DW_TAG_typedef
    3252                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3253                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    3254                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3255                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3256                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3257                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3258            
    3259            
    3260            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3261                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3262                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3263            $C$DW$158       .dwtag  DW_TAG_member
    3264                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    3265                    .dwattr $C$DW$158, DW_AT_name("clockSource")
    3266                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSource")
    3267                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3268                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3269                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3270                    .dwattr $C$DW$158, DW_AT_decl_line(0x8b)
    3271                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    3272            
    3273            $C$DW$159       .dwtag  DW_TAG_member
    3274                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    3275                    .dwattr $C$DW$159, DW_AT_name("clockSourceDivider")
    3276                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("clockSourceDivider")
    3277                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3278                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3279                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3280                    .dwattr $C$DW$159, DW_AT_decl_line(0xa2)
    3281                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    3282            
    3283            $C$DW$160       .dwtag  DW_TAG_member
    3284                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    3285                    .dwattr $C$DW$160, DW_AT_name("timerPeriod")
    3286                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerPeriod")
    3287                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3288                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3289                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3290                    .dwattr $C$DW$160, DW_AT_decl_line(0xa4)
    3291                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    3292            
    3293            $C$DW$161       .dwtag  DW_TAG_member
    3294                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3295                    .dwattr $C$DW$161, DW_AT_name("timerInterruptEnable_TAIE")
    3296                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3297                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3298                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3299                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3300                    .dwattr $C$DW$161, DW_AT_decl_line(0xa9)
    3301                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3302            
    3303            $C$DW$162       .dwtag  DW_TAG_member
    3304                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   65

    3305                    .dwattr $C$DW$162, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3306                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3307                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3308                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3309                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3310                    .dwattr $C$DW$162, DW_AT_decl_line(0xae)
    3311                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3312            
    3313            $C$DW$163       .dwtag  DW_TAG_member
    3314                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3315                    .dwattr $C$DW$163, DW_AT_name("timerClear")
    3316                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("timerClear")
    3317                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3318                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3319                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3320                    .dwattr $C$DW$163, DW_AT_decl_line(0xb4)
    3321                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3322            
    3323            $C$DW$164       .dwtag  DW_TAG_member
    3324                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$30)
    3325                    .dwattr $C$DW$164, DW_AT_name("startTimer")
    3326                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("startTimer")
    3327                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3328                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3329                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3330                    .dwattr $C$DW$164, DW_AT_decl_line(0xb6)
    3331                    .dwattr $C$DW$164, DW_AT_decl_column(0x0a)
    3332            
    3333                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3334                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3335                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3336                    .dwendtag $C$DW$T$32
    3337            
    3338            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3339                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3340                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3341                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3342                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3343                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3344                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3345            
    3346            
    3347            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3348                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3349                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3350            $C$DW$165       .dwtag  DW_TAG_member
    3351                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3352                    .dwattr $C$DW$165, DW_AT_name("clockSource")
    3353                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("clockSource")
    3354                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3355                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3356                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3357                    .dwattr $C$DW$165, DW_AT_decl_line(0x105)
    3358                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3359            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   66

    3360            $C$DW$166       .dwtag  DW_TAG_member
    3361                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3362                    .dwattr $C$DW$166, DW_AT_name("clockSourceDivider")
    3363                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockSourceDivider")
    3364                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3365                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3366                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3367                    .dwattr $C$DW$166, DW_AT_decl_line(0x11c)
    3368                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3369            
    3370            $C$DW$167       .dwtag  DW_TAG_member
    3371                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3372                    .dwattr $C$DW$167, DW_AT_name("timerPeriod")
    3373                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("timerPeriod")
    3374                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3375                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3376                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3377                    .dwattr $C$DW$167, DW_AT_decl_line(0x11f)
    3378                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3379            
    3380            $C$DW$168       .dwtag  DW_TAG_member
    3381                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3382                    .dwattr $C$DW$168, DW_AT_name("timerInterruptEnable_TAIE")
    3383                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3384                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3385                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3386                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3387                    .dwattr $C$DW$168, DW_AT_decl_line(0x124)
    3388                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3389            
    3390            $C$DW$169       .dwtag  DW_TAG_member
    3391                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3392                    .dwattr $C$DW$169, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3393                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3394                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3395                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3396                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3397                    .dwattr $C$DW$169, DW_AT_decl_line(0x129)
    3398                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3399            
    3400            $C$DW$170       .dwtag  DW_TAG_member
    3401                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3402                    .dwattr $C$DW$170, DW_AT_name("timerClear")
    3403                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("timerClear")
    3404                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3405                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3406                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3407                    .dwattr $C$DW$170, DW_AT_decl_line(0x12f)
    3408                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3409            
    3410            $C$DW$171       .dwtag  DW_TAG_member
    3411                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$30)
    3412                    .dwattr $C$DW$171, DW_AT_name("startTimer")
    3413                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("startTimer")
    3414                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   67

    3415                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3416                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3417                    .dwattr $C$DW$171, DW_AT_decl_line(0x131)
    3418                    .dwattr $C$DW$171, DW_AT_decl_column(0x0a)
    3419            
    3420                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3421                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3422                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3423                    .dwendtag $C$DW$T$33
    3424            
    3425            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3426                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3427                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3428                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3429                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3430                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3431                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3432            
    3433            
    3434            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3435                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3436                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3437            $C$DW$172       .dwtag  DW_TAG_member
    3438                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3439                    .dwattr $C$DW$172, DW_AT_name("clockSource")
    3440                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("clockSource")
    3441                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3442                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3443                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3444                    .dwattr $C$DW$172, DW_AT_decl_line(0xc5)
    3445                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3446            
    3447            $C$DW$173       .dwtag  DW_TAG_member
    3448                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3449                    .dwattr $C$DW$173, DW_AT_name("clockSourceDivider")
    3450                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("clockSourceDivider")
    3451                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3452                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3453                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3454                    .dwattr $C$DW$173, DW_AT_decl_line(0xdc)
    3455                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3456            
    3457            $C$DW$174       .dwtag  DW_TAG_member
    3458                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3459                    .dwattr $C$DW$174, DW_AT_name("timerPeriod")
    3460                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("timerPeriod")
    3461                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3462                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3463                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3464                    .dwattr $C$DW$174, DW_AT_decl_line(0xde)
    3465                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    3466            
    3467            $C$DW$175       .dwtag  DW_TAG_member
    3468                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3469                    .dwattr $C$DW$175, DW_AT_name("compareRegister")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   68

    3470                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("compareRegister")
    3471                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3472                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3473                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3474                    .dwattr $C$DW$175, DW_AT_decl_line(0xe9)
    3475                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3476            
    3477            $C$DW$176       .dwtag  DW_TAG_member
    3478                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    3479                    .dwattr $C$DW$176, DW_AT_name("compareOutputMode")
    3480                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("compareOutputMode")
    3481                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3482                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3483                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3484                    .dwattr $C$DW$176, DW_AT_decl_line(0xf4)
    3485                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    3486            
    3487            $C$DW$177       .dwtag  DW_TAG_member
    3488                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3489                    .dwattr $C$DW$177, DW_AT_name("dutyCycle")
    3490                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("dutyCycle")
    3491                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3492                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3493                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3494                    .dwattr $C$DW$177, DW_AT_decl_line(0xf6)
    3495                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3496            
    3497                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3498                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3499                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3500                    .dwendtag $C$DW$T$34
    3501            
    3502            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3503                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3504                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3505                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3506                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3507                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3508                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3509            
    3510            
    3511            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3512                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3513                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3514            $C$DW$178       .dwtag  DW_TAG_member
    3515                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3516                    .dwattr $C$DW$178, DW_AT_name("captureRegister")
    3517                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("captureRegister")
    3518                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3519                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3520                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3521                    .dwattr $C$DW$178, DW_AT_decl_line(0xa0)
    3522                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3523            
    3524            $C$DW$179       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   69

    3525                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3526                    .dwattr $C$DW$179, DW_AT_name("captureMode")
    3527                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("captureMode")
    3528                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3529                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3530                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3531                    .dwattr $C$DW$179, DW_AT_decl_line(0xa7)
    3532                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3533            
    3534            $C$DW$180       .dwtag  DW_TAG_member
    3535                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3536                    .dwattr $C$DW$180, DW_AT_name("captureInputSelect")
    3537                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("captureInputSelect")
    3538                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3539                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3540                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3541                    .dwattr $C$DW$180, DW_AT_decl_line(0xae)
    3542                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3543            
    3544            $C$DW$181       .dwtag  DW_TAG_member
    3545                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    3546                    .dwattr $C$DW$181, DW_AT_name("synchronizeCaptureSource")
    3547                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3548                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3549                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3550                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3551                    .dwattr $C$DW$181, DW_AT_decl_line(0xb3)
    3552                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3553            
    3554            $C$DW$182       .dwtag  DW_TAG_member
    3555                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    3556                    .dwattr $C$DW$182, DW_AT_name("captureInterruptEnable")
    3557                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("captureInterruptEnable")
    3558                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3559                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3560                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3561                    .dwattr $C$DW$182, DW_AT_decl_line(0xb8)
    3562                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3563            
    3564            $C$DW$183       .dwtag  DW_TAG_member
    3565                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3566                    .dwattr $C$DW$183, DW_AT_name("captureOutputMode")
    3567                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("captureOutputMode")
    3568                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3569                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3570                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3571                    .dwattr $C$DW$183, DW_AT_decl_line(0xc3)
    3572                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3573            
    3574                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3575                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3576                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3577                    .dwendtag $C$DW$T$35
    3578            
    3579            $C$DW$T$69      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   70

    3580                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3581                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    3582                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3583                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3584                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3585                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3586            
    3587            
    3588            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3589                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3590                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3591            $C$DW$184       .dwtag  DW_TAG_member
    3592                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3593                    .dwattr $C$DW$184, DW_AT_name("compareRegister")
    3594                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("compareRegister")
    3595                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3596                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3597                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3598                    .dwattr $C$DW$184, DW_AT_decl_line(0x146)
    3599                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3600            
    3601            $C$DW$185       .dwtag  DW_TAG_member
    3602                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$27)
    3603                    .dwattr $C$DW$185, DW_AT_name("compareInterruptEnable")
    3604                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("compareInterruptEnable")
    3605                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3606                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3607                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3608                    .dwattr $C$DW$185, DW_AT_decl_line(0x14b)
    3609                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    3610            
    3611            $C$DW$186       .dwtag  DW_TAG_member
    3612                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3613                    .dwattr $C$DW$186, DW_AT_name("compareOutputMode")
    3614                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("compareOutputMode")
    3615                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3616                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3617                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3618                    .dwattr $C$DW$186, DW_AT_decl_line(0x156)
    3619                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3620            
    3621            $C$DW$187       .dwtag  DW_TAG_member
    3622                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3623                    .dwattr $C$DW$187, DW_AT_name("compareValue")
    3624                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("compareValue")
    3625                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3626                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3627                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3628                    .dwattr $C$DW$187, DW_AT_decl_line(0x158)
    3629                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3630            
    3631                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3632                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3633                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3634                    .dwendtag $C$DW$T$36
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   71

    3635            
    3636            $C$DW$T$70      .dwtag  DW_TAG_typedef
    3637                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    3638                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    3639                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3640                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3641                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    3642                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3643            
    3644            
    3645            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3646                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    3647                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    3648            $C$DW$188       .dwtag  DW_TAG_member
    3649                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3650                    .dwattr $C$DW$188, DW_AT_name("clockSource")
    3651                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("clockSource")
    3652                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3653                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3654                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3655                    .dwattr $C$DW$188, DW_AT_decl_line(0xd3)
    3656                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3657            
    3658            $C$DW$189       .dwtag  DW_TAG_member
    3659                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3660                    .dwattr $C$DW$189, DW_AT_name("clockSourceDivider")
    3661                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("clockSourceDivider")
    3662                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3663                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3664                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3665                    .dwattr $C$DW$189, DW_AT_decl_line(0xea)
    3666                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3667            
    3668            $C$DW$190       .dwtag  DW_TAG_member
    3669                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3670                    .dwattr $C$DW$190, DW_AT_name("timerInterruptEnable_TBIE")
    3671                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3672                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3673                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3674                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3675                    .dwattr $C$DW$190, DW_AT_decl_line(0xef)
    3676                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3677            
    3678            $C$DW$191       .dwtag  DW_TAG_member
    3679                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3680                    .dwattr $C$DW$191, DW_AT_name("timerClear")
    3681                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("timerClear")
    3682                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3683                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3684                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3685                    .dwattr $C$DW$191, DW_AT_decl_line(0xf5)
    3686                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3687            
    3688            $C$DW$192       .dwtag  DW_TAG_member
    3689                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   72

    3690                    .dwattr $C$DW$192, DW_AT_name("startTimer")
    3691                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("startTimer")
    3692                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3693                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3694                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3695                    .dwattr $C$DW$192, DW_AT_decl_line(0xf7)
    3696                    .dwattr $C$DW$192, DW_AT_decl_column(0x0a)
    3697            
    3698                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3699                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    3700                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3701                    .dwendtag $C$DW$T$37
    3702            
    3703            $C$DW$T$71      .dwtag  DW_TAG_typedef
    3704                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    3705                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    3706                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3707                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3708                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    3709                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    3710            
    3711            
    3712            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3713                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    3714                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    3715            $C$DW$193       .dwtag  DW_TAG_member
    3716                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3717                    .dwattr $C$DW$193, DW_AT_name("clockSource")
    3718                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("clockSource")
    3719                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3720                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3721                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3722                    .dwattr $C$DW$193, DW_AT_decl_line(0x107)
    3723                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3724            
    3725            $C$DW$194       .dwtag  DW_TAG_member
    3726                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3727                    .dwattr $C$DW$194, DW_AT_name("clockSourceDivider")
    3728                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("clockSourceDivider")
    3729                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3730                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3731                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3732                    .dwattr $C$DW$194, DW_AT_decl_line(0x11e)
    3733                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3734            
    3735            $C$DW$195       .dwtag  DW_TAG_member
    3736                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3737                    .dwattr $C$DW$195, DW_AT_name("timerPeriod")
    3738                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerPeriod")
    3739                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3740                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3741                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3742                    .dwattr $C$DW$195, DW_AT_decl_line(0x120)
    3743                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3744            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   73

    3745            $C$DW$196       .dwtag  DW_TAG_member
    3746                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3747                    .dwattr $C$DW$196, DW_AT_name("timerInterruptEnable_TBIE")
    3748                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3749                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3750                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3751                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3752                    .dwattr $C$DW$196, DW_AT_decl_line(0x125)
    3753                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3754            
    3755            $C$DW$197       .dwtag  DW_TAG_member
    3756                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3757                    .dwattr $C$DW$197, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3758                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3759                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3760                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3761                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3762                    .dwattr $C$DW$197, DW_AT_decl_line(0x12a)
    3763                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3764            
    3765            $C$DW$198       .dwtag  DW_TAG_member
    3766                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3767                    .dwattr $C$DW$198, DW_AT_name("timerClear")
    3768                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("timerClear")
    3769                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3770                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3771                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3772                    .dwattr $C$DW$198, DW_AT_decl_line(0x130)
    3773                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3774            
    3775            $C$DW$199       .dwtag  DW_TAG_member
    3776                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$30)
    3777                    .dwattr $C$DW$199, DW_AT_name("startTimer")
    3778                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("startTimer")
    3779                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3780                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3781                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3782                    .dwattr $C$DW$199, DW_AT_decl_line(0x132)
    3783                    .dwattr $C$DW$199, DW_AT_decl_column(0x0a)
    3784            
    3785                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3786                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    3787                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3788                    .dwendtag $C$DW$T$38
    3789            
    3790            $C$DW$T$72      .dwtag  DW_TAG_typedef
    3791                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    3792                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    3793                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3794                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3795                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    3796                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3797            
    3798            
    3799            $C$DW$T$39      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   74

    3800                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    3801                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    3802            $C$DW$200       .dwtag  DW_TAG_member
    3803                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3804                    .dwattr $C$DW$200, DW_AT_name("clockSource")
    3805                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("clockSource")
    3806                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3807                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3808                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3809                    .dwattr $C$DW$200, DW_AT_decl_line(0x60)
    3810                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3811            
    3812            $C$DW$201       .dwtag  DW_TAG_member
    3813                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3814                    .dwattr $C$DW$201, DW_AT_name("clockSourceDivider")
    3815                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("clockSourceDivider")
    3816                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3817                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3818                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3819                    .dwattr $C$DW$201, DW_AT_decl_line(0x77)
    3820                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3821            
    3822            $C$DW$202       .dwtag  DW_TAG_member
    3823                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3824                    .dwattr $C$DW$202, DW_AT_name("timerPeriod")
    3825                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("timerPeriod")
    3826                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3827                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3828                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3829                    .dwattr $C$DW$202, DW_AT_decl_line(0x7a)
    3830                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3831            
    3832            $C$DW$203       .dwtag  DW_TAG_member
    3833                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3834                    .dwattr $C$DW$203, DW_AT_name("timerInterruptEnable_TBIE")
    3835                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3836                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3837                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3838                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3839                    .dwattr $C$DW$203, DW_AT_decl_line(0x7f)
    3840                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3841            
    3842            $C$DW$204       .dwtag  DW_TAG_member
    3843                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3844                    .dwattr $C$DW$204, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3845                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3846                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3847                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3848                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3849                    .dwattr $C$DW$204, DW_AT_decl_line(0x84)
    3850                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3851            
    3852            $C$DW$205       .dwtag  DW_TAG_member
    3853                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3854                    .dwattr $C$DW$205, DW_AT_name("timerClear")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   75

    3855                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("timerClear")
    3856                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3857                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3858                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3859                    .dwattr $C$DW$205, DW_AT_decl_line(0x8a)
    3860                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3861            
    3862            $C$DW$206       .dwtag  DW_TAG_member
    3863                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$30)
    3864                    .dwattr $C$DW$206, DW_AT_name("startTimer")
    3865                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("startTimer")
    3866                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3867                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3868                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3869                    .dwattr $C$DW$206, DW_AT_decl_line(0x8c)
    3870                    .dwattr $C$DW$206, DW_AT_decl_column(0x0a)
    3871            
    3872                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3873                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    3874                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    3875                    .dwendtag $C$DW$T$39
    3876            
    3877            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3878                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3879                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    3880                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3881                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3882                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3883                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3884            
    3885            
    3886            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3887                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3888                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3889            $C$DW$207       .dwtag  DW_TAG_member
    3890                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3891                    .dwattr $C$DW$207, DW_AT_name("clockSource")
    3892                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("clockSource")
    3893                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3894                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3895                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3896                    .dwattr $C$DW$207, DW_AT_decl_line(0x20)
    3897                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3898            
    3899            $C$DW$208       .dwtag  DW_TAG_member
    3900                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3901                    .dwattr $C$DW$208, DW_AT_name("clockSourceDivider")
    3902                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("clockSourceDivider")
    3903                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3904                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3905                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3906                    .dwattr $C$DW$208, DW_AT_decl_line(0x37)
    3907                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3908            
    3909            $C$DW$209       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   76

    3910                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3911                    .dwattr $C$DW$209, DW_AT_name("timerPeriod")
    3912                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("timerPeriod")
    3913                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3914                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3915                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3916                    .dwattr $C$DW$209, DW_AT_decl_line(0x39)
    3917                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3918            
    3919            $C$DW$210       .dwtag  DW_TAG_member
    3920                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3921                    .dwattr $C$DW$210, DW_AT_name("compareRegister")
    3922                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("compareRegister")
    3923                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3924                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3925                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3926                    .dwattr $C$DW$210, DW_AT_decl_line(0x44)
    3927                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3928            
    3929            $C$DW$211       .dwtag  DW_TAG_member
    3930                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3931                    .dwattr $C$DW$211, DW_AT_name("compareOutputMode")
    3932                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("compareOutputMode")
    3933                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3934                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3935                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3936                    .dwattr $C$DW$211, DW_AT_decl_line(0x4f)
    3937                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    3938            
    3939            $C$DW$212       .dwtag  DW_TAG_member
    3940                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    3941                    .dwattr $C$DW$212, DW_AT_name("dutyCycle")
    3942                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("dutyCycle")
    3943                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3944                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3945                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3946                    .dwattr $C$DW$212, DW_AT_decl_line(0x51)
    3947                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3948            
    3949                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3950                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3951                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3952                    .dwendtag $C$DW$T$40
    3953            
    3954            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3955                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3956                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3957                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3958                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3959                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3960                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3961            
    3962            
    3963            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3964                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   77

    3965                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3966            $C$DW$213       .dwtag  DW_TAG_member
    3967                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$24)
    3968                    .dwattr $C$DW$213, DW_AT_name("selectClockSource")
    3969                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("selectClockSource")
    3970                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3971                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3972                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3973                    .dwattr $C$DW$213, DW_AT_decl_line(0x1c)
    3974                    .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    3975            
    3976            $C$DW$214       .dwtag  DW_TAG_member
    3977                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    3978                    .dwattr $C$DW$214, DW_AT_name("clockPrescalar")
    3979                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("clockPrescalar")
    3980                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3981                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3982                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3983                    .dwattr $C$DW$214, DW_AT_decl_line(0x1e)
    3984                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    3985            
    3986            $C$DW$215       .dwtag  DW_TAG_member
    3987                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$24)
    3988                    .dwattr $C$DW$215, DW_AT_name("firstModReg")
    3989                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("firstModReg")
    3990                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3991                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3992                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3993                    .dwattr $C$DW$215, DW_AT_decl_line(0x22)
    3994                    .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    3995            
    3996            $C$DW$216       .dwtag  DW_TAG_member
    3997                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$24)
    3998                    .dwattr $C$DW$216, DW_AT_name("secondModReg")
    3999                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("secondModReg")
    4000                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4001                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4002                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4003                    .dwattr $C$DW$216, DW_AT_decl_line(0x26)
    4004                    .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    4005            
    4006            $C$DW$217       .dwtag  DW_TAG_member
    4007                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$24)
    4008                    .dwattr $C$DW$217, DW_AT_name("parity")
    4009                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("parity")
    4010                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4011                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4012                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4013                    .dwattr $C$DW$217, DW_AT_decl_line(0x2c)
    4014                    .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    4015            
    4016            $C$DW$218       .dwtag  DW_TAG_member
    4017                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$24)
    4018                    .dwattr $C$DW$218, DW_AT_name("msborLsbFirst")
    4019                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("msborLsbFirst")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   78

    4020                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4021                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4022                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4023                    .dwattr $C$DW$218, DW_AT_decl_line(0x31)
    4024                    .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    4025            
    4026            $C$DW$219       .dwtag  DW_TAG_member
    4027                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$24)
    4028                    .dwattr $C$DW$219, DW_AT_name("numberofStopBits")
    4029                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("numberofStopBits")
    4030                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4031                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4032                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4033                    .dwattr $C$DW$219, DW_AT_decl_line(0x36)
    4034                    .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    4035            
    4036            $C$DW$220       .dwtag  DW_TAG_member
    4037                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    4038                    .dwattr $C$DW$220, DW_AT_name("uartMode")
    4039                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("uartMode")
    4040                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4041                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4042                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4043                    .dwattr $C$DW$220, DW_AT_decl_line(0x3d)
    4044                    .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    4045            
    4046            $C$DW$221       .dwtag  DW_TAG_member
    4047                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$24)
    4048                    .dwattr $C$DW$221, DW_AT_name("overSampling")
    4049                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("overSampling")
    4050                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4051                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4052                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4053                    .dwattr $C$DW$221, DW_AT_decl_line(0x42)
    4054                    .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    4055            
    4056                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4057                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4058                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4059                    .dwendtag $C$DW$T$41
    4060            
    4061            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4062                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4063                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4064                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4065                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4066                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4067                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4068            
    4069            
    4070            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4071                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4072                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4073            $C$DW$222       .dwtag  DW_TAG_member
    4074                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$43)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   79

    4075                    .dwattr $C$DW$222, DW_AT_name("clockSourceFrequency")
    4076                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("clockSourceFrequency")
    4077                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4078                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4079                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4080                    .dwattr $C$DW$222, DW_AT_decl_line(0x31)
    4081                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    4082            
    4083            $C$DW$223       .dwtag  DW_TAG_member
    4084                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$43)
    4085                    .dwattr $C$DW$223, DW_AT_name("desiredSpiClock")
    4086                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("desiredSpiClock")
    4087                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4088                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4089                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4090                    .dwattr $C$DW$223, DW_AT_decl_line(0x33)
    4091                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    4092            
    4093                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4094                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4095                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4096                    .dwendtag $C$DW$T$44
    4097            
    4098            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4099                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4100                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4101                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4102                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4103                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4104                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4105            
    4106            
    4107            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4108                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4109                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4110            $C$DW$224       .dwtag  DW_TAG_member
    4111                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$24)
    4112                    .dwattr $C$DW$224, DW_AT_name("selectClockSource")
    4113                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("selectClockSource")
    4114                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4115                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4116                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4117                    .dwattr $C$DW$224, DW_AT_decl_line(0x14)
    4118                    .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    4119            
    4120            $C$DW$225       .dwtag  DW_TAG_member
    4121                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$43)
    4122                    .dwattr $C$DW$225, DW_AT_name("clockSourceFrequency")
    4123                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("clockSourceFrequency")
    4124                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4125                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4126                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4127                    .dwattr $C$DW$225, DW_AT_decl_line(0x16)
    4128                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    4129            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:30 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Dallas.asm                                                           PAGE   80

    4130            $C$DW$226       .dwtag  DW_TAG_member
    4131                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$43)
    4132                    .dwattr $C$DW$226, DW_AT_name("desiredSpiClock")
    4133                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("desiredSpiClock")
    4134                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4135                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4136                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4137                    .dwattr $C$DW$226, DW_AT_decl_line(0x18)
    4138                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    4139            
    4140            $C$DW$227       .dwtag  DW_TAG_member
    4141                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$24)
    4142                    .dwattr $C$DW$227, DW_AT_name("msbFirst")
    4143                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("msbFirst")
    4144                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4145                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4146                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4147                    .dwattr $C$DW$227, DW_AT_decl_line(0x1d)
    4148                    .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    4149            
