MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:03 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/emergencycheck.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PDOUT_H")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PDOUT_H")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$86)

    3239            $C$DW$154       .dwtag  DW_TAG_enumerator
    3240                    .dwattr $C$DW$154, DW_AT_name("crc2")
    3241                    .dwattr $C$DW$154, DW_AT_const_value(0x06)
    3242                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3243                    .dwattr $C$DW$154, DW_AT_decl_line(0x76)
    3244                    .dwattr $C$DW$154, DW_AT_decl_column(0x05)
    3245            
    3246            $C$DW$155       .dwtag  DW_TAG_enumerator
    3247                    .dwattr $C$DW$155, DW_AT_name("ack")
    3248                    .dwattr $C$DW$155, DW_AT_const_value(0x07)
    3249                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3250                    .dwattr $C$DW$155, DW_AT_decl_line(0x77)
    3251                    .dwattr $C$DW$155, DW_AT_decl_column(0x05)
    3252            
    3253            $C$DW$156       .dwtag  DW_TAG_enumerator
    3254                    .dwattr $C$DW$156, DW_AT_name("var")
    3255                    .dwattr $C$DW$156, DW_AT_const_value(0x08)
    3256                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3257                    .dwattr $C$DW$156, DW_AT_decl_line(0x78)
    3258                    .dwattr $C$DW$156, DW_AT_decl_column(0x05)
    3259            
    3260            $C$DW$157       .dwtag  DW_TAG_enumerator
    3261                    .dwattr $C$DW$157, DW_AT_name("UGmsg")
    3262                    .dwattr $C$DW$157, DW_AT_const_value(0x09)
    3263                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3264                    .dwattr $C$DW$157, DW_AT_decl_line(0x79)
    3265                    .dwattr $C$DW$157, DW_AT_decl_column(0x05)
    3266            
    3267                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3268                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    3269                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    3270                    .dwendtag $C$DW$T$57
    3271            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   66

    3272            $C$DW$T$58      .dwtag  DW_TAG_typedef
    3273                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    3274                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3275                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3276                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3277                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    3278                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3279            
    3280            
    3281            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3282                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3283            $C$DW$158       .dwtag  DW_TAG_enumerator
    3284                    .dwattr $C$DW$158, DW_AT_name("init")
    3285                    .dwattr $C$DW$158, DW_AT_const_value(0x00)
    3286                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3287                    .dwattr $C$DW$158, DW_AT_decl_line(0x80)
    3288                    .dwattr $C$DW$158, DW_AT_decl_column(0x05)
    3289            
    3290            $C$DW$159       .dwtag  DW_TAG_enumerator
    3291                    .dwattr $C$DW$159, DW_AT_name("running")
    3292                    .dwattr $C$DW$159, DW_AT_const_value(0x01)
    3293                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3294                    .dwattr $C$DW$159, DW_AT_decl_line(0x80)
    3295                    .dwattr $C$DW$159, DW_AT_decl_column(0x0b)
    3296            
    3297            $C$DW$160       .dwtag  DW_TAG_enumerator
    3298                    .dwattr $C$DW$160, DW_AT_name("wait")
    3299                    .dwattr $C$DW$160, DW_AT_const_value(0x02)
    3300                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3301                    .dwattr $C$DW$160, DW_AT_decl_line(0x80)
    3302                    .dwattr $C$DW$160, DW_AT_decl_column(0x14)
    3303            
    3304                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3305                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    3306                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3307                    .dwendtag $C$DW$T$59
    3308            
    3309            $C$DW$T$60      .dwtag  DW_TAG_typedef
    3310                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    3311                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3312                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3313                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3314                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    3315                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3316            
    3317            
    3318            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3319                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3320            $C$DW$161       .dwtag  DW_TAG_member
    3321                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$14)
    3322                    .dwattr $C$DW$161, DW_AT_name("__max_align1")
    3323                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("__max_align1")
    3324                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3325                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3326                    .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   67

    3327                    .dwattr $C$DW$161, DW_AT_decl_line(0x7b)
    3328                    .dwattr $C$DW$161, DW_AT_decl_column(0x0c)
    3329            
    3330            $C$DW$162       .dwtag  DW_TAG_member
    3331                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$18)
    3332                    .dwattr $C$DW$162, DW_AT_name("__max_align2")
    3333                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("__max_align2")
    3334                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3335                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3336                    .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3337                    .dwattr $C$DW$162, DW_AT_decl_line(0x7c)
    3338                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3339            
    3340                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3341                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3342                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3343                    .dwendtag $C$DW$T$22
    3344            
    3345            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3346                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3347                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3348                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3349                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3350                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3351                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3352            
    3353            
    3354            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3355                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3356                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    3357            $C$DW$163       .dwtag  DW_TAG_member
    3358                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$24)
    3359                    .dwattr $C$DW$163, DW_AT_name("memoryBufferControlIndex")
    3360                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3361                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3362                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3363                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3364                    .dwattr $C$DW$163, DW_AT_decl_line(0x27)
    3365                    .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    3366            
    3367            $C$DW$164       .dwtag  DW_TAG_member
    3368                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$24)
    3369                    .dwattr $C$DW$164, DW_AT_name("inputSourceSelect")
    3370                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("inputSourceSelect")
    3371                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3372                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3373                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3374                    .dwattr $C$DW$164, DW_AT_decl_line(0x3b)
    3375                    .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    3376            
    3377            $C$DW$165       .dwtag  DW_TAG_member
    3378                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$24)
    3379                    .dwattr $C$DW$165, DW_AT_name("positiveRefVoltageSourceSelect")
    3380                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3381                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   68

    3382                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3383                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3384                    .dwattr $C$DW$165, DW_AT_decl_line(0x42)
    3385                    .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    3386            
    3387            $C$DW$166       .dwtag  DW_TAG_member
    3388                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$24)
    3389                    .dwattr $C$DW$166, DW_AT_name("negativeRefVoltageSourceSelect")
    3390                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3391                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3392                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3393                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3394                    .dwattr $C$DW$166, DW_AT_decl_line(0x48)
    3395                    .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    3396            
    3397            $C$DW$167       .dwtag  DW_TAG_member
    3398                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$24)
    3399                    .dwattr $C$DW$167, DW_AT_name("endOfSequence")
    3400                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("endOfSequence")
    3401                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3402                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3403                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3404                    .dwattr $C$DW$167, DW_AT_decl_line(0x51)
    3405                    .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    3406            
    3407                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3408                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3409                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3410                    .dwendtag $C$DW$T$25
    3411            
    3412            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3413                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3414                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3415                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3416                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3417                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3418                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3419            
    3420            
    3421            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3422                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3423                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3424            $C$DW$168       .dwtag  DW_TAG_member
    3425                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3426                    .dwattr $C$DW$168, DW_AT_name("captureRegister")
    3427                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("captureRegister")
    3428                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3429                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3430                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3431                    .dwattr $C$DW$168, DW_AT_decl_line(0x58)
    3432                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3433            
    3434            $C$DW$169       .dwtag  DW_TAG_member
    3435                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3436                    .dwattr $C$DW$169, DW_AT_name("captureMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   69

    3437                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("captureMode")
    3438                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3439                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3440                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3441                    .dwattr $C$DW$169, DW_AT_decl_line(0x5f)
    3442                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3443            
    3444            $C$DW$170       .dwtag  DW_TAG_member
    3445                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3446                    .dwattr $C$DW$170, DW_AT_name("captureInputSelect")
    3447                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("captureInputSelect")
    3448                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3449                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3450                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3451                    .dwattr $C$DW$170, DW_AT_decl_line(0x66)
    3452                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3453            
    3454            $C$DW$171       .dwtag  DW_TAG_member
    3455                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3456                    .dwattr $C$DW$171, DW_AT_name("synchronizeCaptureSource")
    3457                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3458                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3459                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3460                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3461                    .dwattr $C$DW$171, DW_AT_decl_line(0x6b)
    3462                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3463            
    3464            $C$DW$172       .dwtag  DW_TAG_member
    3465                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3466                    .dwattr $C$DW$172, DW_AT_name("captureInterruptEnable")
    3467                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("captureInterruptEnable")
    3468                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3469                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3470                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3471                    .dwattr $C$DW$172, DW_AT_decl_line(0x70)
    3472                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3473            
    3474            $C$DW$173       .dwtag  DW_TAG_member
    3475                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3476                    .dwattr $C$DW$173, DW_AT_name("captureOutputMode")
    3477                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("captureOutputMode")
    3478                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3479                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3480                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3481                    .dwattr $C$DW$173, DW_AT_decl_line(0x7b)
    3482                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3483            
    3484                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3485                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3486                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3487                    .dwendtag $C$DW$T$28
    3488            
    3489            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3490                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3491                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   70

    3492                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3493                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3494                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3495                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3496            
    3497            
    3498            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3499                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3500                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3501            $C$DW$174       .dwtag  DW_TAG_member
    3502                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3503                    .dwattr $C$DW$174, DW_AT_name("compareRegister")
    3504                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("compareRegister")
    3505                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3506                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3507                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3508                    .dwattr $C$DW$174, DW_AT_decl_line(0x145)
    3509                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    3510            
    3511            $C$DW$175       .dwtag  DW_TAG_member
    3512                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3513                    .dwattr $C$DW$175, DW_AT_name("compareInterruptEnable")
    3514                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("compareInterruptEnable")
    3515                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3516                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3517                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3518                    .dwattr $C$DW$175, DW_AT_decl_line(0x14a)
    3519                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3520            
    3521            $C$DW$176       .dwtag  DW_TAG_member
    3522                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    3523                    .dwattr $C$DW$176, DW_AT_name("compareOutputMode")
    3524                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("compareOutputMode")
    3525                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3526                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3527                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3528                    .dwattr $C$DW$176, DW_AT_decl_line(0x155)
    3529                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    3530            
    3531            $C$DW$177       .dwtag  DW_TAG_member
    3532                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3533                    .dwattr $C$DW$177, DW_AT_name("compareValue")
    3534                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("compareValue")
    3535                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3536                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3537                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3538                    .dwattr $C$DW$177, DW_AT_decl_line(0x157)
    3539                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3540            
    3541                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3542                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3543                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3544                    .dwendtag $C$DW$T$29
    3545            
    3546            $C$DW$T$64      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   71

    3547                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3548                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3549                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3550                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3551                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3552                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3553            
    3554            
    3555            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3556                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3557                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3558            $C$DW$178       .dwtag  DW_TAG_member
    3559                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3560                    .dwattr $C$DW$178, DW_AT_name("clockSource")
    3561                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("clockSource")
    3562                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3563                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3564                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3565                    .dwattr $C$DW$178, DW_AT_decl_line(0x20)
    3566                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3567            
    3568            $C$DW$179       .dwtag  DW_TAG_member
    3569                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3570                    .dwattr $C$DW$179, DW_AT_name("clockSourceDivider")
    3571                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("clockSourceDivider")
    3572                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3573                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3574                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3575                    .dwattr $C$DW$179, DW_AT_decl_line(0x37)
    3576                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3577            
    3578            $C$DW$180       .dwtag  DW_TAG_member
    3579                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3580                    .dwattr $C$DW$180, DW_AT_name("timerInterruptEnable_TAIE")
    3581                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3582                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3583                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3584                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3585                    .dwattr $C$DW$180, DW_AT_decl_line(0x3c)
    3586                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3587            
    3588            $C$DW$181       .dwtag  DW_TAG_member
    3589                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    3590                    .dwattr $C$DW$181, DW_AT_name("timerClear")
    3591                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("timerClear")
    3592                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3593                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3594                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3595                    .dwattr $C$DW$181, DW_AT_decl_line(0x42)
    3596                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3597            
    3598            $C$DW$182       .dwtag  DW_TAG_member
    3599                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$30)
    3600                    .dwattr $C$DW$182, DW_AT_name("startTimer")
    3601                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("startTimer")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   72

    3602                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3603                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3604                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3605                    .dwattr $C$DW$182, DW_AT_decl_line(0x44)
    3606                    .dwattr $C$DW$182, DW_AT_decl_column(0x0a)
    3607            
    3608                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3609                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3610                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3611                    .dwendtag $C$DW$T$31
    3612            
    3613            $C$DW$T$65      .dwtag  DW_TAG_typedef
    3614                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3615                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    3616                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3617                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3618                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3619                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3620            
    3621            
    3622            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3623                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3624                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3625            $C$DW$183       .dwtag  DW_TAG_member
    3626                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3627                    .dwattr $C$DW$183, DW_AT_name("clockSource")
    3628                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("clockSource")
    3629                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3630                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3631                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3632                    .dwattr $C$DW$183, DW_AT_decl_line(0x8b)
    3633                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3634            
    3635            $C$DW$184       .dwtag  DW_TAG_member
    3636                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3637                    .dwattr $C$DW$184, DW_AT_name("clockSourceDivider")
    3638                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("clockSourceDivider")
    3639                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3640                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3641                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3642                    .dwattr $C$DW$184, DW_AT_decl_line(0xa2)
    3643                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3644            
    3645            $C$DW$185       .dwtag  DW_TAG_member
    3646                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$27)
    3647                    .dwattr $C$DW$185, DW_AT_name("timerPeriod")
    3648                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("timerPeriod")
    3649                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3650                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3651                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3652                    .dwattr $C$DW$185, DW_AT_decl_line(0xa4)
    3653                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    3654            
    3655            $C$DW$186       .dwtag  DW_TAG_member
    3656                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   73

    3657                    .dwattr $C$DW$186, DW_AT_name("timerInterruptEnable_TAIE")
    3658                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3659                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3660                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3661                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3662                    .dwattr $C$DW$186, DW_AT_decl_line(0xa9)
    3663                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3664            
    3665            $C$DW$187       .dwtag  DW_TAG_member
    3666                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3667                    .dwattr $C$DW$187, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3668                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3669                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3670                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3671                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3672                    .dwattr $C$DW$187, DW_AT_decl_line(0xae)
    3673                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3674            
    3675            $C$DW$188       .dwtag  DW_TAG_member
    3676                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3677                    .dwattr $C$DW$188, DW_AT_name("timerClear")
    3678                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("timerClear")
    3679                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3680                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3681                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3682                    .dwattr $C$DW$188, DW_AT_decl_line(0xb4)
    3683                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3684            
    3685            $C$DW$189       .dwtag  DW_TAG_member
    3686                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$30)
    3687                    .dwattr $C$DW$189, DW_AT_name("startTimer")
    3688                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("startTimer")
    3689                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3690                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3691                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3692                    .dwattr $C$DW$189, DW_AT_decl_line(0xb6)
    3693                    .dwattr $C$DW$189, DW_AT_decl_column(0x0a)
    3694            
    3695                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3696                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3697                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3698                    .dwendtag $C$DW$T$32
    3699            
    3700            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3701                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3702                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3703                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3704                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3705                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3706                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3707            
    3708            
    3709            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3710                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3711                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   74

    3712            $C$DW$190       .dwtag  DW_TAG_member
    3713                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3714                    .dwattr $C$DW$190, DW_AT_name("clockSource")
    3715                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("clockSource")
    3716                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3717                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3718                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3719                    .dwattr $C$DW$190, DW_AT_decl_line(0x105)
    3720                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3721            
    3722            $C$DW$191       .dwtag  DW_TAG_member
    3723                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3724                    .dwattr $C$DW$191, DW_AT_name("clockSourceDivider")
    3725                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("clockSourceDivider")
    3726                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3727                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3728                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3729                    .dwattr $C$DW$191, DW_AT_decl_line(0x11c)
    3730                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3731            
    3732            $C$DW$192       .dwtag  DW_TAG_member
    3733                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    3734                    .dwattr $C$DW$192, DW_AT_name("timerPeriod")
    3735                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("timerPeriod")
    3736                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3737                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3738                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3739                    .dwattr $C$DW$192, DW_AT_decl_line(0x11f)
    3740                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    3741            
    3742            $C$DW$193       .dwtag  DW_TAG_member
    3743                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3744                    .dwattr $C$DW$193, DW_AT_name("timerInterruptEnable_TAIE")
    3745                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3746                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3747                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3748                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3749                    .dwattr $C$DW$193, DW_AT_decl_line(0x124)
    3750                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3751            
    3752            $C$DW$194       .dwtag  DW_TAG_member
    3753                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3754                    .dwattr $C$DW$194, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3755                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3756                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3757                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3758                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3759                    .dwattr $C$DW$194, DW_AT_decl_line(0x129)
    3760                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3761            
    3762            $C$DW$195       .dwtag  DW_TAG_member
    3763                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3764                    .dwattr $C$DW$195, DW_AT_name("timerClear")
    3765                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerClear")
    3766                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   75

    3767                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3768                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3769                    .dwattr $C$DW$195, DW_AT_decl_line(0x12f)
    3770                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3771            
    3772            $C$DW$196       .dwtag  DW_TAG_member
    3773                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$30)
    3774                    .dwattr $C$DW$196, DW_AT_name("startTimer")
    3775                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("startTimer")
    3776                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3777                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3778                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3779                    .dwattr $C$DW$196, DW_AT_decl_line(0x131)
    3780                    .dwattr $C$DW$196, DW_AT_decl_column(0x0a)
    3781            
    3782                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3783                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3784                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3785                    .dwendtag $C$DW$T$33
    3786            
    3787            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3788                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3789                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3790                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3791                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3792                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3793                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3794            
    3795            
    3796            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3797                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3798                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3799            $C$DW$197       .dwtag  DW_TAG_member
    3800                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3801                    .dwattr $C$DW$197, DW_AT_name("clockSource")
    3802                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("clockSource")
    3803                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3804                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3805                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3806                    .dwattr $C$DW$197, DW_AT_decl_line(0xc5)
    3807                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3808            
    3809            $C$DW$198       .dwtag  DW_TAG_member
    3810                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3811                    .dwattr $C$DW$198, DW_AT_name("clockSourceDivider")
    3812                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("clockSourceDivider")
    3813                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3814                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3815                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3816                    .dwattr $C$DW$198, DW_AT_decl_line(0xdc)
    3817                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3818            
    3819            $C$DW$199       .dwtag  DW_TAG_member
    3820                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    3821                    .dwattr $C$DW$199, DW_AT_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   76

    3822                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("timerPeriod")
    3823                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3824                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3825                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3826                    .dwattr $C$DW$199, DW_AT_decl_line(0xde)
    3827                    .dwattr $C$DW$199, DW_AT_decl_column(0x0e)
    3828            
    3829            $C$DW$200       .dwtag  DW_TAG_member
    3830                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3831                    .dwattr $C$DW$200, DW_AT_name("compareRegister")
    3832                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("compareRegister")
    3833                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3834                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3835                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3836                    .dwattr $C$DW$200, DW_AT_decl_line(0xe9)
    3837                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3838            
    3839            $C$DW$201       .dwtag  DW_TAG_member
    3840                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3841                    .dwattr $C$DW$201, DW_AT_name("compareOutputMode")
    3842                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("compareOutputMode")
    3843                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3844                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3845                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3846                    .dwattr $C$DW$201, DW_AT_decl_line(0xf4)
    3847                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3848            
    3849            $C$DW$202       .dwtag  DW_TAG_member
    3850                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3851                    .dwattr $C$DW$202, DW_AT_name("dutyCycle")
    3852                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("dutyCycle")
    3853                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3854                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3855                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3856                    .dwattr $C$DW$202, DW_AT_decl_line(0xf6)
    3857                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3858            
    3859                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3860                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3861                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3862                    .dwendtag $C$DW$T$34
    3863            
    3864            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3865                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3866                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3867                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3868                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3869                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3870                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3871            
    3872            
    3873            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3874                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3875                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3876            $C$DW$203       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   77

    3877                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3878                    .dwattr $C$DW$203, DW_AT_name("captureRegister")
    3879                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("captureRegister")
    3880                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3881                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3882                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3883                    .dwattr $C$DW$203, DW_AT_decl_line(0xa0)
    3884                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3885            
    3886            $C$DW$204       .dwtag  DW_TAG_member
    3887                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3888                    .dwattr $C$DW$204, DW_AT_name("captureMode")
    3889                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("captureMode")
    3890                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3891                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3892                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3893                    .dwattr $C$DW$204, DW_AT_decl_line(0xa7)
    3894                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3895            
    3896            $C$DW$205       .dwtag  DW_TAG_member
    3897                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3898                    .dwattr $C$DW$205, DW_AT_name("captureInputSelect")
    3899                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("captureInputSelect")
    3900                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3901                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3902                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3903                    .dwattr $C$DW$205, DW_AT_decl_line(0xae)
    3904                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3905            
    3906            $C$DW$206       .dwtag  DW_TAG_member
    3907                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3908                    .dwattr $C$DW$206, DW_AT_name("synchronizeCaptureSource")
    3909                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3910                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3911                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3912                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3913                    .dwattr $C$DW$206, DW_AT_decl_line(0xb3)
    3914                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    3915            
    3916            $C$DW$207       .dwtag  DW_TAG_member
    3917                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3918                    .dwattr $C$DW$207, DW_AT_name("captureInterruptEnable")
    3919                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("captureInterruptEnable")
    3920                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3921                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3922                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3923                    .dwattr $C$DW$207, DW_AT_decl_line(0xb8)
    3924                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3925            
    3926            $C$DW$208       .dwtag  DW_TAG_member
    3927                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3928                    .dwattr $C$DW$208, DW_AT_name("captureOutputMode")
    3929                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("captureOutputMode")
    3930                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3931                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   78

    3932                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3933                    .dwattr $C$DW$208, DW_AT_decl_line(0xc3)
    3934                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3935            
    3936                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3937                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3938                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3939                    .dwendtag $C$DW$T$35
    3940            
    3941            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3942                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3943                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    3944                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3945                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3946                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3947                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3948            
    3949            
    3950            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3951                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3952                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3953            $C$DW$209       .dwtag  DW_TAG_member
    3954                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3955                    .dwattr $C$DW$209, DW_AT_name("compareRegister")
    3956                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("compareRegister")
    3957                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3958                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3959                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3960                    .dwattr $C$DW$209, DW_AT_decl_line(0x146)
    3961                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3962            
    3963            $C$DW$210       .dwtag  DW_TAG_member
    3964                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3965                    .dwattr $C$DW$210, DW_AT_name("compareInterruptEnable")
    3966                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("compareInterruptEnable")
    3967                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3968                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3969                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3970                    .dwattr $C$DW$210, DW_AT_decl_line(0x14b)
    3971                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3972            
    3973            $C$DW$211       .dwtag  DW_TAG_member
    3974                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3975                    .dwattr $C$DW$211, DW_AT_name("compareOutputMode")
    3976                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("compareOutputMode")
    3977                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3978                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3979                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3980                    .dwattr $C$DW$211, DW_AT_decl_line(0x156)
    3981                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    3982            
    3983            $C$DW$212       .dwtag  DW_TAG_member
    3984                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    3985                    .dwattr $C$DW$212, DW_AT_name("compareValue")
    3986                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("compareValue")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   79

    3987                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3988                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3989                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3990                    .dwattr $C$DW$212, DW_AT_decl_line(0x158)
    3991                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3992            
    3993                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3994                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3995                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3996                    .dwendtag $C$DW$T$36
    3997            
    3998            $C$DW$T$70      .dwtag  DW_TAG_typedef
    3999                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4000                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    4001                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4002                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4003                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4004                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4005            
    4006            
    4007            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4008                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4009                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4010            $C$DW$213       .dwtag  DW_TAG_member
    4011                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    4012                    .dwattr $C$DW$213, DW_AT_name("clockSource")
    4013                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("clockSource")
    4014                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4015                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4016                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4017                    .dwattr $C$DW$213, DW_AT_decl_line(0xd3)
    4018                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    4019            
    4020            $C$DW$214       .dwtag  DW_TAG_member
    4021                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    4022                    .dwattr $C$DW$214, DW_AT_name("clockSourceDivider")
    4023                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("clockSourceDivider")
    4024                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4025                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4026                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4027                    .dwattr $C$DW$214, DW_AT_decl_line(0xea)
    4028                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    4029            
    4030            $C$DW$215       .dwtag  DW_TAG_member
    4031                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    4032                    .dwattr $C$DW$215, DW_AT_name("timerInterruptEnable_TBIE")
    4033                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4034                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4035                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4036                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4037                    .dwattr $C$DW$215, DW_AT_decl_line(0xef)
    4038                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    4039            
    4040            $C$DW$216       .dwtag  DW_TAG_member
    4041                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   80

    4042                    .dwattr $C$DW$216, DW_AT_name("timerClear")
    4043                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("timerClear")
    4044                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4045                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4046                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4047                    .dwattr $C$DW$216, DW_AT_decl_line(0xf5)
    4048                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    4049            
    4050            $C$DW$217       .dwtag  DW_TAG_member
    4051                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$30)
    4052                    .dwattr $C$DW$217, DW_AT_name("startTimer")
    4053                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("startTimer")
    4054                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4055                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4056                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4057                    .dwattr $C$DW$217, DW_AT_decl_line(0xf7)
    4058                    .dwattr $C$DW$217, DW_AT_decl_column(0x0a)
    4059            
    4060                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4061                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4062                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4063                    .dwendtag $C$DW$T$37
    4064            
    4065            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4066                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4067                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4068                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4069                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4070                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4071                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4072            
    4073            
    4074            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4075                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4076                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4077            $C$DW$218       .dwtag  DW_TAG_member
    4078                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    4079                    .dwattr $C$DW$218, DW_AT_name("clockSource")
    4080                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("clockSource")
    4081                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4082                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4083                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4084                    .dwattr $C$DW$218, DW_AT_decl_line(0x107)
    4085                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    4086            
    4087            $C$DW$219       .dwtag  DW_TAG_member
    4088                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    4089                    .dwattr $C$DW$219, DW_AT_name("clockSourceDivider")
    4090                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("clockSourceDivider")
    4091                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4092                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4093                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4094                    .dwattr $C$DW$219, DW_AT_decl_line(0x11e)
    4095                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    4096            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   81

    4097            $C$DW$220       .dwtag  DW_TAG_member
    4098                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    4099                    .dwattr $C$DW$220, DW_AT_name("timerPeriod")
    4100                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("timerPeriod")
    4101                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4102                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4103                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4104                    .dwattr $C$DW$220, DW_AT_decl_line(0x120)
    4105                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    4106            
    4107            $C$DW$221       .dwtag  DW_TAG_member
    4108                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    4109                    .dwattr $C$DW$221, DW_AT_name("timerInterruptEnable_TBIE")
    4110                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4111                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4112                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4113                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4114                    .dwattr $C$DW$221, DW_AT_decl_line(0x125)
    4115                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    4116            
    4117            $C$DW$222       .dwtag  DW_TAG_member
    4118                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    4119                    .dwattr $C$DW$222, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4120                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4121                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4122                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4123                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4124                    .dwattr $C$DW$222, DW_AT_decl_line(0x12a)
    4125                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    4126            
    4127            $C$DW$223       .dwtag  DW_TAG_member
    4128                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    4129                    .dwattr $C$DW$223, DW_AT_name("timerClear")
    4130                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("timerClear")
    4131                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4132                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4133                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4134                    .dwattr $C$DW$223, DW_AT_decl_line(0x130)
    4135                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    4136            
    4137            $C$DW$224       .dwtag  DW_TAG_member
    4138                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$30)
    4139                    .dwattr $C$DW$224, DW_AT_name("startTimer")
    4140                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("startTimer")
    4141                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4142                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4143                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4144                    .dwattr $C$DW$224, DW_AT_decl_line(0x132)
    4145                    .dwattr $C$DW$224, DW_AT_decl_column(0x0a)
    4146            
    4147                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4148                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4149                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4150                    .dwendtag $C$DW$T$38
    4151            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   82

    4152            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4153                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4154                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4155                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4156                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4157                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4158                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4159            
    4160            
    4161            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4162                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4163                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4164            $C$DW$225       .dwtag  DW_TAG_member
    4165                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    4166                    .dwattr $C$DW$225, DW_AT_name("clockSource")
    4167                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("clockSource")
    4168                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4169                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4170                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4171                    .dwattr $C$DW$225, DW_AT_decl_line(0x60)
    4172                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    4173            
    4174            $C$DW$226       .dwtag  DW_TAG_member
    4175                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    4176                    .dwattr $C$DW$226, DW_AT_name("clockSourceDivider")
    4177                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("clockSourceDivider")
    4178                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4179                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4180                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4181                    .dwattr $C$DW$226, DW_AT_decl_line(0x77)
    4182                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    4183            
    4184            $C$DW$227       .dwtag  DW_TAG_member
    4185                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4186                    .dwattr $C$DW$227, DW_AT_name("timerPeriod")
    4187                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("timerPeriod")
    4188                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4189                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4190                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4191                    .dwattr $C$DW$227, DW_AT_decl_line(0x7a)
    4192                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4193            
    4194            $C$DW$228       .dwtag  DW_TAG_member
    4195                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4196                    .dwattr $C$DW$228, DW_AT_name("timerInterruptEnable_TBIE")
    4197                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4198                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4199                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4200                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4201                    .dwattr $C$DW$228, DW_AT_decl_line(0x7f)
    4202                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4203            
    4204            $C$DW$229       .dwtag  DW_TAG_member
    4205                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4206                    .dwattr $C$DW$229, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   83

    4207                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4208                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4209                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4210                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4211                    .dwattr $C$DW$229, DW_AT_decl_line(0x84)
    4212                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4213            
    4214            $C$DW$230       .dwtag  DW_TAG_member
    4215                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    4216                    .dwattr $C$DW$230, DW_AT_name("timerClear")
    4217                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("timerClear")
    4218                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4219                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4220                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4221                    .dwattr $C$DW$230, DW_AT_decl_line(0x8a)
    4222                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4223            
    4224            $C$DW$231       .dwtag  DW_TAG_member
    4225                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$30)
    4226                    .dwattr $C$DW$231, DW_AT_name("startTimer")
    4227                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("startTimer")
    4228                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4229                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4230                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4231                    .dwattr $C$DW$231, DW_AT_decl_line(0x8c)
    4232                    .dwattr $C$DW$231, DW_AT_decl_column(0x0a)
    4233            
    4234                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4235                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4236                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    4237                    .dwendtag $C$DW$T$39
    4238            
    4239            $C$DW$T$73      .dwtag  DW_TAG_typedef
    4240                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    4241                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    4242                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4243                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4244                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    4245                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4246            
    4247            
    4248            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4249                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    4250                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4251            $C$DW$232       .dwtag  DW_TAG_member
    4252                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    4253                    .dwattr $C$DW$232, DW_AT_name("clockSource")
    4254                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("clockSource")
    4255                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4256                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4257                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4258                    .dwattr $C$DW$232, DW_AT_decl_line(0x20)
    4259                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    4260            
    4261            $C$DW$233       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   84

    4262                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    4263                    .dwattr $C$DW$233, DW_AT_name("clockSourceDivider")
    4264                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("clockSourceDivider")
    4265                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4266                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4267                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4268                    .dwattr $C$DW$233, DW_AT_decl_line(0x37)
    4269                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4270            
    4271            $C$DW$234       .dwtag  DW_TAG_member
    4272                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4273                    .dwattr $C$DW$234, DW_AT_name("timerPeriod")
    4274                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("timerPeriod")
    4275                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4276                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4277                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4278                    .dwattr $C$DW$234, DW_AT_decl_line(0x39)
    4279                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4280            
    4281            $C$DW$235       .dwtag  DW_TAG_member
    4282                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    4283                    .dwattr $C$DW$235, DW_AT_name("compareRegister")
    4284                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("compareRegister")
    4285                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4286                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4287                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4288                    .dwattr $C$DW$235, DW_AT_decl_line(0x44)
    4289                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    4290            
    4291            $C$DW$236       .dwtag  DW_TAG_member
    4292                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4293                    .dwattr $C$DW$236, DW_AT_name("compareOutputMode")
    4294                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("compareOutputMode")
    4295                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4296                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4297                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4298                    .dwattr $C$DW$236, DW_AT_decl_line(0x4f)
    4299                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4300            
    4301            $C$DW$237       .dwtag  DW_TAG_member
    4302                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    4303                    .dwattr $C$DW$237, DW_AT_name("dutyCycle")
    4304                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("dutyCycle")
    4305                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4306                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4307                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4308                    .dwattr $C$DW$237, DW_AT_decl_line(0x51)
    4309                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    4310            
    4311                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4312                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    4313                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4314                    .dwendtag $C$DW$T$40
    4315            
    4316            $C$DW$T$74      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   85

    4317                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    4318                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    4319                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4320                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4321                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    4322                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4323            
    4324            
    4325            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4326                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4327                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4328            $C$DW$238       .dwtag  DW_TAG_member
    4329                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$24)
    4330                    .dwattr $C$DW$238, DW_AT_name("selectClockSource")
    4331                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("selectClockSource")
    4332                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4333                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4334                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4335                    .dwattr $C$DW$238, DW_AT_decl_line(0x1c)
    4336                    .dwattr $C$DW$238, DW_AT_decl_column(0x0d)
    4337            
    4338            $C$DW$239       .dwtag  DW_TAG_member
    4339                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4340                    .dwattr $C$DW$239, DW_AT_name("clockPrescalar")
    4341                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("clockPrescalar")
    4342                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4343                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4344                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4345                    .dwattr $C$DW$239, DW_AT_decl_line(0x1e)
    4346                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    4347            
    4348            $C$DW$240       .dwtag  DW_TAG_member
    4349                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$24)
    4350                    .dwattr $C$DW$240, DW_AT_name("firstModReg")
    4351                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("firstModReg")
    4352                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4353                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4354                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4355                    .dwattr $C$DW$240, DW_AT_decl_line(0x22)
    4356                    .dwattr $C$DW$240, DW_AT_decl_column(0x0d)
    4357            
    4358            $C$DW$241       .dwtag  DW_TAG_member
    4359                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$24)
    4360                    .dwattr $C$DW$241, DW_AT_name("secondModReg")
    4361                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("secondModReg")
    4362                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4363                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4364                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4365                    .dwattr $C$DW$241, DW_AT_decl_line(0x26)
    4366                    .dwattr $C$DW$241, DW_AT_decl_column(0x0d)
    4367            
    4368            $C$DW$242       .dwtag  DW_TAG_member
    4369                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$24)
    4370                    .dwattr $C$DW$242, DW_AT_name("parity")
    4371                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("parity")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   86

    4372                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4373                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4374                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4375                    .dwattr $C$DW$242, DW_AT_decl_line(0x2c)
    4376                    .dwattr $C$DW$242, DW_AT_decl_column(0x0d)
    4377            
    4378            $C$DW$243       .dwtag  DW_TAG_member
    4379                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$24)
    4380                    .dwattr $C$DW$243, DW_AT_name("msborLsbFirst")
    4381                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("msborLsbFirst")
    4382                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4383                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4384                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4385                    .dwattr $C$DW$243, DW_AT_decl_line(0x31)
    4386                    .dwattr $C$DW$243, DW_AT_decl_column(0x0d)
    4387            
    4388            $C$DW$244       .dwtag  DW_TAG_member
    4389                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$24)
    4390                    .dwattr $C$DW$244, DW_AT_name("numberofStopBits")
    4391                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("numberofStopBits")
    4392                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4393                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4394                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4395                    .dwattr $C$DW$244, DW_AT_decl_line(0x36)
    4396                    .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    4397            
    4398            $C$DW$245       .dwtag  DW_TAG_member
    4399                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$24)
    4400                    .dwattr $C$DW$245, DW_AT_name("uartMode")
    4401                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("uartMode")
    4402                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4403                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4404                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4405                    .dwattr $C$DW$245, DW_AT_decl_line(0x3d)
    4406                    .dwattr $C$DW$245, DW_AT_decl_column(0x0d)
    4407            
    4408            $C$DW$246       .dwtag  DW_TAG_member
    4409                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$24)
    4410                    .dwattr $C$DW$246, DW_AT_name("overSampling")
    4411                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("overSampling")
    4412                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4413                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4414                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4415                    .dwattr $C$DW$246, DW_AT_decl_line(0x42)
    4416                    .dwattr $C$DW$246, DW_AT_decl_column(0x0d)
    4417            
    4418                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4419                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4420                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4421                    .dwendtag $C$DW$T$41
    4422            
    4423            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4424                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4425                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4426                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   87

    4427                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4428                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4429                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4430            
    4431            
    4432            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4433                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4434                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4435            $C$DW$247       .dwtag  DW_TAG_member
    4436                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$43)
    4437                    .dwattr $C$DW$247, DW_AT_name("clockSourceFrequency")
    4438                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("clockSourceFrequency")
    4439                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4440                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4441                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4442                    .dwattr $C$DW$247, DW_AT_decl_line(0x31)
    4443                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4444            
    4445            $C$DW$248       .dwtag  DW_TAG_member
    4446                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$43)
    4447                    .dwattr $C$DW$248, DW_AT_name("desiredSpiClock")
    4448                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("desiredSpiClock")
    4449                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4450                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4451                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4452                    .dwattr $C$DW$248, DW_AT_decl_line(0x33)
    4453                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4454            
    4455                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4456                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4457                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4458                    .dwendtag $C$DW$T$44
    4459            
    4460            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4461                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4462                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4463                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4464                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4465                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4466                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4467            
    4468            
    4469            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4470                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4471                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4472            $C$DW$249       .dwtag  DW_TAG_member
    4473                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$24)
    4474                    .dwattr $C$DW$249, DW_AT_name("selectClockSource")
    4475                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("selectClockSource")
    4476                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4477                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4478                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4479                    .dwattr $C$DW$249, DW_AT_decl_line(0x14)
    4480                    .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    4481            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
emergencycheck.asm                                                   PAGE   88

    4482            $C$DW$250       .dwtag  DW_TAG_member
    4483                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$43)
    4484                    .dwattr $C$DW$250, DW_AT_name("clockSourceFrequency")
    4485                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("clockSourceFrequency")
    4486                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4487                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4488                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4489                    .dwattr $C$DW$250, DW_AT_decl_line(0x16)
    4490                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4491            
    4492            $C$DW$251       .dwtag  DW_TAG_member
    4493                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$43)
    4494                    .dwattr $C$DW$251, DW_AT_name("desiredSpiClock")
    4495                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("desiredSpiClock")
    4496                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4497                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4498                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4499                    .dwattr $C$DW$251, DW_AT_decl_line(0x18)
    4500                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4501            
    4502            $C$DW$252       .dwtag  DW_TAG_member
    4503                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    4504                    .dwattr $C$DW$252, DW_AT_name("msbFirst")
    4505                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("msbFirst")
    4506                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4507                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4508                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4509                    .dwattr $C$DW$252, DW_AT_decl_line(0x1d)
    4510                    .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
