MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:57 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Fans.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PAIN_H")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PAIN_H")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$88)

    3729                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3730                    .dwattr $C$DW$190, DW_AT_decl_line(0x76)
    3731                    .dwattr $C$DW$190, DW_AT_decl_column(0x05)
    3732            
    3733            $C$DW$191       .dwtag  DW_TAG_enumerator
    3734                    .dwattr $C$DW$191, DW_AT_name("ack")
    3735                    .dwattr $C$DW$191, DW_AT_const_value(0x07)
    3736                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3737                    .dwattr $C$DW$191, DW_AT_decl_line(0x77)
    3738                    .dwattr $C$DW$191, DW_AT_decl_column(0x05)
    3739            
    3740            $C$DW$192       .dwtag  DW_TAG_enumerator
    3741                    .dwattr $C$DW$192, DW_AT_name("var")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   75

    3742                    .dwattr $C$DW$192, DW_AT_const_value(0x08)
    3743                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3744                    .dwattr $C$DW$192, DW_AT_decl_line(0x78)
    3745                    .dwattr $C$DW$192, DW_AT_decl_column(0x05)
    3746            
    3747            $C$DW$193       .dwtag  DW_TAG_enumerator
    3748                    .dwattr $C$DW$193, DW_AT_name("UGmsg")
    3749                    .dwattr $C$DW$193, DW_AT_const_value(0x09)
    3750                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3751                    .dwattr $C$DW$193, DW_AT_decl_line(0x79)
    3752                    .dwattr $C$DW$193, DW_AT_decl_column(0x05)
    3753            
    3754                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3755                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    3756                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    3757                    .dwendtag $C$DW$T$57
    3758            
    3759            $C$DW$T$58      .dwtag  DW_TAG_typedef
    3760                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    3761                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3762                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3763                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3764                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    3765                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3766            
    3767            
    3768            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3769                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3770            $C$DW$194       .dwtag  DW_TAG_enumerator
    3771                    .dwattr $C$DW$194, DW_AT_name("init")
    3772                    .dwattr $C$DW$194, DW_AT_const_value(0x00)
    3773                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3774                    .dwattr $C$DW$194, DW_AT_decl_line(0x80)
    3775                    .dwattr $C$DW$194, DW_AT_decl_column(0x05)
    3776            
    3777            $C$DW$195       .dwtag  DW_TAG_enumerator
    3778                    .dwattr $C$DW$195, DW_AT_name("running")
    3779                    .dwattr $C$DW$195, DW_AT_const_value(0x01)
    3780                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3781                    .dwattr $C$DW$195, DW_AT_decl_line(0x80)
    3782                    .dwattr $C$DW$195, DW_AT_decl_column(0x0b)
    3783            
    3784            $C$DW$196       .dwtag  DW_TAG_enumerator
    3785                    .dwattr $C$DW$196, DW_AT_name("wait")
    3786                    .dwattr $C$DW$196, DW_AT_const_value(0x02)
    3787                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3788                    .dwattr $C$DW$196, DW_AT_decl_line(0x80)
    3789                    .dwattr $C$DW$196, DW_AT_decl_column(0x14)
    3790            
    3791                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3792                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    3793                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3794                    .dwendtag $C$DW$T$59
    3795            
    3796            $C$DW$T$60      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   76

    3797                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    3798                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3799                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3800                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3801                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    3802                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3803            
    3804            
    3805            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3806                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3807            $C$DW$197       .dwtag  DW_TAG_member
    3808                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$14)
    3809                    .dwattr $C$DW$197, DW_AT_name("__max_align1")
    3810                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("__max_align1")
    3811                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3812                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3813                    .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3814                    .dwattr $C$DW$197, DW_AT_decl_line(0x7b)
    3815                    .dwattr $C$DW$197, DW_AT_decl_column(0x0c)
    3816            
    3817            $C$DW$198       .dwtag  DW_TAG_member
    3818                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$18)
    3819                    .dwattr $C$DW$198, DW_AT_name("__max_align2")
    3820                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("__max_align2")
    3821                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3822                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3823                    .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3824                    .dwattr $C$DW$198, DW_AT_decl_line(0x7c)
    3825                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3826            
    3827                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3828                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3829                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3830                    .dwendtag $C$DW$T$22
    3831            
    3832            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3833                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3834                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3835                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3836                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3837                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3838                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3839            
    3840            
    3841            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3842                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3843                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    3844            $C$DW$199       .dwtag  DW_TAG_member
    3845                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$24)
    3846                    .dwattr $C$DW$199, DW_AT_name("memoryBufferControlIndex")
    3847                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3848                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3849                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3850                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3851                    .dwattr $C$DW$199, DW_AT_decl_line(0x27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   77

    3852                    .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    3853            
    3854            $C$DW$200       .dwtag  DW_TAG_member
    3855                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$24)
    3856                    .dwattr $C$DW$200, DW_AT_name("inputSourceSelect")
    3857                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("inputSourceSelect")
    3858                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3859                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3860                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3861                    .dwattr $C$DW$200, DW_AT_decl_line(0x3b)
    3862                    .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    3863            
    3864            $C$DW$201       .dwtag  DW_TAG_member
    3865                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$24)
    3866                    .dwattr $C$DW$201, DW_AT_name("positiveRefVoltageSourceSelect")
    3867                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3868                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3869                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3870                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3871                    .dwattr $C$DW$201, DW_AT_decl_line(0x42)
    3872                    .dwattr $C$DW$201, DW_AT_decl_column(0x0d)
    3873            
    3874            $C$DW$202       .dwtag  DW_TAG_member
    3875                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$24)
    3876                    .dwattr $C$DW$202, DW_AT_name("negativeRefVoltageSourceSelect")
    3877                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3878                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3879                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3880                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3881                    .dwattr $C$DW$202, DW_AT_decl_line(0x48)
    3882                    .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    3883            
    3884            $C$DW$203       .dwtag  DW_TAG_member
    3885                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$24)
    3886                    .dwattr $C$DW$203, DW_AT_name("endOfSequence")
    3887                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("endOfSequence")
    3888                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3889                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3890                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3891                    .dwattr $C$DW$203, DW_AT_decl_line(0x51)
    3892                    .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    3893            
    3894                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3895                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3896                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3897                    .dwendtag $C$DW$T$25
    3898            
    3899            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3900                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3901                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3902                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3903                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3904                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3905                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3906            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   78

    3907            
    3908            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3909                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3910                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3911            $C$DW$204       .dwtag  DW_TAG_member
    3912                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3913                    .dwattr $C$DW$204, DW_AT_name("captureRegister")
    3914                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("captureRegister")
    3915                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3916                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3917                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3918                    .dwattr $C$DW$204, DW_AT_decl_line(0x58)
    3919                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3920            
    3921            $C$DW$205       .dwtag  DW_TAG_member
    3922                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3923                    .dwattr $C$DW$205, DW_AT_name("captureMode")
    3924                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("captureMode")
    3925                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3926                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3927                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3928                    .dwattr $C$DW$205, DW_AT_decl_line(0x5f)
    3929                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3930            
    3931            $C$DW$206       .dwtag  DW_TAG_member
    3932                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3933                    .dwattr $C$DW$206, DW_AT_name("captureInputSelect")
    3934                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("captureInputSelect")
    3935                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3936                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3937                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3938                    .dwattr $C$DW$206, DW_AT_decl_line(0x66)
    3939                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    3940            
    3941            $C$DW$207       .dwtag  DW_TAG_member
    3942                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3943                    .dwattr $C$DW$207, DW_AT_name("synchronizeCaptureSource")
    3944                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3945                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3946                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3947                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3948                    .dwattr $C$DW$207, DW_AT_decl_line(0x6b)
    3949                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3950            
    3951            $C$DW$208       .dwtag  DW_TAG_member
    3952                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3953                    .dwattr $C$DW$208, DW_AT_name("captureInterruptEnable")
    3954                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("captureInterruptEnable")
    3955                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3956                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3957                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3958                    .dwattr $C$DW$208, DW_AT_decl_line(0x70)
    3959                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3960            
    3961            $C$DW$209       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   79

    3962                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3963                    .dwattr $C$DW$209, DW_AT_name("captureOutputMode")
    3964                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("captureOutputMode")
    3965                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3966                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3967                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3968                    .dwattr $C$DW$209, DW_AT_decl_line(0x7b)
    3969                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3970            
    3971                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3972                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3973                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3974                    .dwendtag $C$DW$T$28
    3975            
    3976            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3977                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3978                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3979                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3980                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3981                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3982                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3983            
    3984            
    3985            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3986                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3987                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3988            $C$DW$210       .dwtag  DW_TAG_member
    3989                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3990                    .dwattr $C$DW$210, DW_AT_name("compareRegister")
    3991                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("compareRegister")
    3992                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3993                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3994                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3995                    .dwattr $C$DW$210, DW_AT_decl_line(0x145)
    3996                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3997            
    3998            $C$DW$211       .dwtag  DW_TAG_member
    3999                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    4000                    .dwattr $C$DW$211, DW_AT_name("compareInterruptEnable")
    4001                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("compareInterruptEnable")
    4002                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4003                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4004                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4005                    .dwattr $C$DW$211, DW_AT_decl_line(0x14a)
    4006                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    4007            
    4008            $C$DW$212       .dwtag  DW_TAG_member
    4009                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    4010                    .dwattr $C$DW$212, DW_AT_name("compareOutputMode")
    4011                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("compareOutputMode")
    4012                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4013                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4014                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4015                    .dwattr $C$DW$212, DW_AT_decl_line(0x155)
    4016                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   80

    4017            
    4018            $C$DW$213       .dwtag  DW_TAG_member
    4019                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    4020                    .dwattr $C$DW$213, DW_AT_name("compareValue")
    4021                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("compareValue")
    4022                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4023                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4024                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4025                    .dwattr $C$DW$213, DW_AT_decl_line(0x157)
    4026                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    4027            
    4028                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4029                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4030                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4031                    .dwendtag $C$DW$T$29
    4032            
    4033            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4034                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4035                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4036                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4037                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4038                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4039                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    4040            
    4041            
    4042            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4043                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    4044                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4045            $C$DW$214       .dwtag  DW_TAG_member
    4046                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    4047                    .dwattr $C$DW$214, DW_AT_name("clockSource")
    4048                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("clockSource")
    4049                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4050                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4051                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4052                    .dwattr $C$DW$214, DW_AT_decl_line(0x20)
    4053                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    4054            
    4055            $C$DW$215       .dwtag  DW_TAG_member
    4056                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    4057                    .dwattr $C$DW$215, DW_AT_name("clockSourceDivider")
    4058                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("clockSourceDivider")
    4059                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4060                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4061                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4062                    .dwattr $C$DW$215, DW_AT_decl_line(0x37)
    4063                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    4064            
    4065            $C$DW$216       .dwtag  DW_TAG_member
    4066                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    4067                    .dwattr $C$DW$216, DW_AT_name("timerInterruptEnable_TAIE")
    4068                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4069                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4070                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4071                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   81

    4072                    .dwattr $C$DW$216, DW_AT_decl_line(0x3c)
    4073                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    4074            
    4075            $C$DW$217       .dwtag  DW_TAG_member
    4076                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    4077                    .dwattr $C$DW$217, DW_AT_name("timerClear")
    4078                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("timerClear")
    4079                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4080                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4081                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4082                    .dwattr $C$DW$217, DW_AT_decl_line(0x42)
    4083                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    4084            
    4085            $C$DW$218       .dwtag  DW_TAG_member
    4086                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$30)
    4087                    .dwattr $C$DW$218, DW_AT_name("startTimer")
    4088                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("startTimer")
    4089                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4090                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4091                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4092                    .dwattr $C$DW$218, DW_AT_decl_line(0x44)
    4093                    .dwattr $C$DW$218, DW_AT_decl_column(0x0a)
    4094            
    4095                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4096                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    4097                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4098                    .dwendtag $C$DW$T$31
    4099            
    4100            $C$DW$T$65      .dwtag  DW_TAG_typedef
    4101                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    4102                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    4103                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4104                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4105                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    4106                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4107            
    4108            
    4109            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4110                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    4111                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    4112            $C$DW$219       .dwtag  DW_TAG_member
    4113                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    4114                    .dwattr $C$DW$219, DW_AT_name("clockSource")
    4115                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("clockSource")
    4116                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4117                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4118                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4119                    .dwattr $C$DW$219, DW_AT_decl_line(0x8b)
    4120                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    4121            
    4122            $C$DW$220       .dwtag  DW_TAG_member
    4123                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    4124                    .dwattr $C$DW$220, DW_AT_name("clockSourceDivider")
    4125                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("clockSourceDivider")
    4126                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   82

    4127                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4128                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4129                    .dwattr $C$DW$220, DW_AT_decl_line(0xa2)
    4130                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    4131            
    4132            $C$DW$221       .dwtag  DW_TAG_member
    4133                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    4134                    .dwattr $C$DW$221, DW_AT_name("timerPeriod")
    4135                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("timerPeriod")
    4136                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4137                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4138                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4139                    .dwattr $C$DW$221, DW_AT_decl_line(0xa4)
    4140                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    4141            
    4142            $C$DW$222       .dwtag  DW_TAG_member
    4143                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    4144                    .dwattr $C$DW$222, DW_AT_name("timerInterruptEnable_TAIE")
    4145                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4146                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4147                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4148                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4149                    .dwattr $C$DW$222, DW_AT_decl_line(0xa9)
    4150                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    4151            
    4152            $C$DW$223       .dwtag  DW_TAG_member
    4153                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    4154                    .dwattr $C$DW$223, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4155                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4156                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4157                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4158                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4159                    .dwattr $C$DW$223, DW_AT_decl_line(0xae)
    4160                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    4161            
    4162            $C$DW$224       .dwtag  DW_TAG_member
    4163                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    4164                    .dwattr $C$DW$224, DW_AT_name("timerClear")
    4165                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("timerClear")
    4166                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4167                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4168                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4169                    .dwattr $C$DW$224, DW_AT_decl_line(0xb4)
    4170                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    4171            
    4172            $C$DW$225       .dwtag  DW_TAG_member
    4173                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$30)
    4174                    .dwattr $C$DW$225, DW_AT_name("startTimer")
    4175                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("startTimer")
    4176                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4177                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4178                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4179                    .dwattr $C$DW$225, DW_AT_decl_line(0xb6)
    4180                    .dwattr $C$DW$225, DW_AT_decl_column(0x0a)
    4181            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   83

    4182                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4183                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    4184                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4185                    .dwendtag $C$DW$T$32
    4186            
    4187            $C$DW$T$66      .dwtag  DW_TAG_typedef
    4188                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    4189                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    4190                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4191                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4192                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    4193                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    4194            
    4195            
    4196            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4197                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    4198                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    4199            $C$DW$226       .dwtag  DW_TAG_member
    4200                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    4201                    .dwattr $C$DW$226, DW_AT_name("clockSource")
    4202                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("clockSource")
    4203                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4204                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4205                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4206                    .dwattr $C$DW$226, DW_AT_decl_line(0x105)
    4207                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    4208            
    4209            $C$DW$227       .dwtag  DW_TAG_member
    4210                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4211                    .dwattr $C$DW$227, DW_AT_name("clockSourceDivider")
    4212                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("clockSourceDivider")
    4213                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4214                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4215                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4216                    .dwattr $C$DW$227, DW_AT_decl_line(0x11c)
    4217                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4218            
    4219            $C$DW$228       .dwtag  DW_TAG_member
    4220                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4221                    .dwattr $C$DW$228, DW_AT_name("timerPeriod")
    4222                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("timerPeriod")
    4223                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4224                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4225                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4226                    .dwattr $C$DW$228, DW_AT_decl_line(0x11f)
    4227                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4228            
    4229            $C$DW$229       .dwtag  DW_TAG_member
    4230                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4231                    .dwattr $C$DW$229, DW_AT_name("timerInterruptEnable_TAIE")
    4232                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4233                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4234                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4235                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4236                    .dwattr $C$DW$229, DW_AT_decl_line(0x124)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   84

    4237                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4238            
    4239            $C$DW$230       .dwtag  DW_TAG_member
    4240                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    4241                    .dwattr $C$DW$230, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4242                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4243                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4244                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4245                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4246                    .dwattr $C$DW$230, DW_AT_decl_line(0x129)
    4247                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4248            
    4249            $C$DW$231       .dwtag  DW_TAG_member
    4250                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    4251                    .dwattr $C$DW$231, DW_AT_name("timerClear")
    4252                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("timerClear")
    4253                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4254                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4255                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4256                    .dwattr $C$DW$231, DW_AT_decl_line(0x12f)
    4257                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4258            
    4259            $C$DW$232       .dwtag  DW_TAG_member
    4260                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$30)
    4261                    .dwattr $C$DW$232, DW_AT_name("startTimer")
    4262                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("startTimer")
    4263                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4264                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4265                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4266                    .dwattr $C$DW$232, DW_AT_decl_line(0x131)
    4267                    .dwattr $C$DW$232, DW_AT_decl_column(0x0a)
    4268            
    4269                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4270                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    4271                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4272                    .dwendtag $C$DW$T$33
    4273            
    4274            $C$DW$T$67      .dwtag  DW_TAG_typedef
    4275                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    4276                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    4277                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4278                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4279                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    4280                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    4281            
    4282            
    4283            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4284                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    4285                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    4286            $C$DW$233       .dwtag  DW_TAG_member
    4287                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    4288                    .dwattr $C$DW$233, DW_AT_name("clockSource")
    4289                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("clockSource")
    4290                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4291                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   85

    4292                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4293                    .dwattr $C$DW$233, DW_AT_decl_line(0xc5)
    4294                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4295            
    4296            $C$DW$234       .dwtag  DW_TAG_member
    4297                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4298                    .dwattr $C$DW$234, DW_AT_name("clockSourceDivider")
    4299                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("clockSourceDivider")
    4300                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4301                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4302                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4303                    .dwattr $C$DW$234, DW_AT_decl_line(0xdc)
    4304                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4305            
    4306            $C$DW$235       .dwtag  DW_TAG_member
    4307                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    4308                    .dwattr $C$DW$235, DW_AT_name("timerPeriod")
    4309                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("timerPeriod")
    4310                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4311                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4312                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4313                    .dwattr $C$DW$235, DW_AT_decl_line(0xde)
    4314                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    4315            
    4316            $C$DW$236       .dwtag  DW_TAG_member
    4317                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4318                    .dwattr $C$DW$236, DW_AT_name("compareRegister")
    4319                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("compareRegister")
    4320                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4321                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4322                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4323                    .dwattr $C$DW$236, DW_AT_decl_line(0xe9)
    4324                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4325            
    4326            $C$DW$237       .dwtag  DW_TAG_member
    4327                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    4328                    .dwattr $C$DW$237, DW_AT_name("compareOutputMode")
    4329                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("compareOutputMode")
    4330                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4331                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4332                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4333                    .dwattr $C$DW$237, DW_AT_decl_line(0xf4)
    4334                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    4335            
    4336            $C$DW$238       .dwtag  DW_TAG_member
    4337                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    4338                    .dwattr $C$DW$238, DW_AT_name("dutyCycle")
    4339                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("dutyCycle")
    4340                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4341                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4342                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4343                    .dwattr $C$DW$238, DW_AT_decl_line(0xf6)
    4344                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    4345            
    4346                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   86

    4347                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    4348                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4349                    .dwendtag $C$DW$T$34
    4350            
    4351            $C$DW$T$68      .dwtag  DW_TAG_typedef
    4352                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    4353                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    4354                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4355                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4356                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    4357                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    4358            
    4359            
    4360            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4361                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    4362                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    4363            $C$DW$239       .dwtag  DW_TAG_member
    4364                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4365                    .dwattr $C$DW$239, DW_AT_name("captureRegister")
    4366                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("captureRegister")
    4367                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4368                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4369                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4370                    .dwattr $C$DW$239, DW_AT_decl_line(0xa0)
    4371                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    4372            
    4373            $C$DW$240       .dwtag  DW_TAG_member
    4374                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    4375                    .dwattr $C$DW$240, DW_AT_name("captureMode")
    4376                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("captureMode")
    4377                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4378                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4379                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4380                    .dwattr $C$DW$240, DW_AT_decl_line(0xa7)
    4381                    .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    4382            
    4383            $C$DW$241       .dwtag  DW_TAG_member
    4384                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    4385                    .dwattr $C$DW$241, DW_AT_name("captureInputSelect")
    4386                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("captureInputSelect")
    4387                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4388                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4389                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4390                    .dwattr $C$DW$241, DW_AT_decl_line(0xae)
    4391                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4392            
    4393            $C$DW$242       .dwtag  DW_TAG_member
    4394                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$27)
    4395                    .dwattr $C$DW$242, DW_AT_name("synchronizeCaptureSource")
    4396                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4397                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4398                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4399                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4400                    .dwattr $C$DW$242, DW_AT_decl_line(0xb3)
    4401                    .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   87

    4402            
    4403            $C$DW$243       .dwtag  DW_TAG_member
    4404                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    4405                    .dwattr $C$DW$243, DW_AT_name("captureInterruptEnable")
    4406                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("captureInterruptEnable")
    4407                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4408                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4409                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4410                    .dwattr $C$DW$243, DW_AT_decl_line(0xb8)
    4411                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    4412            
    4413            $C$DW$244       .dwtag  DW_TAG_member
    4414                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    4415                    .dwattr $C$DW$244, DW_AT_name("captureOutputMode")
    4416                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("captureOutputMode")
    4417                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4418                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4419                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4420                    .dwattr $C$DW$244, DW_AT_decl_line(0xc3)
    4421                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    4422            
    4423                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4424                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    4425                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4426                    .dwendtag $C$DW$T$35
    4427            
    4428            $C$DW$T$69      .dwtag  DW_TAG_typedef
    4429                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4430                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4431                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4432                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4433                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4434                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4435            
    4436            
    4437            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4438                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4439                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4440            $C$DW$245       .dwtag  DW_TAG_member
    4441                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    4442                    .dwattr $C$DW$245, DW_AT_name("compareRegister")
    4443                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("compareRegister")
    4444                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4445                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4446                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4447                    .dwattr $C$DW$245, DW_AT_decl_line(0x146)
    4448                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    4449            
    4450            $C$DW$246       .dwtag  DW_TAG_member
    4451                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    4452                    .dwattr $C$DW$246, DW_AT_name("compareInterruptEnable")
    4453                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("compareInterruptEnable")
    4454                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4455                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4456                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   88

    4457                    .dwattr $C$DW$246, DW_AT_decl_line(0x14b)
    4458                    .dwattr $C$DW$246, DW_AT_decl_column(0x0e)
    4459            
    4460            $C$DW$247       .dwtag  DW_TAG_member
    4461                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    4462                    .dwattr $C$DW$247, DW_AT_name("compareOutputMode")
    4463                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("compareOutputMode")
    4464                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4465                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4466                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4467                    .dwattr $C$DW$247, DW_AT_decl_line(0x156)
    4468                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4469            
    4470            $C$DW$248       .dwtag  DW_TAG_member
    4471                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4472                    .dwattr $C$DW$248, DW_AT_name("compareValue")
    4473                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("compareValue")
    4474                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4475                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4476                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4477                    .dwattr $C$DW$248, DW_AT_decl_line(0x158)
    4478                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4479            
    4480                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4481                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4482                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4483                    .dwendtag $C$DW$T$36
    4484            
    4485            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4486                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4487                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    4488                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4489                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4490                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4491                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4492            
    4493            
    4494            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4495                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4496                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4497            $C$DW$249       .dwtag  DW_TAG_member
    4498                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    4499                    .dwattr $C$DW$249, DW_AT_name("clockSource")
    4500                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("clockSource")
    4501                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4502                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4503                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4504                    .dwattr $C$DW$249, DW_AT_decl_line(0xd3)
    4505                    .dwattr $C$DW$249, DW_AT_decl_column(0x0e)
    4506            
    4507            $C$DW$250       .dwtag  DW_TAG_member
    4508                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    4509                    .dwattr $C$DW$250, DW_AT_name("clockSourceDivider")
    4510                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("clockSourceDivider")
    4511                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   89

    4512                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4513                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4514                    .dwattr $C$DW$250, DW_AT_decl_line(0xea)
    4515                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4516            
    4517            $C$DW$251       .dwtag  DW_TAG_member
    4518                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4519                    .dwattr $C$DW$251, DW_AT_name("timerInterruptEnable_TBIE")
    4520                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4521                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4522                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4523                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4524                    .dwattr $C$DW$251, DW_AT_decl_line(0xef)
    4525                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4526            
    4527            $C$DW$252       .dwtag  DW_TAG_member
    4528                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    4529                    .dwattr $C$DW$252, DW_AT_name("timerClear")
    4530                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("timerClear")
    4531                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4532                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4533                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4534                    .dwattr $C$DW$252, DW_AT_decl_line(0xf5)
    4535                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    4536            
    4537            $C$DW$253       .dwtag  DW_TAG_member
    4538                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$30)
    4539                    .dwattr $C$DW$253, DW_AT_name("startTimer")
    4540                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("startTimer")
    4541                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4542                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4543                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4544                    .dwattr $C$DW$253, DW_AT_decl_line(0xf7)
    4545                    .dwattr $C$DW$253, DW_AT_decl_column(0x0a)
    4546            
    4547                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4548                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4549                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4550                    .dwendtag $C$DW$T$37
    4551            
    4552            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4553                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4554                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4555                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4556                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4557                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4558                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4559            
    4560            
    4561            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4562                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4563                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4564            $C$DW$254       .dwtag  DW_TAG_member
    4565                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4566                    .dwattr $C$DW$254, DW_AT_name("clockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   90

    4567                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("clockSource")
    4568                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4569                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4570                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4571                    .dwattr $C$DW$254, DW_AT_decl_line(0x107)
    4572                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4573            
    4574            $C$DW$255       .dwtag  DW_TAG_member
    4575                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4576                    .dwattr $C$DW$255, DW_AT_name("clockSourceDivider")
    4577                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("clockSourceDivider")
    4578                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4579                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4580                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4581                    .dwattr $C$DW$255, DW_AT_decl_line(0x11e)
    4582                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4583            
    4584            $C$DW$256       .dwtag  DW_TAG_member
    4585                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4586                    .dwattr $C$DW$256, DW_AT_name("timerPeriod")
    4587                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("timerPeriod")
    4588                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4589                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4590                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4591                    .dwattr $C$DW$256, DW_AT_decl_line(0x120)
    4592                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4593            
    4594            $C$DW$257       .dwtag  DW_TAG_member
    4595                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4596                    .dwattr $C$DW$257, DW_AT_name("timerInterruptEnable_TBIE")
    4597                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4598                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4599                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4600                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4601                    .dwattr $C$DW$257, DW_AT_decl_line(0x125)
    4602                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4603            
    4604            $C$DW$258       .dwtag  DW_TAG_member
    4605                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    4606                    .dwattr $C$DW$258, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4607                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4608                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4609                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4610                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4611                    .dwattr $C$DW$258, DW_AT_decl_line(0x12a)
    4612                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    4613            
    4614            $C$DW$259       .dwtag  DW_TAG_member
    4615                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    4616                    .dwattr $C$DW$259, DW_AT_name("timerClear")
    4617                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("timerClear")
    4618                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4619                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4620                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4621                    .dwattr $C$DW$259, DW_AT_decl_line(0x130)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   91

    4622                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4623            
    4624            $C$DW$260       .dwtag  DW_TAG_member
    4625                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$30)
    4626                    .dwattr $C$DW$260, DW_AT_name("startTimer")
    4627                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("startTimer")
    4628                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4629                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4630                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4631                    .dwattr $C$DW$260, DW_AT_decl_line(0x132)
    4632                    .dwattr $C$DW$260, DW_AT_decl_column(0x0a)
    4633            
    4634                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4635                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4636                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4637                    .dwendtag $C$DW$T$38
    4638            
    4639            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4640                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4641                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4642                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4643                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4644                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4645                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4646            
    4647            
    4648            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4649                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4650                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4651            $C$DW$261       .dwtag  DW_TAG_member
    4652                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    4653                    .dwattr $C$DW$261, DW_AT_name("clockSource")
    4654                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("clockSource")
    4655                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4656                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4657                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4658                    .dwattr $C$DW$261, DW_AT_decl_line(0x60)
    4659                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    4660            
    4661            $C$DW$262       .dwtag  DW_TAG_member
    4662                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    4663                    .dwattr $C$DW$262, DW_AT_name("clockSourceDivider")
    4664                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("clockSourceDivider")
    4665                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4666                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4667                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4668                    .dwattr $C$DW$262, DW_AT_decl_line(0x77)
    4669                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    4670            
    4671            $C$DW$263       .dwtag  DW_TAG_member
    4672                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    4673                    .dwattr $C$DW$263, DW_AT_name("timerPeriod")
    4674                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("timerPeriod")
    4675                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4676                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   92

    4677                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4678                    .dwattr $C$DW$263, DW_AT_decl_line(0x7a)
    4679                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    4680            
    4681            $C$DW$264       .dwtag  DW_TAG_member
    4682                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    4683                    .dwattr $C$DW$264, DW_AT_name("timerInterruptEnable_TBIE")
    4684                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4685                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4686                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4687                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4688                    .dwattr $C$DW$264, DW_AT_decl_line(0x7f)
    4689                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    4690            
    4691            $C$DW$265       .dwtag  DW_TAG_member
    4692                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    4693                    .dwattr $C$DW$265, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4694                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4695                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4696                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4697                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4698                    .dwattr $C$DW$265, DW_AT_decl_line(0x84)
    4699                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    4700            
    4701            $C$DW$266       .dwtag  DW_TAG_member
    4702                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    4703                    .dwattr $C$DW$266, DW_AT_name("timerClear")
    4704                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("timerClear")
    4705                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4706                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4707                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4708                    .dwattr $C$DW$266, DW_AT_decl_line(0x8a)
    4709                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    4710            
    4711            $C$DW$267       .dwtag  DW_TAG_member
    4712                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$30)
    4713                    .dwattr $C$DW$267, DW_AT_name("startTimer")
    4714                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("startTimer")
    4715                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4716                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4717                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4718                    .dwattr $C$DW$267, DW_AT_decl_line(0x8c)
    4719                    .dwattr $C$DW$267, DW_AT_decl_column(0x0a)
    4720            
    4721                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4722                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4723                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    4724                    .dwendtag $C$DW$T$39
    4725            
    4726            $C$DW$T$73      .dwtag  DW_TAG_typedef
    4727                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    4728                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    4729                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4730                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4731                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   93

    4732                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4733            
    4734            
    4735            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4736                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    4737                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4738            $C$DW$268       .dwtag  DW_TAG_member
    4739                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    4740                    .dwattr $C$DW$268, DW_AT_name("clockSource")
    4741                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("clockSource")
    4742                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4743                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4744                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4745                    .dwattr $C$DW$268, DW_AT_decl_line(0x20)
    4746                    .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    4747            
    4748            $C$DW$269       .dwtag  DW_TAG_member
    4749                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    4750                    .dwattr $C$DW$269, DW_AT_name("clockSourceDivider")
    4751                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("clockSourceDivider")
    4752                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4753                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4754                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4755                    .dwattr $C$DW$269, DW_AT_decl_line(0x37)
    4756                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    4757            
    4758            $C$DW$270       .dwtag  DW_TAG_member
    4759                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    4760                    .dwattr $C$DW$270, DW_AT_name("timerPeriod")
    4761                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("timerPeriod")
    4762                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4763                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4764                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4765                    .dwattr $C$DW$270, DW_AT_decl_line(0x39)
    4766                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
    4767            
    4768            $C$DW$271       .dwtag  DW_TAG_member
    4769                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    4770                    .dwattr $C$DW$271, DW_AT_name("compareRegister")
    4771                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("compareRegister")
    4772                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4773                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4774                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4775                    .dwattr $C$DW$271, DW_AT_decl_line(0x44)
    4776                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    4777            
    4778            $C$DW$272       .dwtag  DW_TAG_member
    4779                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    4780                    .dwattr $C$DW$272, DW_AT_name("compareOutputMode")
    4781                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("compareOutputMode")
    4782                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4783                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4784                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4785                    .dwattr $C$DW$272, DW_AT_decl_line(0x4f)
    4786                    .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   94

    4787            
    4788            $C$DW$273       .dwtag  DW_TAG_member
    4789                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    4790                    .dwattr $C$DW$273, DW_AT_name("dutyCycle")
    4791                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("dutyCycle")
    4792                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4793                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4794                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4795                    .dwattr $C$DW$273, DW_AT_decl_line(0x51)
    4796                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    4797            
    4798                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4799                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    4800                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4801                    .dwendtag $C$DW$T$40
    4802            
    4803            $C$DW$T$74      .dwtag  DW_TAG_typedef
    4804                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    4805                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    4806                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4807                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4808                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    4809                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4810            
    4811            
    4812            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4813                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4814                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4815            $C$DW$274       .dwtag  DW_TAG_member
    4816                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$24)
    4817                    .dwattr $C$DW$274, DW_AT_name("selectClockSource")
    4818                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("selectClockSource")
    4819                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4820                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4821                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4822                    .dwattr $C$DW$274, DW_AT_decl_line(0x1c)
    4823                    .dwattr $C$DW$274, DW_AT_decl_column(0x0d)
    4824            
    4825            $C$DW$275       .dwtag  DW_TAG_member
    4826                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$27)
    4827                    .dwattr $C$DW$275, DW_AT_name("clockPrescalar")
    4828                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("clockPrescalar")
    4829                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4830                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4831                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4832                    .dwattr $C$DW$275, DW_AT_decl_line(0x1e)
    4833                    .dwattr $C$DW$275, DW_AT_decl_column(0x0e)
    4834            
    4835            $C$DW$276       .dwtag  DW_TAG_member
    4836                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$24)
    4837                    .dwattr $C$DW$276, DW_AT_name("firstModReg")
    4838                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("firstModReg")
    4839                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4840                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4841                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   95

    4842                    .dwattr $C$DW$276, DW_AT_decl_line(0x22)
    4843                    .dwattr $C$DW$276, DW_AT_decl_column(0x0d)
    4844            
    4845            $C$DW$277       .dwtag  DW_TAG_member
    4846                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$24)
    4847                    .dwattr $C$DW$277, DW_AT_name("secondModReg")
    4848                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("secondModReg")
    4849                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4850                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4851                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4852                    .dwattr $C$DW$277, DW_AT_decl_line(0x26)
    4853                    .dwattr $C$DW$277, DW_AT_decl_column(0x0d)
    4854            
    4855            $C$DW$278       .dwtag  DW_TAG_member
    4856                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$24)
    4857                    .dwattr $C$DW$278, DW_AT_name("parity")
    4858                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("parity")
    4859                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4860                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4861                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4862                    .dwattr $C$DW$278, DW_AT_decl_line(0x2c)
    4863                    .dwattr $C$DW$278, DW_AT_decl_column(0x0d)
    4864            
    4865            $C$DW$279       .dwtag  DW_TAG_member
    4866                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$24)
    4867                    .dwattr $C$DW$279, DW_AT_name("msborLsbFirst")
    4868                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("msborLsbFirst")
    4869                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4870                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4871                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4872                    .dwattr $C$DW$279, DW_AT_decl_line(0x31)
    4873                    .dwattr $C$DW$279, DW_AT_decl_column(0x0d)
    4874            
    4875            $C$DW$280       .dwtag  DW_TAG_member
    4876                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$24)
    4877                    .dwattr $C$DW$280, DW_AT_name("numberofStopBits")
    4878                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("numberofStopBits")
    4879                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4880                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4881                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4882                    .dwattr $C$DW$280, DW_AT_decl_line(0x36)
    4883                    .dwattr $C$DW$280, DW_AT_decl_column(0x0d)
    4884            
    4885            $C$DW$281       .dwtag  DW_TAG_member
    4886                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$24)
    4887                    .dwattr $C$DW$281, DW_AT_name("uartMode")
    4888                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("uartMode")
    4889                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4890                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4891                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4892                    .dwattr $C$DW$281, DW_AT_decl_line(0x3d)
    4893                    .dwattr $C$DW$281, DW_AT_decl_column(0x0d)
    4894            
    4895            $C$DW$282       .dwtag  DW_TAG_member
    4896                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$24)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   96

    4897                    .dwattr $C$DW$282, DW_AT_name("overSampling")
    4898                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("overSampling")
    4899                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4900                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4901                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4902                    .dwattr $C$DW$282, DW_AT_decl_line(0x42)
    4903                    .dwattr $C$DW$282, DW_AT_decl_column(0x0d)
    4904            
    4905                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4906                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4907                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4908                    .dwendtag $C$DW$T$41
    4909            
    4910            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4911                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4912                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4913                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4914                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4915                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4916                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4917            
    4918            
    4919            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4920                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4921                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4922            $C$DW$283       .dwtag  DW_TAG_member
    4923                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$43)
    4924                    .dwattr $C$DW$283, DW_AT_name("clockSourceFrequency")
    4925                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("clockSourceFrequency")
    4926                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4927                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4928                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4929                    .dwattr $C$DW$283, DW_AT_decl_line(0x31)
    4930                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    4931            
    4932            $C$DW$284       .dwtag  DW_TAG_member
    4933                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$43)
    4934                    .dwattr $C$DW$284, DW_AT_name("desiredSpiClock")
    4935                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("desiredSpiClock")
    4936                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4937                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4938                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4939                    .dwattr $C$DW$284, DW_AT_decl_line(0x33)
    4940                    .dwattr $C$DW$284, DW_AT_decl_column(0x0e)
    4941            
    4942                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4943                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4944                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4945                    .dwendtag $C$DW$T$44
    4946            
    4947            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4948                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4949                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4950                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4951                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:58 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fans.asm                                                             PAGE   97

    4952                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4953                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4954            
    4955            
    4956            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4957                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4958                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4959            $C$DW$285       .dwtag  DW_TAG_member
    4960                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$24)
    4961                    .dwattr $C$DW$285, DW_AT_name("selectClockSource")
    4962                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("selectClockSource")
    4963                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4964                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4965                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4966                    .dwattr $C$DW$285, DW_AT_decl_line(0x14)
    4967                    .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    4968            
    4969            $C$DW$286       .dwtag  DW_TAG_member
    4970                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$43)
    4971                    .dwattr $C$DW$286, DW_AT_name("clockSourceFrequency")
    4972                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("clockSourceFrequency")
    4973                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4974                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4975                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4976                    .dwattr $C$DW$286, DW_AT_decl_line(0x16)
    4977                    .dwattr $C$DW$286, DW_AT_decl_column(0x0e)
    4978            
    4979            $C$DW$287       .dwtag  DW_TAG_member
    4980                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$43)
    4981                    .dwattr $C$DW$287, DW_AT_name("desiredSpiClock")
    4982                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("desiredSpiClock")
    4983                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4984                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4985                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4986                    .dwattr $C$DW$287, DW_AT_decl_line(0x18)
    4987                    .dwattr $C$DW$287, DW_AT_decl_column(0x0e)
    4988            
    4989            $C$DW$288       .dwtag  DW_TAG_member
    4990                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$24)
    4991                    .dwattr $C$DW$288, DW_AT_name("msbFirst")
    4992                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("msbFirst")
    4993                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4994                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4995                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4996                    .dwattr $C$DW$288, DW_AT_decl_line(0x1d)
    4997                    .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    4998            
    4999            $C$DW$289       .dwtag  DW_TAG_member
    5000                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$24)
    5001                    .dwattr $C$DW$289, DW_AT_name("clockPhase")
