MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:58 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Flash.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("FCTL1")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("FCTL1")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$114)

    2596                    .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2597                    .dwattr $C$DW$122, DW_AT_decl_line(0x76)
    2598                    .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    2599            
    2600            $C$DW$123       .dwtag  DW_TAG_enumerator
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   51

    2601                    .dwattr $C$DW$123, DW_AT_name("ack")
    2602                    .dwattr $C$DW$123, DW_AT_const_value(0x07)
    2603                    .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2604                    .dwattr $C$DW$123, DW_AT_decl_line(0x77)
    2605                    .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    2606            
    2607            $C$DW$124       .dwtag  DW_TAG_enumerator
    2608                    .dwattr $C$DW$124, DW_AT_name("var")
    2609                    .dwattr $C$DW$124, DW_AT_const_value(0x08)
    2610                    .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2611                    .dwattr $C$DW$124, DW_AT_decl_line(0x78)
    2612                    .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    2613            
    2614            $C$DW$125       .dwtag  DW_TAG_enumerator
    2615                    .dwattr $C$DW$125, DW_AT_name("UGmsg")
    2616                    .dwattr $C$DW$125, DW_AT_const_value(0x09)
    2617                    .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2618                    .dwattr $C$DW$125, DW_AT_decl_line(0x79)
    2619                    .dwattr $C$DW$125, DW_AT_decl_column(0x05)
    2620            
    2621                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2622                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2623                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2624                    .dwendtag $C$DW$T$57
    2625            
    2626            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2627                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2628                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2629                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2630                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2631                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    2632                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2633            
    2634            
    2635            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2636                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2637            $C$DW$126       .dwtag  DW_TAG_enumerator
    2638                    .dwattr $C$DW$126, DW_AT_name("init")
    2639                    .dwattr $C$DW$126, DW_AT_const_value(0x00)
    2640                    .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2641                    .dwattr $C$DW$126, DW_AT_decl_line(0x80)
    2642                    .dwattr $C$DW$126, DW_AT_decl_column(0x05)
    2643            
    2644            $C$DW$127       .dwtag  DW_TAG_enumerator
    2645                    .dwattr $C$DW$127, DW_AT_name("running")
    2646                    .dwattr $C$DW$127, DW_AT_const_value(0x01)
    2647                    .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2648                    .dwattr $C$DW$127, DW_AT_decl_line(0x80)
    2649                    .dwattr $C$DW$127, DW_AT_decl_column(0x0b)
    2650            
    2651            $C$DW$128       .dwtag  DW_TAG_enumerator
    2652                    .dwattr $C$DW$128, DW_AT_name("wait")
    2653                    .dwattr $C$DW$128, DW_AT_const_value(0x02)
    2654                    .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2655                    .dwattr $C$DW$128, DW_AT_decl_line(0x80)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   52

    2656                    .dwattr $C$DW$128, DW_AT_decl_column(0x14)
    2657            
    2658                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2659                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2660                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    2661                    .dwendtag $C$DW$T$59
    2662            
    2663            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2664                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2665                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2666                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2667                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2668                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2669                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2670            
    2671            
    2672            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2673                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2674            $C$DW$129       .dwtag  DW_TAG_member
    2675                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$14)
    2676                    .dwattr $C$DW$129, DW_AT_name("__max_align1")
    2677                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("__max_align1")
    2678                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2679                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2680                    .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2681                    .dwattr $C$DW$129, DW_AT_decl_line(0x7b)
    2682                    .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    2683            
    2684            $C$DW$130       .dwtag  DW_TAG_member
    2685                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$18)
    2686                    .dwattr $C$DW$130, DW_AT_name("__max_align2")
    2687                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("__max_align2")
    2688                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2689                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2690                    .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2691                    .dwattr $C$DW$130, DW_AT_decl_line(0x7c)
    2692                    .dwattr $C$DW$130, DW_AT_decl_column(0x0e)
    2693            
    2694                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2695                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    2696                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2697                    .dwendtag $C$DW$T$22
    2698            
    2699            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2700                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    2701                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    2702                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2703                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2704                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    2705                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2706            
    2707            
    2708            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2709                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    2710                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   53

    2711            $C$DW$131       .dwtag  DW_TAG_member
    2712                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$24)
    2713                    .dwattr $C$DW$131, DW_AT_name("memoryBufferControlIndex")
    2714                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    2715                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2716                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2717                    .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2718                    .dwattr $C$DW$131, DW_AT_decl_line(0x27)
    2719                    .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2720            
    2721            $C$DW$132       .dwtag  DW_TAG_member
    2722                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$24)
    2723                    .dwattr $C$DW$132, DW_AT_name("inputSourceSelect")
    2724                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("inputSourceSelect")
    2725                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2726                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2727                    .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2728                    .dwattr $C$DW$132, DW_AT_decl_line(0x3b)
    2729                    .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2730            
    2731            $C$DW$133       .dwtag  DW_TAG_member
    2732                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$24)
    2733                    .dwattr $C$DW$133, DW_AT_name("positiveRefVoltageSourceSelect")
    2734                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    2735                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2736                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2737                    .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2738                    .dwattr $C$DW$133, DW_AT_decl_line(0x42)
    2739                    .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2740            
    2741            $C$DW$134       .dwtag  DW_TAG_member
    2742                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$24)
    2743                    .dwattr $C$DW$134, DW_AT_name("negativeRefVoltageSourceSelect")
    2744                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    2745                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2746                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2747                    .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2748                    .dwattr $C$DW$134, DW_AT_decl_line(0x48)
    2749                    .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2750            
    2751            $C$DW$135       .dwtag  DW_TAG_member
    2752                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$24)
    2753                    .dwattr $C$DW$135, DW_AT_name("endOfSequence")
    2754                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("endOfSequence")
    2755                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2756                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2757                    .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2758                    .dwattr $C$DW$135, DW_AT_decl_line(0x51)
    2759                    .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2760            
    2761                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2762                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    2763                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2764                    .dwendtag $C$DW$T$25
    2765            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   54

    2766            $C$DW$T$62      .dwtag  DW_TAG_typedef
    2767                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    2768                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    2769                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2770                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2771                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    2772                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2773            
    2774            
    2775            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2776                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    2777                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2778            $C$DW$136       .dwtag  DW_TAG_member
    2779                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    2780                    .dwattr $C$DW$136, DW_AT_name("captureRegister")
    2781                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("captureRegister")
    2782                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2783                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2784                    .dwattr $C$DW$136, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2785                    .dwattr $C$DW$136, DW_AT_decl_line(0x58)
    2786                    .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2787            
    2788            $C$DW$137       .dwtag  DW_TAG_member
    2789                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    2790                    .dwattr $C$DW$137, DW_AT_name("captureMode")
    2791                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("captureMode")
    2792                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2793                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2794                    .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2795                    .dwattr $C$DW$137, DW_AT_decl_line(0x5f)
    2796                    .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2797            
    2798            $C$DW$138       .dwtag  DW_TAG_member
    2799                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2800                    .dwattr $C$DW$138, DW_AT_name("captureInputSelect")
    2801                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("captureInputSelect")
    2802                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2803                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2804                    .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2805                    .dwattr $C$DW$138, DW_AT_decl_line(0x66)
    2806                    .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2807            
    2808            $C$DW$139       .dwtag  DW_TAG_member
    2809                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2810                    .dwattr $C$DW$139, DW_AT_name("synchronizeCaptureSource")
    2811                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2812                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2813                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2814                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2815                    .dwattr $C$DW$139, DW_AT_decl_line(0x6b)
    2816                    .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2817            
    2818            $C$DW$140       .dwtag  DW_TAG_member
    2819                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2820                    .dwattr $C$DW$140, DW_AT_name("captureInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   55

    2821                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("captureInterruptEnable")
    2822                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2823                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2824                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2825                    .dwattr $C$DW$140, DW_AT_decl_line(0x70)
    2826                    .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2827            
    2828            $C$DW$141       .dwtag  DW_TAG_member
    2829                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2830                    .dwattr $C$DW$141, DW_AT_name("captureOutputMode")
    2831                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("captureOutputMode")
    2832                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2833                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2834                    .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2835                    .dwattr $C$DW$141, DW_AT_decl_line(0x7b)
    2836                    .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2837            
    2838                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2839                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    2840                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2841                    .dwendtag $C$DW$T$28
    2842            
    2843            $C$DW$T$63      .dwtag  DW_TAG_typedef
    2844                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    2845                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    2846                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2847                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2848                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    2849                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2850            
    2851            
    2852            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2853                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    2854                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2855            $C$DW$142       .dwtag  DW_TAG_member
    2856                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    2857                    .dwattr $C$DW$142, DW_AT_name("compareRegister")
    2858                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("compareRegister")
    2859                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2861                    .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2862                    .dwattr $C$DW$142, DW_AT_decl_line(0x145)
    2863                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2864            
    2865            $C$DW$143       .dwtag  DW_TAG_member
    2866                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    2867                    .dwattr $C$DW$143, DW_AT_name("compareInterruptEnable")
    2868                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("compareInterruptEnable")
    2869                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2870                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2871                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2872                    .dwattr $C$DW$143, DW_AT_decl_line(0x14a)
    2873                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2874            
    2875            $C$DW$144       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   56

    2876                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2877                    .dwattr $C$DW$144, DW_AT_name("compareOutputMode")
    2878                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("compareOutputMode")
    2879                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2880                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2881                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2882                    .dwattr $C$DW$144, DW_AT_decl_line(0x155)
    2883                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2884            
    2885            $C$DW$145       .dwtag  DW_TAG_member
    2886                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2887                    .dwattr $C$DW$145, DW_AT_name("compareValue")
    2888                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("compareValue")
    2889                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2890                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2891                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2892                    .dwattr $C$DW$145, DW_AT_decl_line(0x157)
    2893                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2894            
    2895                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2896                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    2897                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2898                    .dwendtag $C$DW$T$29
    2899            
    2900            $C$DW$T$64      .dwtag  DW_TAG_typedef
    2901                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    2902                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    2903                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2904                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2905                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    2906                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    2907            
    2908            
    2909            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2910                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    2911                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    2912            $C$DW$146       .dwtag  DW_TAG_member
    2913                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2914                    .dwattr $C$DW$146, DW_AT_name("clockSource")
    2915                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("clockSource")
    2916                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2917                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2918                    .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2919                    .dwattr $C$DW$146, DW_AT_decl_line(0x20)
    2920                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2921            
    2922            $C$DW$147       .dwtag  DW_TAG_member
    2923                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2924                    .dwattr $C$DW$147, DW_AT_name("clockSourceDivider")
    2925                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("clockSourceDivider")
    2926                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2927                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2928                    .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2929                    .dwattr $C$DW$147, DW_AT_decl_line(0x37)
    2930                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   57

    2931            
    2932            $C$DW$148       .dwtag  DW_TAG_member
    2933                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2934                    .dwattr $C$DW$148, DW_AT_name("timerInterruptEnable_TAIE")
    2935                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2936                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2937                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2938                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2939                    .dwattr $C$DW$148, DW_AT_decl_line(0x3c)
    2940                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2941            
    2942            $C$DW$149       .dwtag  DW_TAG_member
    2943                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    2944                    .dwattr $C$DW$149, DW_AT_name("timerClear")
    2945                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("timerClear")
    2946                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2947                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2948                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2949                    .dwattr $C$DW$149, DW_AT_decl_line(0x42)
    2950                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2951            
    2952            $C$DW$150       .dwtag  DW_TAG_member
    2953                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    2954                    .dwattr $C$DW$150, DW_AT_name("startTimer")
    2955                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("startTimer")
    2956                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2957                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2958                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2959                    .dwattr $C$DW$150, DW_AT_decl_line(0x44)
    2960                    .dwattr $C$DW$150, DW_AT_decl_column(0x0a)
    2961            
    2962                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2963                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    2964                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2965                    .dwendtag $C$DW$T$31
    2966            
    2967            $C$DW$T$65      .dwtag  DW_TAG_typedef
    2968                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    2969                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    2970                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2971                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2972                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    2973                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    2974            
    2975            
    2976            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2977                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    2978                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    2979            $C$DW$151       .dwtag  DW_TAG_member
    2980                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2981                    .dwattr $C$DW$151, DW_AT_name("clockSource")
    2982                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("clockSource")
    2983                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2984                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2985                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   58

    2986                    .dwattr $C$DW$151, DW_AT_decl_line(0x8b)
    2987                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2988            
    2989            $C$DW$152       .dwtag  DW_TAG_member
    2990                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2991                    .dwattr $C$DW$152, DW_AT_name("clockSourceDivider")
    2992                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("clockSourceDivider")
    2993                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2994                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2995                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2996                    .dwattr $C$DW$152, DW_AT_decl_line(0xa2)
    2997                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    2998            
    2999            $C$DW$153       .dwtag  DW_TAG_member
    3000                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    3001                    .dwattr $C$DW$153, DW_AT_name("timerPeriod")
    3002                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("timerPeriod")
    3003                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3004                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3005                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3006                    .dwattr $C$DW$153, DW_AT_decl_line(0xa4)
    3007                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    3008            
    3009            $C$DW$154       .dwtag  DW_TAG_member
    3010                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    3011                    .dwattr $C$DW$154, DW_AT_name("timerInterruptEnable_TAIE")
    3012                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3013                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3014                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3015                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3016                    .dwattr $C$DW$154, DW_AT_decl_line(0xa9)
    3017                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    3018            
    3019            $C$DW$155       .dwtag  DW_TAG_member
    3020                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    3021                    .dwattr $C$DW$155, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3022                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3023                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3024                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3025                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3026                    .dwattr $C$DW$155, DW_AT_decl_line(0xae)
    3027                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    3028            
    3029            $C$DW$156       .dwtag  DW_TAG_member
    3030                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    3031                    .dwattr $C$DW$156, DW_AT_name("timerClear")
    3032                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("timerClear")
    3033                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3034                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3035                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3036                    .dwattr $C$DW$156, DW_AT_decl_line(0xb4)
    3037                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    3038            
    3039            $C$DW$157       .dwtag  DW_TAG_member
    3040                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   59

    3041                    .dwattr $C$DW$157, DW_AT_name("startTimer")
    3042                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("startTimer")
    3043                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3044                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3045                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3046                    .dwattr $C$DW$157, DW_AT_decl_line(0xb6)
    3047                    .dwattr $C$DW$157, DW_AT_decl_column(0x0a)
    3048            
    3049                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3050                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3051                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3052                    .dwendtag $C$DW$T$32
    3053            
    3054            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3055                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3056                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3057                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3058                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3059                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3060                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3061            
    3062            
    3063            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3064                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3065                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3066            $C$DW$158       .dwtag  DW_TAG_member
    3067                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    3068                    .dwattr $C$DW$158, DW_AT_name("clockSource")
    3069                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSource")
    3070                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3072                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3073                    .dwattr $C$DW$158, DW_AT_decl_line(0x105)
    3074                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    3075            
    3076            $C$DW$159       .dwtag  DW_TAG_member
    3077                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    3078                    .dwattr $C$DW$159, DW_AT_name("clockSourceDivider")
    3079                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("clockSourceDivider")
    3080                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3081                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3082                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3083                    .dwattr $C$DW$159, DW_AT_decl_line(0x11c)
    3084                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    3085            
    3086            $C$DW$160       .dwtag  DW_TAG_member
    3087                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    3088                    .dwattr $C$DW$160, DW_AT_name("timerPeriod")
    3089                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerPeriod")
    3090                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3091                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3092                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3093                    .dwattr $C$DW$160, DW_AT_decl_line(0x11f)
    3094                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    3095            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   60

    3096            $C$DW$161       .dwtag  DW_TAG_member
    3097                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3098                    .dwattr $C$DW$161, DW_AT_name("timerInterruptEnable_TAIE")
    3099                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3100                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3101                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3102                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3103                    .dwattr $C$DW$161, DW_AT_decl_line(0x124)
    3104                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3105            
    3106            $C$DW$162       .dwtag  DW_TAG_member
    3107                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    3108                    .dwattr $C$DW$162, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3109                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3110                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3111                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3112                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3113                    .dwattr $C$DW$162, DW_AT_decl_line(0x129)
    3114                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3115            
    3116            $C$DW$163       .dwtag  DW_TAG_member
    3117                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3118                    .dwattr $C$DW$163, DW_AT_name("timerClear")
    3119                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("timerClear")
    3120                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3121                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3122                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3123                    .dwattr $C$DW$163, DW_AT_decl_line(0x12f)
    3124                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3125            
    3126            $C$DW$164       .dwtag  DW_TAG_member
    3127                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$30)
    3128                    .dwattr $C$DW$164, DW_AT_name("startTimer")
    3129                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("startTimer")
    3130                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3131                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3132                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3133                    .dwattr $C$DW$164, DW_AT_decl_line(0x131)
    3134                    .dwattr $C$DW$164, DW_AT_decl_column(0x0a)
    3135            
    3136                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3137                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3138                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3139                    .dwendtag $C$DW$T$33
    3140            
    3141            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3142                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3143                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3144                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3145                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3146                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3147                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3148            
    3149            
    3150            $C$DW$T$34      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   61

    3151                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3152                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3153            $C$DW$165       .dwtag  DW_TAG_member
    3154                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3155                    .dwattr $C$DW$165, DW_AT_name("clockSource")
    3156                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("clockSource")
    3157                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3159                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3160                    .dwattr $C$DW$165, DW_AT_decl_line(0xc5)
    3161                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3162            
    3163            $C$DW$166       .dwtag  DW_TAG_member
    3164                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3165                    .dwattr $C$DW$166, DW_AT_name("clockSourceDivider")
    3166                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockSourceDivider")
    3167                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3168                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3169                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3170                    .dwattr $C$DW$166, DW_AT_decl_line(0xdc)
    3171                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3172            
    3173            $C$DW$167       .dwtag  DW_TAG_member
    3174                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3175                    .dwattr $C$DW$167, DW_AT_name("timerPeriod")
    3176                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("timerPeriod")
    3177                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3178                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3179                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3180                    .dwattr $C$DW$167, DW_AT_decl_line(0xde)
    3181                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3182            
    3183            $C$DW$168       .dwtag  DW_TAG_member
    3184                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3185                    .dwattr $C$DW$168, DW_AT_name("compareRegister")
    3186                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("compareRegister")
    3187                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3188                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3189                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3190                    .dwattr $C$DW$168, DW_AT_decl_line(0xe9)
    3191                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3192            
    3193            $C$DW$169       .dwtag  DW_TAG_member
    3194                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3195                    .dwattr $C$DW$169, DW_AT_name("compareOutputMode")
    3196                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("compareOutputMode")
    3197                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3198                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3199                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3200                    .dwattr $C$DW$169, DW_AT_decl_line(0xf4)
    3201                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3202            
    3203            $C$DW$170       .dwtag  DW_TAG_member
    3204                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3205                    .dwattr $C$DW$170, DW_AT_name("dutyCycle")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   62

    3206                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("dutyCycle")
    3207                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3208                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3209                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3210                    .dwattr $C$DW$170, DW_AT_decl_line(0xf6)
    3211                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3212            
    3213                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3214                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3215                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3216                    .dwendtag $C$DW$T$34
    3217            
    3218            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3219                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3220                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3221                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3222                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3223                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3224                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3225            
    3226            
    3227            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3228                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3229                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3230            $C$DW$171       .dwtag  DW_TAG_member
    3231                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3232                    .dwattr $C$DW$171, DW_AT_name("captureRegister")
    3233                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("captureRegister")
    3234                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3235                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3236                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3237                    .dwattr $C$DW$171, DW_AT_decl_line(0xa0)
    3238                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3239            
    3240            $C$DW$172       .dwtag  DW_TAG_member
    3241                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3242                    .dwattr $C$DW$172, DW_AT_name("captureMode")
    3243                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("captureMode")
    3244                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3245                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3246                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3247                    .dwattr $C$DW$172, DW_AT_decl_line(0xa7)
    3248                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3249            
    3250            $C$DW$173       .dwtag  DW_TAG_member
    3251                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3252                    .dwattr $C$DW$173, DW_AT_name("captureInputSelect")
    3253                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("captureInputSelect")
    3254                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3255                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3256                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3257                    .dwattr $C$DW$173, DW_AT_decl_line(0xae)
    3258                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3259            
    3260            $C$DW$174       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   63

    3261                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3262                    .dwattr $C$DW$174, DW_AT_name("synchronizeCaptureSource")
    3263                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3264                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3265                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3266                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3267                    .dwattr $C$DW$174, DW_AT_decl_line(0xb3)
    3268                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    3269            
    3270            $C$DW$175       .dwtag  DW_TAG_member
    3271                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3272                    .dwattr $C$DW$175, DW_AT_name("captureInterruptEnable")
    3273                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("captureInterruptEnable")
    3274                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3275                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3276                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3277                    .dwattr $C$DW$175, DW_AT_decl_line(0xb8)
    3278                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3279            
    3280            $C$DW$176       .dwtag  DW_TAG_member
    3281                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    3282                    .dwattr $C$DW$176, DW_AT_name("captureOutputMode")
    3283                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("captureOutputMode")
    3284                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3285                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3286                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3287                    .dwattr $C$DW$176, DW_AT_decl_line(0xc3)
    3288                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    3289            
    3290                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3291                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3292                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3293                    .dwendtag $C$DW$T$35
    3294            
    3295            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3296                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3297                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    3298                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3299                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3300                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3301                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3302            
    3303            
    3304            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3305                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3306                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3307            $C$DW$177       .dwtag  DW_TAG_member
    3308                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3309                    .dwattr $C$DW$177, DW_AT_name("compareRegister")
    3310                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("compareRegister")
    3311                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3312                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3313                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3314                    .dwattr $C$DW$177, DW_AT_decl_line(0x146)
    3315                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   64

    3316            
    3317            $C$DW$178       .dwtag  DW_TAG_member
    3318                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3319                    .dwattr $C$DW$178, DW_AT_name("compareInterruptEnable")
    3320                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("compareInterruptEnable")
    3321                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3322                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3323                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3324                    .dwattr $C$DW$178, DW_AT_decl_line(0x14b)
    3325                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3326            
    3327            $C$DW$179       .dwtag  DW_TAG_member
    3328                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3329                    .dwattr $C$DW$179, DW_AT_name("compareOutputMode")
    3330                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("compareOutputMode")
    3331                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3332                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3333                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3334                    .dwattr $C$DW$179, DW_AT_decl_line(0x156)
    3335                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3336            
    3337            $C$DW$180       .dwtag  DW_TAG_member
    3338                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3339                    .dwattr $C$DW$180, DW_AT_name("compareValue")
    3340                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("compareValue")
    3341                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3342                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3343                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3344                    .dwattr $C$DW$180, DW_AT_decl_line(0x158)
    3345                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3346            
    3347                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3348                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3349                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3350                    .dwendtag $C$DW$T$36
    3351            
    3352            $C$DW$T$70      .dwtag  DW_TAG_typedef
    3353                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    3354                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    3355                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3356                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3357                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    3358                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3359            
    3360            
    3361            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3362                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    3363                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    3364            $C$DW$181       .dwtag  DW_TAG_member
    3365                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    3366                    .dwattr $C$DW$181, DW_AT_name("clockSource")
    3367                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("clockSource")
    3368                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3369                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3370                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   65

    3371                    .dwattr $C$DW$181, DW_AT_decl_line(0xd3)
    3372                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3373            
    3374            $C$DW$182       .dwtag  DW_TAG_member
    3375                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    3376                    .dwattr $C$DW$182, DW_AT_name("clockSourceDivider")
    3377                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("clockSourceDivider")
    3378                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3379                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3380                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3381                    .dwattr $C$DW$182, DW_AT_decl_line(0xea)
    3382                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3383            
    3384            $C$DW$183       .dwtag  DW_TAG_member
    3385                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3386                    .dwattr $C$DW$183, DW_AT_name("timerInterruptEnable_TBIE")
    3387                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3388                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3389                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3390                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3391                    .dwattr $C$DW$183, DW_AT_decl_line(0xef)
    3392                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3393            
    3394            $C$DW$184       .dwtag  DW_TAG_member
    3395                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3396                    .dwattr $C$DW$184, DW_AT_name("timerClear")
    3397                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("timerClear")
    3398                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3399                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3400                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3401                    .dwattr $C$DW$184, DW_AT_decl_line(0xf5)
    3402                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3403            
    3404            $C$DW$185       .dwtag  DW_TAG_member
    3405                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    3406                    .dwattr $C$DW$185, DW_AT_name("startTimer")
    3407                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("startTimer")
    3408                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3409                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3410                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3411                    .dwattr $C$DW$185, DW_AT_decl_line(0xf7)
    3412                    .dwattr $C$DW$185, DW_AT_decl_column(0x0a)
    3413            
    3414                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3415                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    3416                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3417                    .dwendtag $C$DW$T$37
    3418            
    3419            $C$DW$T$71      .dwtag  DW_TAG_typedef
    3420                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    3421                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    3422                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3423                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3424                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    3425                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   66

    3426            
    3427            
    3428            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3429                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    3430                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    3431            $C$DW$186       .dwtag  DW_TAG_member
    3432                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3433                    .dwattr $C$DW$186, DW_AT_name("clockSource")
    3434                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("clockSource")
    3435                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3436                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3437                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3438                    .dwattr $C$DW$186, DW_AT_decl_line(0x107)
    3439                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3440            
    3441            $C$DW$187       .dwtag  DW_TAG_member
    3442                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3443                    .dwattr $C$DW$187, DW_AT_name("clockSourceDivider")
    3444                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("clockSourceDivider")
    3445                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3446                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3447                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3448                    .dwattr $C$DW$187, DW_AT_decl_line(0x11e)
    3449                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3450            
    3451            $C$DW$188       .dwtag  DW_TAG_member
    3452                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3453                    .dwattr $C$DW$188, DW_AT_name("timerPeriod")
    3454                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("timerPeriod")
    3455                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3456                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3457                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3458                    .dwattr $C$DW$188, DW_AT_decl_line(0x120)
    3459                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3460            
    3461            $C$DW$189       .dwtag  DW_TAG_member
    3462                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3463                    .dwattr $C$DW$189, DW_AT_name("timerInterruptEnable_TBIE")
    3464                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3465                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3466                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3467                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3468                    .dwattr $C$DW$189, DW_AT_decl_line(0x125)
    3469                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3470            
    3471            $C$DW$190       .dwtag  DW_TAG_member
    3472                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3473                    .dwattr $C$DW$190, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3474                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3475                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3476                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3477                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3478                    .dwattr $C$DW$190, DW_AT_decl_line(0x12a)
    3479                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3480            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   67

    3481            $C$DW$191       .dwtag  DW_TAG_member
    3482                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3483                    .dwattr $C$DW$191, DW_AT_name("timerClear")
    3484                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("timerClear")
    3485                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3486                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3487                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3488                    .dwattr $C$DW$191, DW_AT_decl_line(0x130)
    3489                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3490            
    3491            $C$DW$192       .dwtag  DW_TAG_member
    3492                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$30)
    3493                    .dwattr $C$DW$192, DW_AT_name("startTimer")
    3494                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("startTimer")
    3495                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3496                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3497                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3498                    .dwattr $C$DW$192, DW_AT_decl_line(0x132)
    3499                    .dwattr $C$DW$192, DW_AT_decl_column(0x0a)
    3500            
    3501                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3502                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    3503                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3504                    .dwendtag $C$DW$T$38
    3505            
    3506            $C$DW$T$72      .dwtag  DW_TAG_typedef
    3507                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    3508                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    3509                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3510                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3511                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    3512                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3513            
    3514            
    3515            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3516                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    3517                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    3518            $C$DW$193       .dwtag  DW_TAG_member
    3519                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3520                    .dwattr $C$DW$193, DW_AT_name("clockSource")
    3521                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("clockSource")
    3522                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3523                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3524                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3525                    .dwattr $C$DW$193, DW_AT_decl_line(0x60)
    3526                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3527            
    3528            $C$DW$194       .dwtag  DW_TAG_member
    3529                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3530                    .dwattr $C$DW$194, DW_AT_name("clockSourceDivider")
    3531                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("clockSourceDivider")
    3532                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3533                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3534                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3535                    .dwattr $C$DW$194, DW_AT_decl_line(0x77)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   68

    3536                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3537            
    3538            $C$DW$195       .dwtag  DW_TAG_member
    3539                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3540                    .dwattr $C$DW$195, DW_AT_name("timerPeriod")
    3541                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerPeriod")
    3542                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3543                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3544                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3545                    .dwattr $C$DW$195, DW_AT_decl_line(0x7a)
    3546                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3547            
    3548            $C$DW$196       .dwtag  DW_TAG_member
    3549                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3550                    .dwattr $C$DW$196, DW_AT_name("timerInterruptEnable_TBIE")
    3551                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3552                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3553                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3554                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3555                    .dwattr $C$DW$196, DW_AT_decl_line(0x7f)
    3556                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3557            
    3558            $C$DW$197       .dwtag  DW_TAG_member
    3559                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3560                    .dwattr $C$DW$197, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3561                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3562                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3563                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3564                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3565                    .dwattr $C$DW$197, DW_AT_decl_line(0x84)
    3566                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3567            
    3568            $C$DW$198       .dwtag  DW_TAG_member
    3569                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3570                    .dwattr $C$DW$198, DW_AT_name("timerClear")
    3571                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("timerClear")
    3572                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3573                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3574                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3575                    .dwattr $C$DW$198, DW_AT_decl_line(0x8a)
    3576                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3577            
    3578            $C$DW$199       .dwtag  DW_TAG_member
    3579                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$30)
    3580                    .dwattr $C$DW$199, DW_AT_name("startTimer")
    3581                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("startTimer")
    3582                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3583                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3584                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3585                    .dwattr $C$DW$199, DW_AT_decl_line(0x8c)
    3586                    .dwattr $C$DW$199, DW_AT_decl_column(0x0a)
    3587            
    3588                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3589                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    3590                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   69

    3591                    .dwendtag $C$DW$T$39
    3592            
    3593            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3594                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3595                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    3596                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3597                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3598                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3599                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3600            
    3601            
    3602            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3603                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3604                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3605            $C$DW$200       .dwtag  DW_TAG_member
    3606                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3607                    .dwattr $C$DW$200, DW_AT_name("clockSource")
    3608                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("clockSource")
    3609                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3610                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3611                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3612                    .dwattr $C$DW$200, DW_AT_decl_line(0x20)
    3613                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3614            
    3615            $C$DW$201       .dwtag  DW_TAG_member
    3616                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3617                    .dwattr $C$DW$201, DW_AT_name("clockSourceDivider")
    3618                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("clockSourceDivider")
    3619                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3620                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3621                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3622                    .dwattr $C$DW$201, DW_AT_decl_line(0x37)
    3623                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3624            
    3625            $C$DW$202       .dwtag  DW_TAG_member
    3626                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3627                    .dwattr $C$DW$202, DW_AT_name("timerPeriod")
    3628                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("timerPeriod")
    3629                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3630                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3631                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3632                    .dwattr $C$DW$202, DW_AT_decl_line(0x39)
    3633                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3634            
    3635            $C$DW$203       .dwtag  DW_TAG_member
    3636                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3637                    .dwattr $C$DW$203, DW_AT_name("compareRegister")
    3638                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("compareRegister")
    3639                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3640                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3641                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3642                    .dwattr $C$DW$203, DW_AT_decl_line(0x44)
    3643                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3644            
    3645            $C$DW$204       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   70

    3646                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3647                    .dwattr $C$DW$204, DW_AT_name("compareOutputMode")
    3648                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("compareOutputMode")
    3649                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3650                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3651                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3652                    .dwattr $C$DW$204, DW_AT_decl_line(0x4f)
    3653                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3654            
    3655            $C$DW$205       .dwtag  DW_TAG_member
    3656                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3657                    .dwattr $C$DW$205, DW_AT_name("dutyCycle")
    3658                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("dutyCycle")
    3659                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3660                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3661                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3662                    .dwattr $C$DW$205, DW_AT_decl_line(0x51)
    3663                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3664            
    3665                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3666                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3667                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3668                    .dwendtag $C$DW$T$40
    3669            
    3670            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3671                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3672                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3673                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3674                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3675                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3676                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3677            
    3678            
    3679            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3680                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    3681                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3682            $C$DW$206       .dwtag  DW_TAG_member
    3683                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
    3684                    .dwattr $C$DW$206, DW_AT_name("selectClockSource")
    3685                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("selectClockSource")
    3686                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3687                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3688                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3689                    .dwattr $C$DW$206, DW_AT_decl_line(0x1c)
    3690                    .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    3691            
    3692            $C$DW$207       .dwtag  DW_TAG_member
    3693                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3694                    .dwattr $C$DW$207, DW_AT_name("clockPrescalar")
    3695                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("clockPrescalar")
    3696                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3697                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3698                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3699                    .dwattr $C$DW$207, DW_AT_decl_line(0x1e)
    3700                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   71

    3701            
    3702            $C$DW$208       .dwtag  DW_TAG_member
    3703                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    3704                    .dwattr $C$DW$208, DW_AT_name("firstModReg")
    3705                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("firstModReg")
    3706                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3707                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3708                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3709                    .dwattr $C$DW$208, DW_AT_decl_line(0x22)
    3710                    .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    3711            
    3712            $C$DW$209       .dwtag  DW_TAG_member
    3713                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$24)
    3714                    .dwattr $C$DW$209, DW_AT_name("secondModReg")
    3715                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("secondModReg")
    3716                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3717                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3718                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3719                    .dwattr $C$DW$209, DW_AT_decl_line(0x26)
    3720                    .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    3721            
    3722            $C$DW$210       .dwtag  DW_TAG_member
    3723                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$24)
    3724                    .dwattr $C$DW$210, DW_AT_name("parity")
    3725                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("parity")
    3726                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3727                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3728                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3729                    .dwattr $C$DW$210, DW_AT_decl_line(0x2c)
    3730                    .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    3731            
    3732            $C$DW$211       .dwtag  DW_TAG_member
    3733                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$24)
    3734                    .dwattr $C$DW$211, DW_AT_name("msborLsbFirst")
    3735                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("msborLsbFirst")
    3736                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3737                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3738                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3739                    .dwattr $C$DW$211, DW_AT_decl_line(0x31)
    3740                    .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    3741            
    3742            $C$DW$212       .dwtag  DW_TAG_member
    3743                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$24)
    3744                    .dwattr $C$DW$212, DW_AT_name("numberofStopBits")
    3745                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("numberofStopBits")
    3746                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3747                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3748                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3749                    .dwattr $C$DW$212, DW_AT_decl_line(0x36)
    3750                    .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    3751            
    3752            $C$DW$213       .dwtag  DW_TAG_member
    3753                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$24)
    3754                    .dwattr $C$DW$213, DW_AT_name("uartMode")
    3755                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("uartMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   72

    3756                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3757                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3758                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3759                    .dwattr $C$DW$213, DW_AT_decl_line(0x3d)
    3760                    .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    3761            
    3762            $C$DW$214       .dwtag  DW_TAG_member
    3763                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$24)
    3764                    .dwattr $C$DW$214, DW_AT_name("overSampling")
    3765                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("overSampling")
    3766                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3767                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3768                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3769                    .dwattr $C$DW$214, DW_AT_decl_line(0x42)
    3770                    .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    3771            
    3772                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3773                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    3774                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3775                    .dwendtag $C$DW$T$41
    3776            
    3777            $C$DW$T$75      .dwtag  DW_TAG_typedef
    3778                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    3779                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    3780                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3781                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3782                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    3783                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3784            
    3785            
    3786            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3787                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3788                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    3789            $C$DW$215       .dwtag  DW_TAG_member
    3790                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$43)
    3791                    .dwattr $C$DW$215, DW_AT_name("clockSourceFrequency")
    3792                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("clockSourceFrequency")
    3793                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3794                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3795                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3796                    .dwattr $C$DW$215, DW_AT_decl_line(0x31)
    3797                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3798            
    3799            $C$DW$216       .dwtag  DW_TAG_member
    3800                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$43)
    3801                    .dwattr $C$DW$216, DW_AT_name("desiredSpiClock")
    3802                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("desiredSpiClock")
    3803                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3804                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3805                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3806                    .dwattr $C$DW$216, DW_AT_decl_line(0x33)
    3807                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    3808            
    3809                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3810                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   73

    3811                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3812                    .dwendtag $C$DW$T$44
    3813            
    3814            $C$DW$T$76      .dwtag  DW_TAG_typedef
    3815                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3816                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    3817                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3818                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3819                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    3820                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3821            
    3822            
    3823            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3824                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    3825                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    3826            $C$DW$217       .dwtag  DW_TAG_member
    3827                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$24)
    3828                    .dwattr $C$DW$217, DW_AT_name("selectClockSource")
    3829                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("selectClockSource")
    3830                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3831                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3832                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3833                    .dwattr $C$DW$217, DW_AT_decl_line(0x14)
    3834                    .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    3835            
    3836            $C$DW$218       .dwtag  DW_TAG_member
    3837                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$43)
    3838                    .dwattr $C$DW$218, DW_AT_name("clockSourceFrequency")
    3839                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("clockSourceFrequency")
    3840                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3841                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3842                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3843                    .dwattr $C$DW$218, DW_AT_decl_line(0x16)
    3844                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    3845            
    3846            $C$DW$219       .dwtag  DW_TAG_member
    3847                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$43)
    3848                    .dwattr $C$DW$219, DW_AT_name("desiredSpiClock")
    3849                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("desiredSpiClock")
    3850                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3851                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3852                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3853                    .dwattr $C$DW$219, DW_AT_decl_line(0x18)
    3854                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3855            
    3856            $C$DW$220       .dwtag  DW_TAG_member
    3857                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    3858                    .dwattr $C$DW$220, DW_AT_name("msbFirst")
    3859                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("msbFirst")
    3860                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3861                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3862                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3863                    .dwattr $C$DW$220, DW_AT_decl_line(0x1d)
    3864                    .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    3865            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Flash.asm                                                            PAGE   74

