MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:05 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/flight_recorder.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("WDTCTL")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("WDTCTL")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$120)

    2913            $C$DW$139       .dwtag  DW_TAG_enumerator
    2914                    .dwattr $C$DW$139, DW_AT_name("crc2")
    2915                    .dwattr $C$DW$139, DW_AT_const_value(0x06)
    2916                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2917                    .dwattr $C$DW$139, DW_AT_decl_line(0x76)
    2918                    .dwattr $C$DW$139, DW_AT_decl_column(0x05)
    2919            
    2920            $C$DW$140       .dwtag  DW_TAG_enumerator
    2921                    .dwattr $C$DW$140, DW_AT_name("ack")
    2922                    .dwattr $C$DW$140, DW_AT_const_value(0x07)
    2923                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2924                    .dwattr $C$DW$140, DW_AT_decl_line(0x77)
    2925                    .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2926            
    2927            $C$DW$141       .dwtag  DW_TAG_enumerator
    2928                    .dwattr $C$DW$141, DW_AT_name("var")
    2929                    .dwattr $C$DW$141, DW_AT_const_value(0x08)
    2930                    .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2931                    .dwattr $C$DW$141, DW_AT_decl_line(0x78)
    2932                    .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    2933            
    2934            $C$DW$142       .dwtag  DW_TAG_enumerator
    2935                    .dwattr $C$DW$142, DW_AT_name("UGmsg")
    2936                    .dwattr $C$DW$142, DW_AT_const_value(0x09)
    2937                    .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2938                    .dwattr $C$DW$142, DW_AT_decl_line(0x79)
    2939                    .dwattr $C$DW$142, DW_AT_decl_column(0x05)
    2940            
    2941                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2942                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2943                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2944                    .dwendtag $C$DW$T$57
    2945            
    2946            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2947                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2948                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2949                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2950                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2951                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    2952                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2953            
    2954            
    2955            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2956                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2957            $C$DW$143       .dwtag  DW_TAG_enumerator
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   59

    2958                    .dwattr $C$DW$143, DW_AT_name("init")
    2959                    .dwattr $C$DW$143, DW_AT_const_value(0x00)
    2960                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2961                    .dwattr $C$DW$143, DW_AT_decl_line(0x80)
    2962                    .dwattr $C$DW$143, DW_AT_decl_column(0x05)
    2963            
    2964            $C$DW$144       .dwtag  DW_TAG_enumerator
    2965                    .dwattr $C$DW$144, DW_AT_name("running")
    2966                    .dwattr $C$DW$144, DW_AT_const_value(0x01)
    2967                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2968                    .dwattr $C$DW$144, DW_AT_decl_line(0x80)
    2969                    .dwattr $C$DW$144, DW_AT_decl_column(0x0b)
    2970            
    2971            $C$DW$145       .dwtag  DW_TAG_enumerator
    2972                    .dwattr $C$DW$145, DW_AT_name("wait")
    2973                    .dwattr $C$DW$145, DW_AT_const_value(0x02)
    2974                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2975                    .dwattr $C$DW$145, DW_AT_decl_line(0x80)
    2976                    .dwattr $C$DW$145, DW_AT_decl_column(0x14)
    2977            
    2978                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2979                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2980                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    2981                    .dwendtag $C$DW$T$59
    2982            
    2983            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2984                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2985                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2986                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2987                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2988                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2989                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2990            
    2991            
    2992            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2993                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2994            $C$DW$146       .dwtag  DW_TAG_member
    2995                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$14)
    2996                    .dwattr $C$DW$146, DW_AT_name("__max_align1")
    2997                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("__max_align1")
    2998                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2999                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3000                    .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3001                    .dwattr $C$DW$146, DW_AT_decl_line(0x7b)
    3002                    .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    3003            
    3004            $C$DW$147       .dwtag  DW_TAG_member
    3005                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$18)
    3006                    .dwattr $C$DW$147, DW_AT_name("__max_align2")
    3007                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("__max_align2")
    3008                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3009                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3010                    .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3011                    .dwattr $C$DW$147, DW_AT_decl_line(0x7c)
    3012                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   60

    3013            
    3014                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3015                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3016                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3017                    .dwendtag $C$DW$T$22
    3018            
    3019            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3020                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3021                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3022                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3023                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3024                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3025                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3026            
    3027            
    3028            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3029                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3030                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    3031            $C$DW$148       .dwtag  DW_TAG_member
    3032                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$24)
    3033                    .dwattr $C$DW$148, DW_AT_name("memoryBufferControlIndex")
    3034                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3035                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3036                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3037                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3038                    .dwattr $C$DW$148, DW_AT_decl_line(0x27)
    3039                    .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    3040            
    3041            $C$DW$149       .dwtag  DW_TAG_member
    3042                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$24)
    3043                    .dwattr $C$DW$149, DW_AT_name("inputSourceSelect")
    3044                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("inputSourceSelect")
    3045                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3046                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3047                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3048                    .dwattr $C$DW$149, DW_AT_decl_line(0x3b)
    3049                    .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    3050            
    3051            $C$DW$150       .dwtag  DW_TAG_member
    3052                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$24)
    3053                    .dwattr $C$DW$150, DW_AT_name("positiveRefVoltageSourceSelect")
    3054                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3055                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3056                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3057                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3058                    .dwattr $C$DW$150, DW_AT_decl_line(0x42)
    3059                    .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
    3060            
    3061            $C$DW$151       .dwtag  DW_TAG_member
    3062                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$24)
    3063                    .dwattr $C$DW$151, DW_AT_name("negativeRefVoltageSourceSelect")
    3064                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3065                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3066                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3067                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   61

    3068                    .dwattr $C$DW$151, DW_AT_decl_line(0x48)
    3069                    .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    3070            
    3071            $C$DW$152       .dwtag  DW_TAG_member
    3072                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$24)
    3073                    .dwattr $C$DW$152, DW_AT_name("endOfSequence")
    3074                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("endOfSequence")
    3075                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3076                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3077                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3078                    .dwattr $C$DW$152, DW_AT_decl_line(0x51)
    3079                    .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    3080            
    3081                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3082                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3083                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3084                    .dwendtag $C$DW$T$25
    3085            
    3086            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3087                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3088                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3089                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3090                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3091                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3092                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3093            
    3094            
    3095            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3096                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3097                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3098            $C$DW$153       .dwtag  DW_TAG_member
    3099                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    3100                    .dwattr $C$DW$153, DW_AT_name("captureRegister")
    3101                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("captureRegister")
    3102                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3103                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3104                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3105                    .dwattr $C$DW$153, DW_AT_decl_line(0x58)
    3106                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    3107            
    3108            $C$DW$154       .dwtag  DW_TAG_member
    3109                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    3110                    .dwattr $C$DW$154, DW_AT_name("captureMode")
    3111                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("captureMode")
    3112                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3113                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3114                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3115                    .dwattr $C$DW$154, DW_AT_decl_line(0x5f)
    3116                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    3117            
    3118            $C$DW$155       .dwtag  DW_TAG_member
    3119                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    3120                    .dwattr $C$DW$155, DW_AT_name("captureInputSelect")
    3121                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("captureInputSelect")
    3122                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   62

    3123                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3124                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3125                    .dwattr $C$DW$155, DW_AT_decl_line(0x66)
    3126                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    3127            
    3128            $C$DW$156       .dwtag  DW_TAG_member
    3129                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    3130                    .dwattr $C$DW$156, DW_AT_name("synchronizeCaptureSource")
    3131                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3132                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3133                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3134                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3135                    .dwattr $C$DW$156, DW_AT_decl_line(0x6b)
    3136                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    3137            
    3138            $C$DW$157       .dwtag  DW_TAG_member
    3139                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    3140                    .dwattr $C$DW$157, DW_AT_name("captureInterruptEnable")
    3141                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("captureInterruptEnable")
    3142                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3143                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3144                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3145                    .dwattr $C$DW$157, DW_AT_decl_line(0x70)
    3146                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    3147            
    3148            $C$DW$158       .dwtag  DW_TAG_member
    3149                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    3150                    .dwattr $C$DW$158, DW_AT_name("captureOutputMode")
    3151                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("captureOutputMode")
    3152                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3153                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3154                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3155                    .dwattr $C$DW$158, DW_AT_decl_line(0x7b)
    3156                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    3157            
    3158                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3159                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3160                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3161                    .dwendtag $C$DW$T$28
    3162            
    3163            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3164                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3165                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3166                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3167                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3168                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3169                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3170            
    3171            
    3172            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3173                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3174                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3175            $C$DW$159       .dwtag  DW_TAG_member
    3176                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    3177                    .dwattr $C$DW$159, DW_AT_name("compareRegister")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   63

    3178                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("compareRegister")
    3179                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3180                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3181                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3182                    .dwattr $C$DW$159, DW_AT_decl_line(0x145)
    3183                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    3184            
    3185            $C$DW$160       .dwtag  DW_TAG_member
    3186                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    3187                    .dwattr $C$DW$160, DW_AT_name("compareInterruptEnable")
    3188                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("compareInterruptEnable")
    3189                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3190                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3191                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3192                    .dwattr $C$DW$160, DW_AT_decl_line(0x14a)
    3193                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    3194            
    3195            $C$DW$161       .dwtag  DW_TAG_member
    3196                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3197                    .dwattr $C$DW$161, DW_AT_name("compareOutputMode")
    3198                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("compareOutputMode")
    3199                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3200                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3201                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3202                    .dwattr $C$DW$161, DW_AT_decl_line(0x155)
    3203                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3204            
    3205            $C$DW$162       .dwtag  DW_TAG_member
    3206                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    3207                    .dwattr $C$DW$162, DW_AT_name("compareValue")
    3208                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("compareValue")
    3209                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3210                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3211                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3212                    .dwattr $C$DW$162, DW_AT_decl_line(0x157)
    3213                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3214            
    3215                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3216                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3217                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3218                    .dwendtag $C$DW$T$29
    3219            
    3220            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3221                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3222                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3223                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3224                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3225                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3226                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3227            
    3228            
    3229            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3230                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3231                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3232            $C$DW$163       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   64

    3233                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3234                    .dwattr $C$DW$163, DW_AT_name("clockSource")
    3235                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("clockSource")
    3236                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3237                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3238                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3239                    .dwattr $C$DW$163, DW_AT_decl_line(0x20)
    3240                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3241            
    3242            $C$DW$164       .dwtag  DW_TAG_member
    3243                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    3244                    .dwattr $C$DW$164, DW_AT_name("clockSourceDivider")
    3245                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("clockSourceDivider")
    3246                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3247                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3248                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3249                    .dwattr $C$DW$164, DW_AT_decl_line(0x37)
    3250                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    3251            
    3252            $C$DW$165       .dwtag  DW_TAG_member
    3253                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3254                    .dwattr $C$DW$165, DW_AT_name("timerInterruptEnable_TAIE")
    3255                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3256                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3257                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3258                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3259                    .dwattr $C$DW$165, DW_AT_decl_line(0x3c)
    3260                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3261            
    3262            $C$DW$166       .dwtag  DW_TAG_member
    3263                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3264                    .dwattr $C$DW$166, DW_AT_name("timerClear")
    3265                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("timerClear")
    3266                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3267                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3268                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3269                    .dwattr $C$DW$166, DW_AT_decl_line(0x42)
    3270                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3271            
    3272            $C$DW$167       .dwtag  DW_TAG_member
    3273                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$30)
    3274                    .dwattr $C$DW$167, DW_AT_name("startTimer")
    3275                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("startTimer")
    3276                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3277                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3278                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3279                    .dwattr $C$DW$167, DW_AT_decl_line(0x44)
    3280                    .dwattr $C$DW$167, DW_AT_decl_column(0x0a)
    3281            
    3282                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3283                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3284                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3285                    .dwendtag $C$DW$T$31
    3286            
    3287            $C$DW$T$65      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   65

    3288                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3289                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    3290                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3291                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3292                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3293                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3294            
    3295            
    3296            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3297                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3298                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3299            $C$DW$168       .dwtag  DW_TAG_member
    3300                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3301                    .dwattr $C$DW$168, DW_AT_name("clockSource")
    3302                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("clockSource")
    3303                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3304                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3305                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3306                    .dwattr $C$DW$168, DW_AT_decl_line(0x8b)
    3307                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3308            
    3309            $C$DW$169       .dwtag  DW_TAG_member
    3310                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3311                    .dwattr $C$DW$169, DW_AT_name("clockSourceDivider")
    3312                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("clockSourceDivider")
    3313                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3314                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3315                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3316                    .dwattr $C$DW$169, DW_AT_decl_line(0xa2)
    3317                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3318            
    3319            $C$DW$170       .dwtag  DW_TAG_member
    3320                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3321                    .dwattr $C$DW$170, DW_AT_name("timerPeriod")
    3322                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("timerPeriod")
    3323                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3324                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3325                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3326                    .dwattr $C$DW$170, DW_AT_decl_line(0xa4)
    3327                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3328            
    3329            $C$DW$171       .dwtag  DW_TAG_member
    3330                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3331                    .dwattr $C$DW$171, DW_AT_name("timerInterruptEnable_TAIE")
    3332                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3333                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3334                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3335                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3336                    .dwattr $C$DW$171, DW_AT_decl_line(0xa9)
    3337                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3338            
    3339            $C$DW$172       .dwtag  DW_TAG_member
    3340                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3341                    .dwattr $C$DW$172, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3342                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   66

    3343                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3344                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3345                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3346                    .dwattr $C$DW$172, DW_AT_decl_line(0xae)
    3347                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3348            
    3349            $C$DW$173       .dwtag  DW_TAG_member
    3350                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3351                    .dwattr $C$DW$173, DW_AT_name("timerClear")
    3352                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("timerClear")
    3353                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3354                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3355                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3356                    .dwattr $C$DW$173, DW_AT_decl_line(0xb4)
    3357                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3358            
    3359            $C$DW$174       .dwtag  DW_TAG_member
    3360                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$30)
    3361                    .dwattr $C$DW$174, DW_AT_name("startTimer")
    3362                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("startTimer")
    3363                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3364                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3365                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3366                    .dwattr $C$DW$174, DW_AT_decl_line(0xb6)
    3367                    .dwattr $C$DW$174, DW_AT_decl_column(0x0a)
    3368            
    3369                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3370                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3371                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3372                    .dwendtag $C$DW$T$32
    3373            
    3374            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3375                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3376                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3377                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3378                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3379                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3380                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3381            
    3382            
    3383            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3384                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3385                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3386            $C$DW$175       .dwtag  DW_TAG_member
    3387                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3388                    .dwattr $C$DW$175, DW_AT_name("clockSource")
    3389                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("clockSource")
    3390                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3391                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3392                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3393                    .dwattr $C$DW$175, DW_AT_decl_line(0x105)
    3394                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3395            
    3396            $C$DW$176       .dwtag  DW_TAG_member
    3397                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   67

    3398                    .dwattr $C$DW$176, DW_AT_name("clockSourceDivider")
    3399                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("clockSourceDivider")
    3400                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3401                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3402                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3403                    .dwattr $C$DW$176, DW_AT_decl_line(0x11c)
    3404                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    3405            
    3406            $C$DW$177       .dwtag  DW_TAG_member
    3407                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3408                    .dwattr $C$DW$177, DW_AT_name("timerPeriod")
    3409                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("timerPeriod")
    3410                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3411                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3412                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3413                    .dwattr $C$DW$177, DW_AT_decl_line(0x11f)
    3414                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3415            
    3416            $C$DW$178       .dwtag  DW_TAG_member
    3417                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3418                    .dwattr $C$DW$178, DW_AT_name("timerInterruptEnable_TAIE")
    3419                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3420                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3421                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3422                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3423                    .dwattr $C$DW$178, DW_AT_decl_line(0x124)
    3424                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3425            
    3426            $C$DW$179       .dwtag  DW_TAG_member
    3427                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3428                    .dwattr $C$DW$179, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3429                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3430                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3431                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3432                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3433                    .dwattr $C$DW$179, DW_AT_decl_line(0x129)
    3434                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3435            
    3436            $C$DW$180       .dwtag  DW_TAG_member
    3437                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3438                    .dwattr $C$DW$180, DW_AT_name("timerClear")
    3439                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("timerClear")
    3440                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3441                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3442                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3443                    .dwattr $C$DW$180, DW_AT_decl_line(0x12f)
    3444                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3445            
    3446            $C$DW$181       .dwtag  DW_TAG_member
    3447                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$30)
    3448                    .dwattr $C$DW$181, DW_AT_name("startTimer")
    3449                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("startTimer")
    3450                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3451                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3452                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   68

    3453                    .dwattr $C$DW$181, DW_AT_decl_line(0x131)
    3454                    .dwattr $C$DW$181, DW_AT_decl_column(0x0a)
    3455            
    3456                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3457                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3458                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3459                    .dwendtag $C$DW$T$33
    3460            
    3461            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3462                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3463                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3464                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3465                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3466                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3467                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3468            
    3469            
    3470            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3471                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3472                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3473            $C$DW$182       .dwtag  DW_TAG_member
    3474                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    3475                    .dwattr $C$DW$182, DW_AT_name("clockSource")
    3476                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("clockSource")
    3477                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3478                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3479                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3480                    .dwattr $C$DW$182, DW_AT_decl_line(0xc5)
    3481                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3482            
    3483            $C$DW$183       .dwtag  DW_TAG_member
    3484                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3485                    .dwattr $C$DW$183, DW_AT_name("clockSourceDivider")
    3486                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("clockSourceDivider")
    3487                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3488                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3489                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3490                    .dwattr $C$DW$183, DW_AT_decl_line(0xdc)
    3491                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3492            
    3493            $C$DW$184       .dwtag  DW_TAG_member
    3494                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3495                    .dwattr $C$DW$184, DW_AT_name("timerPeriod")
    3496                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("timerPeriod")
    3497                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3498                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3499                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3500                    .dwattr $C$DW$184, DW_AT_decl_line(0xde)
    3501                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3502            
    3503            $C$DW$185       .dwtag  DW_TAG_member
    3504                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$27)
    3505                    .dwattr $C$DW$185, DW_AT_name("compareRegister")
    3506                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("compareRegister")
    3507                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   69

    3508                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3509                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3510                    .dwattr $C$DW$185, DW_AT_decl_line(0xe9)
    3511                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    3512            
    3513            $C$DW$186       .dwtag  DW_TAG_member
    3514                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3515                    .dwattr $C$DW$186, DW_AT_name("compareOutputMode")
    3516                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("compareOutputMode")
    3517                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3518                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3519                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3520                    .dwattr $C$DW$186, DW_AT_decl_line(0xf4)
    3521                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3522            
    3523            $C$DW$187       .dwtag  DW_TAG_member
    3524                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3525                    .dwattr $C$DW$187, DW_AT_name("dutyCycle")
    3526                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("dutyCycle")
    3527                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3528                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3529                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3530                    .dwattr $C$DW$187, DW_AT_decl_line(0xf6)
    3531                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3532            
    3533                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3534                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3535                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3536                    .dwendtag $C$DW$T$34
    3537            
    3538            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3539                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3540                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3541                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3542                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3543                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3544                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3545            
    3546            
    3547            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3548                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3549                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3550            $C$DW$188       .dwtag  DW_TAG_member
    3551                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3552                    .dwattr $C$DW$188, DW_AT_name("captureRegister")
    3553                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("captureRegister")
    3554                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3555                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3556                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3557                    .dwattr $C$DW$188, DW_AT_decl_line(0xa0)
    3558                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3559            
    3560            $C$DW$189       .dwtag  DW_TAG_member
    3561                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3562                    .dwattr $C$DW$189, DW_AT_name("captureMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   70

    3563                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("captureMode")
    3564                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3565                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3566                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3567                    .dwattr $C$DW$189, DW_AT_decl_line(0xa7)
    3568                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3569            
    3570            $C$DW$190       .dwtag  DW_TAG_member
    3571                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3572                    .dwattr $C$DW$190, DW_AT_name("captureInputSelect")
    3573                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("captureInputSelect")
    3574                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3575                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3576                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3577                    .dwattr $C$DW$190, DW_AT_decl_line(0xae)
    3578                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3579            
    3580            $C$DW$191       .dwtag  DW_TAG_member
    3581                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3582                    .dwattr $C$DW$191, DW_AT_name("synchronizeCaptureSource")
    3583                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3584                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3585                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3586                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3587                    .dwattr $C$DW$191, DW_AT_decl_line(0xb3)
    3588                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3589            
    3590            $C$DW$192       .dwtag  DW_TAG_member
    3591                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    3592                    .dwattr $C$DW$192, DW_AT_name("captureInterruptEnable")
    3593                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("captureInterruptEnable")
    3594                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3595                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3596                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3597                    .dwattr $C$DW$192, DW_AT_decl_line(0xb8)
    3598                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    3599            
    3600            $C$DW$193       .dwtag  DW_TAG_member
    3601                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3602                    .dwattr $C$DW$193, DW_AT_name("captureOutputMode")
    3603                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("captureOutputMode")
    3604                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3605                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3606                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3607                    .dwattr $C$DW$193, DW_AT_decl_line(0xc3)
    3608                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3609            
    3610                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3611                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3612                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3613                    .dwendtag $C$DW$T$35
    3614            
    3615            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3616                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3617                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   71

    3618                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3619                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3620                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3621                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3622            
    3623            
    3624            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3625                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3626                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3627            $C$DW$194       .dwtag  DW_TAG_member
    3628                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3629                    .dwattr $C$DW$194, DW_AT_name("compareRegister")
    3630                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("compareRegister")
    3631                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3632                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3633                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3634                    .dwattr $C$DW$194, DW_AT_decl_line(0x146)
    3635                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3636            
    3637            $C$DW$195       .dwtag  DW_TAG_member
    3638                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3639                    .dwattr $C$DW$195, DW_AT_name("compareInterruptEnable")
    3640                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("compareInterruptEnable")
    3641                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3642                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3643                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3644                    .dwattr $C$DW$195, DW_AT_decl_line(0x14b)
    3645                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3646            
    3647            $C$DW$196       .dwtag  DW_TAG_member
    3648                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3649                    .dwattr $C$DW$196, DW_AT_name("compareOutputMode")
    3650                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("compareOutputMode")
    3651                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3652                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3653                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3654                    .dwattr $C$DW$196, DW_AT_decl_line(0x156)
    3655                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3656            
    3657            $C$DW$197       .dwtag  DW_TAG_member
    3658                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3659                    .dwattr $C$DW$197, DW_AT_name("compareValue")
    3660                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("compareValue")
    3661                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3662                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3663                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3664                    .dwattr $C$DW$197, DW_AT_decl_line(0x158)
    3665                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3666            
    3667                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3668                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3669                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3670                    .dwendtag $C$DW$T$36
    3671            
    3672            $C$DW$T$70      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   72

    3673                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    3674                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    3675                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3676                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3677                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    3678                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3679            
    3680            
    3681            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3682                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    3683                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    3684            $C$DW$198       .dwtag  DW_TAG_member
    3685                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3686                    .dwattr $C$DW$198, DW_AT_name("clockSource")
    3687                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("clockSource")
    3688                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3689                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3690                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3691                    .dwattr $C$DW$198, DW_AT_decl_line(0xd3)
    3692                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3693            
    3694            $C$DW$199       .dwtag  DW_TAG_member
    3695                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    3696                    .dwattr $C$DW$199, DW_AT_name("clockSourceDivider")
    3697                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("clockSourceDivider")
    3698                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3699                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3700                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3701                    .dwattr $C$DW$199, DW_AT_decl_line(0xea)
    3702                    .dwattr $C$DW$199, DW_AT_decl_column(0x0e)
    3703            
    3704            $C$DW$200       .dwtag  DW_TAG_member
    3705                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3706                    .dwattr $C$DW$200, DW_AT_name("timerInterruptEnable_TBIE")
    3707                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3708                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3709                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3710                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3711                    .dwattr $C$DW$200, DW_AT_decl_line(0xef)
    3712                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3713            
    3714            $C$DW$201       .dwtag  DW_TAG_member
    3715                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3716                    .dwattr $C$DW$201, DW_AT_name("timerClear")
    3717                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("timerClear")
    3718                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3719                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3720                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3721                    .dwattr $C$DW$201, DW_AT_decl_line(0xf5)
    3722                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3723            
    3724            $C$DW$202       .dwtag  DW_TAG_member
    3725                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$30)
    3726                    .dwattr $C$DW$202, DW_AT_name("startTimer")
    3727                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("startTimer")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   73

    3728                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3729                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3730                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3731                    .dwattr $C$DW$202, DW_AT_decl_line(0xf7)
    3732                    .dwattr $C$DW$202, DW_AT_decl_column(0x0a)
    3733            
    3734                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3735                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    3736                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3737                    .dwendtag $C$DW$T$37
    3738            
    3739            $C$DW$T$71      .dwtag  DW_TAG_typedef
    3740                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    3741                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    3742                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3743                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3744                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    3745                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    3746            
    3747            
    3748            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3749                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    3750                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    3751            $C$DW$203       .dwtag  DW_TAG_member
    3752                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3753                    .dwattr $C$DW$203, DW_AT_name("clockSource")
    3754                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("clockSource")
    3755                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3756                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3757                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3758                    .dwattr $C$DW$203, DW_AT_decl_line(0x107)
    3759                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3760            
    3761            $C$DW$204       .dwtag  DW_TAG_member
    3762                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3763                    .dwattr $C$DW$204, DW_AT_name("clockSourceDivider")
    3764                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("clockSourceDivider")
    3765                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3766                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3767                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3768                    .dwattr $C$DW$204, DW_AT_decl_line(0x11e)
    3769                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3770            
    3771            $C$DW$205       .dwtag  DW_TAG_member
    3772                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3773                    .dwattr $C$DW$205, DW_AT_name("timerPeriod")
    3774                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("timerPeriod")
    3775                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3776                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3777                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3778                    .dwattr $C$DW$205, DW_AT_decl_line(0x120)
    3779                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3780            
    3781            $C$DW$206       .dwtag  DW_TAG_member
    3782                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   74

    3783                    .dwattr $C$DW$206, DW_AT_name("timerInterruptEnable_TBIE")
    3784                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3785                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3786                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3787                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3788                    .dwattr $C$DW$206, DW_AT_decl_line(0x125)
    3789                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    3790            
    3791            $C$DW$207       .dwtag  DW_TAG_member
    3792                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3793                    .dwattr $C$DW$207, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3794                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3795                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3796                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3797                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3798                    .dwattr $C$DW$207, DW_AT_decl_line(0x12a)
    3799                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3800            
    3801            $C$DW$208       .dwtag  DW_TAG_member
    3802                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3803                    .dwattr $C$DW$208, DW_AT_name("timerClear")
    3804                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("timerClear")
    3805                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3806                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3807                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3808                    .dwattr $C$DW$208, DW_AT_decl_line(0x130)
    3809                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3810            
    3811            $C$DW$209       .dwtag  DW_TAG_member
    3812                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$30)
    3813                    .dwattr $C$DW$209, DW_AT_name("startTimer")
    3814                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("startTimer")
    3815                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3816                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3817                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3818                    .dwattr $C$DW$209, DW_AT_decl_line(0x132)
    3819                    .dwattr $C$DW$209, DW_AT_decl_column(0x0a)
    3820            
    3821                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3822                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    3823                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3824                    .dwendtag $C$DW$T$38
    3825            
    3826            $C$DW$T$72      .dwtag  DW_TAG_typedef
    3827                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    3828                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    3829                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3830                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3831                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    3832                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3833            
    3834            
    3835            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3836                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    3837                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   75

    3838            $C$DW$210       .dwtag  DW_TAG_member
    3839                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3840                    .dwattr $C$DW$210, DW_AT_name("clockSource")
    3841                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("clockSource")
    3842                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3843                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3844                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3845                    .dwattr $C$DW$210, DW_AT_decl_line(0x60)
    3846                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3847            
    3848            $C$DW$211       .dwtag  DW_TAG_member
    3849                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3850                    .dwattr $C$DW$211, DW_AT_name("clockSourceDivider")
    3851                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("clockSourceDivider")
    3852                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3853                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3854                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3855                    .dwattr $C$DW$211, DW_AT_decl_line(0x77)
    3856                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    3857            
    3858            $C$DW$212       .dwtag  DW_TAG_member
    3859                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    3860                    .dwattr $C$DW$212, DW_AT_name("timerPeriod")
    3861                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("timerPeriod")
    3862                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3863                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3864                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3865                    .dwattr $C$DW$212, DW_AT_decl_line(0x7a)
    3866                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3867            
    3868            $C$DW$213       .dwtag  DW_TAG_member
    3869                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    3870                    .dwattr $C$DW$213, DW_AT_name("timerInterruptEnable_TBIE")
    3871                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3872                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3873                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3874                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3875                    .dwattr $C$DW$213, DW_AT_decl_line(0x7f)
    3876                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    3877            
    3878            $C$DW$214       .dwtag  DW_TAG_member
    3879                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    3880                    .dwattr $C$DW$214, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3881                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3882                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3883                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3884                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3885                    .dwattr $C$DW$214, DW_AT_decl_line(0x84)
    3886                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    3887            
    3888            $C$DW$215       .dwtag  DW_TAG_member
    3889                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    3890                    .dwattr $C$DW$215, DW_AT_name("timerClear")
    3891                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("timerClear")
    3892                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   76

    3893                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3894                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3895                    .dwattr $C$DW$215, DW_AT_decl_line(0x8a)
    3896                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3897            
    3898            $C$DW$216       .dwtag  DW_TAG_member
    3899                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$30)
    3900                    .dwattr $C$DW$216, DW_AT_name("startTimer")
    3901                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("startTimer")
    3902                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3903                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3904                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3905                    .dwattr $C$DW$216, DW_AT_decl_line(0x8c)
    3906                    .dwattr $C$DW$216, DW_AT_decl_column(0x0a)
    3907            
    3908                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3909                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    3910                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    3911                    .dwendtag $C$DW$T$39
    3912            
    3913            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3914                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3915                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    3916                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3917                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3918                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3919                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3920            
    3921            
    3922            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3923                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3924                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3925            $C$DW$217       .dwtag  DW_TAG_member
    3926                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    3927                    .dwattr $C$DW$217, DW_AT_name("clockSource")
    3928                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("clockSource")
    3929                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3930                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3931                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3932                    .dwattr $C$DW$217, DW_AT_decl_line(0x20)
    3933                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    3934            
    3935            $C$DW$218       .dwtag  DW_TAG_member
    3936                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    3937                    .dwattr $C$DW$218, DW_AT_name("clockSourceDivider")
    3938                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("clockSourceDivider")
    3939                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3940                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3941                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3942                    .dwattr $C$DW$218, DW_AT_decl_line(0x37)
    3943                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    3944            
    3945            $C$DW$219       .dwtag  DW_TAG_member
    3946                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    3947                    .dwattr $C$DW$219, DW_AT_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   77

    3948                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("timerPeriod")
    3949                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3950                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3951                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3952                    .dwattr $C$DW$219, DW_AT_decl_line(0x39)
    3953                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3954            
    3955            $C$DW$220       .dwtag  DW_TAG_member
    3956                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    3957                    .dwattr $C$DW$220, DW_AT_name("compareRegister")
    3958                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("compareRegister")
    3959                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3960                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3961                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3962                    .dwattr $C$DW$220, DW_AT_decl_line(0x44)
    3963                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    3964            
    3965            $C$DW$221       .dwtag  DW_TAG_member
    3966                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    3967                    .dwattr $C$DW$221, DW_AT_name("compareOutputMode")
    3968                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("compareOutputMode")
    3969                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3970                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3971                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3972                    .dwattr $C$DW$221, DW_AT_decl_line(0x4f)
    3973                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    3974            
    3975            $C$DW$222       .dwtag  DW_TAG_member
    3976                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    3977                    .dwattr $C$DW$222, DW_AT_name("dutyCycle")
    3978                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("dutyCycle")
    3979                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3980                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3981                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3982                    .dwattr $C$DW$222, DW_AT_decl_line(0x51)
    3983                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    3984            
    3985                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3986                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3987                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3988                    .dwendtag $C$DW$T$40
    3989            
    3990            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3991                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3992                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3993                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3994                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3995                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3996                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3997            
    3998            
    3999            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4000                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4001                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4002            $C$DW$223       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   78

    4003                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$24)
    4004                    .dwattr $C$DW$223, DW_AT_name("selectClockSource")
    4005                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("selectClockSource")
    4006                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4007                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4008                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4009                    .dwattr $C$DW$223, DW_AT_decl_line(0x1c)
    4010                    .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    4011            
    4012            $C$DW$224       .dwtag  DW_TAG_member
    4013                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    4014                    .dwattr $C$DW$224, DW_AT_name("clockPrescalar")
    4015                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("clockPrescalar")
    4016                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4017                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4018                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4019                    .dwattr $C$DW$224, DW_AT_decl_line(0x1e)
    4020                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    4021            
    4022            $C$DW$225       .dwtag  DW_TAG_member
    4023                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$24)
    4024                    .dwattr $C$DW$225, DW_AT_name("firstModReg")
    4025                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("firstModReg")
    4026                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4027                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4028                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4029                    .dwattr $C$DW$225, DW_AT_decl_line(0x22)
    4030                    .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    4031            
    4032            $C$DW$226       .dwtag  DW_TAG_member
    4033                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$24)
    4034                    .dwattr $C$DW$226, DW_AT_name("secondModReg")
    4035                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("secondModReg")
    4036                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4037                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4038                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4039                    .dwattr $C$DW$226, DW_AT_decl_line(0x26)
    4040                    .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    4041            
    4042            $C$DW$227       .dwtag  DW_TAG_member
    4043                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$24)
    4044                    .dwattr $C$DW$227, DW_AT_name("parity")
    4045                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("parity")
    4046                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4047                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4048                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4049                    .dwattr $C$DW$227, DW_AT_decl_line(0x2c)
    4050                    .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    4051            
    4052            $C$DW$228       .dwtag  DW_TAG_member
    4053                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$24)
    4054                    .dwattr $C$DW$228, DW_AT_name("msborLsbFirst")
    4055                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("msborLsbFirst")
    4056                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4057                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   79

    4058                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4059                    .dwattr $C$DW$228, DW_AT_decl_line(0x31)
    4060                    .dwattr $C$DW$228, DW_AT_decl_column(0x0d)
    4061            
    4062            $C$DW$229       .dwtag  DW_TAG_member
    4063                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$24)
    4064                    .dwattr $C$DW$229, DW_AT_name("numberofStopBits")
    4065                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("numberofStopBits")
    4066                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4067                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4068                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4069                    .dwattr $C$DW$229, DW_AT_decl_line(0x36)
    4070                    .dwattr $C$DW$229, DW_AT_decl_column(0x0d)
    4071            
    4072            $C$DW$230       .dwtag  DW_TAG_member
    4073                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$24)
    4074                    .dwattr $C$DW$230, DW_AT_name("uartMode")
    4075                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("uartMode")
    4076                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4077                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4078                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4079                    .dwattr $C$DW$230, DW_AT_decl_line(0x3d)
    4080                    .dwattr $C$DW$230, DW_AT_decl_column(0x0d)
    4081            
    4082            $C$DW$231       .dwtag  DW_TAG_member
    4083                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$24)
    4084                    .dwattr $C$DW$231, DW_AT_name("overSampling")
    4085                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("overSampling")
    4086                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4087                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4088                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4089                    .dwattr $C$DW$231, DW_AT_decl_line(0x42)
    4090                    .dwattr $C$DW$231, DW_AT_decl_column(0x0d)
    4091            
    4092                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4093                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4094                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4095                    .dwendtag $C$DW$T$41
    4096            
    4097            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4098                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4099                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4100                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4101                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4102                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4103                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4104            
    4105            
    4106            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4107                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4108                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4109            $C$DW$232       .dwtag  DW_TAG_member
    4110                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$43)
    4111                    .dwattr $C$DW$232, DW_AT_name("clockSourceFrequency")
    4112                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("clockSourceFrequency")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   80

    4113                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4114                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4115                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4116                    .dwattr $C$DW$232, DW_AT_decl_line(0x31)
    4117                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    4118            
    4119            $C$DW$233       .dwtag  DW_TAG_member
    4120                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$43)
    4121                    .dwattr $C$DW$233, DW_AT_name("desiredSpiClock")
    4122                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("desiredSpiClock")
    4123                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4124                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4125                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4126                    .dwattr $C$DW$233, DW_AT_decl_line(0x33)
    4127                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4128            
    4129                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4130                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4131                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4132                    .dwendtag $C$DW$T$44
    4133            
    4134            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4135                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4136                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4137                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4138                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4139                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4140                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4141            
    4142            
    4143            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4144                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4145                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4146            $C$DW$234       .dwtag  DW_TAG_member
    4147                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$24)
    4148                    .dwattr $C$DW$234, DW_AT_name("selectClockSource")
    4149                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("selectClockSource")
    4150                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4151                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4152                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4153                    .dwattr $C$DW$234, DW_AT_decl_line(0x14)
    4154                    .dwattr $C$DW$234, DW_AT_decl_column(0x0d)
    4155            
    4156            $C$DW$235       .dwtag  DW_TAG_member
    4157                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$43)
    4158                    .dwattr $C$DW$235, DW_AT_name("clockSourceFrequency")
    4159                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("clockSourceFrequency")
    4160                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4161                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4162                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4163                    .dwattr $C$DW$235, DW_AT_decl_line(0x16)
    4164                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    4165            
    4166            $C$DW$236       .dwtag  DW_TAG_member
    4167                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$43)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
flight_recorder.asm                                                  PAGE   81

    4168                    .dwattr $C$DW$236, DW_AT_name("desiredSpiClock")
    4169                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("desiredSpiClock")
    4170                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4171                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4172                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4173                    .dwattr $C$DW$236, DW_AT_decl_line(0x18)
    4174                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4175            
    4176            $C$DW$237       .dwtag  DW_TAG_member
    4177                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$24)
    4178                    .dwattr $C$DW$237, DW_AT_name("msbFirst")
    4179                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("msbFirst")
    4180                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4181                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4182                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4183                    .dwattr $C$DW$237, DW_AT_decl_line(0x1d)
    4184                    .dwattr $C$DW$237, DW_AT_decl_column(0x0d)
