MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:45:59 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Fuel_Gauge.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12                    .global mode
      13                    .common mode,2,2
      14            $C$DW$1 .dwtag  DW_TAG_variable
      15                    .dwattr $C$DW$1, DW_AT_name("mode")
      16                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("mode")

    3518            $C$DW$183       .dwtag  DW_TAG_enumerator
    3519                    .dwattr $C$DW$183, DW_AT_name("crc2")
    3520                    .dwattr $C$DW$183, DW_AT_const_value(0x06)
    3521                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3522                    .dwattr $C$DW$183, DW_AT_decl_line(0x76)
    3523                    .dwattr $C$DW$183, DW_AT_decl_column(0x05)
    3524            
    3525            $C$DW$184       .dwtag  DW_TAG_enumerator
    3526                    .dwattr $C$DW$184, DW_AT_name("ack")
    3527                    .dwattr $C$DW$184, DW_AT_const_value(0x07)
    3528                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3529                    .dwattr $C$DW$184, DW_AT_decl_line(0x77)
    3530                    .dwattr $C$DW$184, DW_AT_decl_column(0x05)
    3531            
    3532            $C$DW$185       .dwtag  DW_TAG_enumerator
    3533                    .dwattr $C$DW$185, DW_AT_name("var")
    3534                    .dwattr $C$DW$185, DW_AT_const_value(0x08)
    3535                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3536                    .dwattr $C$DW$185, DW_AT_decl_line(0x78)
    3537                    .dwattr $C$DW$185, DW_AT_decl_column(0x05)
    3538            
    3539            $C$DW$186       .dwtag  DW_TAG_enumerator
    3540                    .dwattr $C$DW$186, DW_AT_name("UGmsg")
    3541                    .dwattr $C$DW$186, DW_AT_const_value(0x09)
    3542                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3543                    .dwattr $C$DW$186, DW_AT_decl_line(0x79)
    3544                    .dwattr $C$DW$186, DW_AT_decl_column(0x05)
    3545            
    3546                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3547                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    3548                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    3549                    .dwendtag $C$DW$T$57
    3550            
    3551            $C$DW$T$58      .dwtag  DW_TAG_typedef
    3552                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    3553                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3554                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3555                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3556                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    3557                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3558            
    3559            
    3560            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3561                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3562            $C$DW$187       .dwtag  DW_TAG_enumerator
    3563                    .dwattr $C$DW$187, DW_AT_name("init")
    3564                    .dwattr $C$DW$187, DW_AT_const_value(0x00)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   74

    3565                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3566                    .dwattr $C$DW$187, DW_AT_decl_line(0x80)
    3567                    .dwattr $C$DW$187, DW_AT_decl_column(0x05)
    3568            
    3569            $C$DW$188       .dwtag  DW_TAG_enumerator
    3570                    .dwattr $C$DW$188, DW_AT_name("running")
    3571                    .dwattr $C$DW$188, DW_AT_const_value(0x01)
    3572                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3573                    .dwattr $C$DW$188, DW_AT_decl_line(0x80)
    3574                    .dwattr $C$DW$188, DW_AT_decl_column(0x0b)
    3575            
    3576            $C$DW$189       .dwtag  DW_TAG_enumerator
    3577                    .dwattr $C$DW$189, DW_AT_name("wait")
    3578                    .dwattr $C$DW$189, DW_AT_const_value(0x02)
    3579                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3580                    .dwattr $C$DW$189, DW_AT_decl_line(0x80)
    3581                    .dwattr $C$DW$189, DW_AT_decl_column(0x14)
    3582            
    3583                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3584                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    3585                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3586                    .dwendtag $C$DW$T$59
    3587            
    3588            $C$DW$T$60      .dwtag  DW_TAG_typedef
    3589                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    3590                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3591                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3592                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3593                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    3594                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3595            
    3596            
    3597            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3598                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3599            $C$DW$190       .dwtag  DW_TAG_member
    3600                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$14)
    3601                    .dwattr $C$DW$190, DW_AT_name("__max_align1")
    3602                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("__max_align1")
    3603                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3604                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3605                    .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3606                    .dwattr $C$DW$190, DW_AT_decl_line(0x7b)
    3607                    .dwattr $C$DW$190, DW_AT_decl_column(0x0c)
    3608            
    3609            $C$DW$191       .dwtag  DW_TAG_member
    3610                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$18)
    3611                    .dwattr $C$DW$191, DW_AT_name("__max_align2")
    3612                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("__max_align2")
    3613                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3614                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3615                    .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3616                    .dwattr $C$DW$191, DW_AT_decl_line(0x7c)
    3617                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3618            
    3619                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   75

    3620                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3621                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3622                    .dwendtag $C$DW$T$22
    3623            
    3624            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3625                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3626                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3627                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3628                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3629                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3630                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3631            
    3632            
    3633            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3634                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3635                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    3636            $C$DW$192       .dwtag  DW_TAG_member
    3637                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$24)
    3638                    .dwattr $C$DW$192, DW_AT_name("memoryBufferControlIndex")
    3639                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3640                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3641                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3642                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3643                    .dwattr $C$DW$192, DW_AT_decl_line(0x27)
    3644                    .dwattr $C$DW$192, DW_AT_decl_column(0x0d)
    3645            
    3646            $C$DW$193       .dwtag  DW_TAG_member
    3647                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$24)
    3648                    .dwattr $C$DW$193, DW_AT_name("inputSourceSelect")
    3649                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("inputSourceSelect")
    3650                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3651                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3652                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3653                    .dwattr $C$DW$193, DW_AT_decl_line(0x3b)
    3654                    .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    3655            
    3656            $C$DW$194       .dwtag  DW_TAG_member
    3657                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$24)
    3658                    .dwattr $C$DW$194, DW_AT_name("positiveRefVoltageSourceSelect")
    3659                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3660                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3661                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3662                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3663                    .dwattr $C$DW$194, DW_AT_decl_line(0x42)
    3664                    .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    3665            
    3666            $C$DW$195       .dwtag  DW_TAG_member
    3667                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$24)
    3668                    .dwattr $C$DW$195, DW_AT_name("negativeRefVoltageSourceSelect")
    3669                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3670                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3671                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3672                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3673                    .dwattr $C$DW$195, DW_AT_decl_line(0x48)
    3674                    .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   76

    3675            
    3676            $C$DW$196       .dwtag  DW_TAG_member
    3677                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$24)
    3678                    .dwattr $C$DW$196, DW_AT_name("endOfSequence")
    3679                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("endOfSequence")
    3680                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3681                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3682                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3683                    .dwattr $C$DW$196, DW_AT_decl_line(0x51)
    3684                    .dwattr $C$DW$196, DW_AT_decl_column(0x0d)
    3685            
    3686                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3687                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3688                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3689                    .dwendtag $C$DW$T$25
    3690            
    3691            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3692                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3693                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3694                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3695                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3696                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3697                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3698            
    3699            
    3700            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3701                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3702                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3703            $C$DW$197       .dwtag  DW_TAG_member
    3704                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3705                    .dwattr $C$DW$197, DW_AT_name("captureRegister")
    3706                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("captureRegister")
    3707                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3708                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3709                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3710                    .dwattr $C$DW$197, DW_AT_decl_line(0x58)
    3711                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3712            
    3713            $C$DW$198       .dwtag  DW_TAG_member
    3714                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3715                    .dwattr $C$DW$198, DW_AT_name("captureMode")
    3716                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("captureMode")
    3717                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3718                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3719                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3720                    .dwattr $C$DW$198, DW_AT_decl_line(0x5f)
    3721                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3722            
    3723            $C$DW$199       .dwtag  DW_TAG_member
    3724                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    3725                    .dwattr $C$DW$199, DW_AT_name("captureInputSelect")
    3726                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("captureInputSelect")
    3727                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3728                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3729                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   77

    3730                    .dwattr $C$DW$199, DW_AT_decl_line(0x66)
    3731                    .dwattr $C$DW$199, DW_AT_decl_column(0x0e)
    3732            
    3733            $C$DW$200       .dwtag  DW_TAG_member
    3734                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3735                    .dwattr $C$DW$200, DW_AT_name("synchronizeCaptureSource")
    3736                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3737                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3738                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3739                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3740                    .dwattr $C$DW$200, DW_AT_decl_line(0x6b)
    3741                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3742            
    3743            $C$DW$201       .dwtag  DW_TAG_member
    3744                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3745                    .dwattr $C$DW$201, DW_AT_name("captureInterruptEnable")
    3746                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("captureInterruptEnable")
    3747                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3748                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3749                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3750                    .dwattr $C$DW$201, DW_AT_decl_line(0x70)
    3751                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3752            
    3753            $C$DW$202       .dwtag  DW_TAG_member
    3754                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3755                    .dwattr $C$DW$202, DW_AT_name("captureOutputMode")
    3756                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("captureOutputMode")
    3757                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3758                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3759                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3760                    .dwattr $C$DW$202, DW_AT_decl_line(0x7b)
    3761                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3762            
    3763                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3764                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3765                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3766                    .dwendtag $C$DW$T$28
    3767            
    3768            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3769                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3770                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3771                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3772                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3773                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3774                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3775            
    3776            
    3777            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3778                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3779                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3780            $C$DW$203       .dwtag  DW_TAG_member
    3781                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3782                    .dwattr $C$DW$203, DW_AT_name("compareRegister")
    3783                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("compareRegister")
    3784                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   78

    3785                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3786                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3787                    .dwattr $C$DW$203, DW_AT_decl_line(0x145)
    3788                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3789            
    3790            $C$DW$204       .dwtag  DW_TAG_member
    3791                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3792                    .dwattr $C$DW$204, DW_AT_name("compareInterruptEnable")
    3793                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("compareInterruptEnable")
    3794                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3795                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3796                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3797                    .dwattr $C$DW$204, DW_AT_decl_line(0x14a)
    3798                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3799            
    3800            $C$DW$205       .dwtag  DW_TAG_member
    3801                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3802                    .dwattr $C$DW$205, DW_AT_name("compareOutputMode")
    3803                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("compareOutputMode")
    3804                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3805                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3806                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3807                    .dwattr $C$DW$205, DW_AT_decl_line(0x155)
    3808                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3809            
    3810            $C$DW$206       .dwtag  DW_TAG_member
    3811                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3812                    .dwattr $C$DW$206, DW_AT_name("compareValue")
    3813                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("compareValue")
    3814                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3815                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3816                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3817                    .dwattr $C$DW$206, DW_AT_decl_line(0x157)
    3818                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    3819            
    3820                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3821                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3822                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3823                    .dwendtag $C$DW$T$29
    3824            
    3825            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3826                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3827                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3828                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3829                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3830                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3831                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3832            
    3833            
    3834            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3835                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3836                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3837            $C$DW$207       .dwtag  DW_TAG_member
    3838                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3839                    .dwattr $C$DW$207, DW_AT_name("clockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   79

    3840                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("clockSource")
    3841                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3843                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3844                    .dwattr $C$DW$207, DW_AT_decl_line(0x20)
    3845                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3846            
    3847            $C$DW$208       .dwtag  DW_TAG_member
    3848                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3849                    .dwattr $C$DW$208, DW_AT_name("clockSourceDivider")
    3850                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("clockSourceDivider")
    3851                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3852                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3853                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3854                    .dwattr $C$DW$208, DW_AT_decl_line(0x37)
    3855                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3856            
    3857            $C$DW$209       .dwtag  DW_TAG_member
    3858                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3859                    .dwattr $C$DW$209, DW_AT_name("timerInterruptEnable_TAIE")
    3860                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3861                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3862                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3863                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3864                    .dwattr $C$DW$209, DW_AT_decl_line(0x3c)
    3865                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3866            
    3867            $C$DW$210       .dwtag  DW_TAG_member
    3868                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3869                    .dwattr $C$DW$210, DW_AT_name("timerClear")
    3870                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("timerClear")
    3871                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3872                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3873                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3874                    .dwattr $C$DW$210, DW_AT_decl_line(0x42)
    3875                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3876            
    3877            $C$DW$211       .dwtag  DW_TAG_member
    3878                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$30)
    3879                    .dwattr $C$DW$211, DW_AT_name("startTimer")
    3880                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("startTimer")
    3881                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3882                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3883                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3884                    .dwattr $C$DW$211, DW_AT_decl_line(0x44)
    3885                    .dwattr $C$DW$211, DW_AT_decl_column(0x0a)
    3886            
    3887                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3888                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3889                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3890                    .dwendtag $C$DW$T$31
    3891            
    3892            $C$DW$T$65      .dwtag  DW_TAG_typedef
    3893                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3894                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   80

    3895                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3896                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3897                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3898                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3899            
    3900            
    3901            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3902                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3903                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3904            $C$DW$212       .dwtag  DW_TAG_member
    3905                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    3906                    .dwattr $C$DW$212, DW_AT_name("clockSource")
    3907                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("clockSource")
    3908                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3909                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3910                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3911                    .dwattr $C$DW$212, DW_AT_decl_line(0x8b)
    3912                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3913            
    3914            $C$DW$213       .dwtag  DW_TAG_member
    3915                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    3916                    .dwattr $C$DW$213, DW_AT_name("clockSourceDivider")
    3917                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("clockSourceDivider")
    3918                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3919                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3920                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3921                    .dwattr $C$DW$213, DW_AT_decl_line(0xa2)
    3922                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    3923            
    3924            $C$DW$214       .dwtag  DW_TAG_member
    3925                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    3926                    .dwattr $C$DW$214, DW_AT_name("timerPeriod")
    3927                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("timerPeriod")
    3928                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3929                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3930                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3931                    .dwattr $C$DW$214, DW_AT_decl_line(0xa4)
    3932                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    3933            
    3934            $C$DW$215       .dwtag  DW_TAG_member
    3935                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    3936                    .dwattr $C$DW$215, DW_AT_name("timerInterruptEnable_TAIE")
    3937                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3938                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3939                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3940                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3941                    .dwattr $C$DW$215, DW_AT_decl_line(0xa9)
    3942                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3943            
    3944            $C$DW$216       .dwtag  DW_TAG_member
    3945                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    3946                    .dwattr $C$DW$216, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3947                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3948                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3949                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   81

    3950                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3951                    .dwattr $C$DW$216, DW_AT_decl_line(0xae)
    3952                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    3953            
    3954            $C$DW$217       .dwtag  DW_TAG_member
    3955                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    3956                    .dwattr $C$DW$217, DW_AT_name("timerClear")
    3957                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("timerClear")
    3958                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3959                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3960                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3961                    .dwattr $C$DW$217, DW_AT_decl_line(0xb4)
    3962                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    3963            
    3964            $C$DW$218       .dwtag  DW_TAG_member
    3965                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$30)
    3966                    .dwattr $C$DW$218, DW_AT_name("startTimer")
    3967                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("startTimer")
    3968                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3969                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3970                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3971                    .dwattr $C$DW$218, DW_AT_decl_line(0xb6)
    3972                    .dwattr $C$DW$218, DW_AT_decl_column(0x0a)
    3973            
    3974                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3975                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3976                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3977                    .dwendtag $C$DW$T$32
    3978            
    3979            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3980                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3981                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3982                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3983                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3984                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3985                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3986            
    3987            
    3988            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3989                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3990                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3991            $C$DW$219       .dwtag  DW_TAG_member
    3992                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    3993                    .dwattr $C$DW$219, DW_AT_name("clockSource")
    3994                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("clockSource")
    3995                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3996                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3997                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3998                    .dwattr $C$DW$219, DW_AT_decl_line(0x105)
    3999                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    4000            
    4001            $C$DW$220       .dwtag  DW_TAG_member
    4002                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    4003                    .dwattr $C$DW$220, DW_AT_name("clockSourceDivider")
    4004                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   82

    4005                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4006                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4007                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4008                    .dwattr $C$DW$220, DW_AT_decl_line(0x11c)
    4009                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    4010            
    4011            $C$DW$221       .dwtag  DW_TAG_member
    4012                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    4013                    .dwattr $C$DW$221, DW_AT_name("timerPeriod")
    4014                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("timerPeriod")
    4015                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4016                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4017                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4018                    .dwattr $C$DW$221, DW_AT_decl_line(0x11f)
    4019                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    4020            
    4021            $C$DW$222       .dwtag  DW_TAG_member
    4022                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    4023                    .dwattr $C$DW$222, DW_AT_name("timerInterruptEnable_TAIE")
    4024                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4025                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4026                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4027                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4028                    .dwattr $C$DW$222, DW_AT_decl_line(0x124)
    4029                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    4030            
    4031            $C$DW$223       .dwtag  DW_TAG_member
    4032                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    4033                    .dwattr $C$DW$223, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4034                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4035                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4036                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4037                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4038                    .dwattr $C$DW$223, DW_AT_decl_line(0x129)
    4039                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    4040            
    4041            $C$DW$224       .dwtag  DW_TAG_member
    4042                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    4043                    .dwattr $C$DW$224, DW_AT_name("timerClear")
    4044                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("timerClear")
    4045                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4046                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4047                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4048                    .dwattr $C$DW$224, DW_AT_decl_line(0x12f)
    4049                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    4050            
    4051            $C$DW$225       .dwtag  DW_TAG_member
    4052                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$30)
    4053                    .dwattr $C$DW$225, DW_AT_name("startTimer")
    4054                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("startTimer")
    4055                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4056                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4057                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4058                    .dwattr $C$DW$225, DW_AT_decl_line(0x131)
    4059                    .dwattr $C$DW$225, DW_AT_decl_column(0x0a)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   83

    4060            
    4061                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4062                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    4063                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4064                    .dwendtag $C$DW$T$33
    4065            
    4066            $C$DW$T$67      .dwtag  DW_TAG_typedef
    4067                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    4068                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    4069                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4070                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4071                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    4072                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    4073            
    4074            
    4075            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4076                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    4077                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    4078            $C$DW$226       .dwtag  DW_TAG_member
    4079                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    4080                    .dwattr $C$DW$226, DW_AT_name("clockSource")
    4081                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("clockSource")
    4082                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4083                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4084                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4085                    .dwattr $C$DW$226, DW_AT_decl_line(0xc5)
    4086                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    4087            
    4088            $C$DW$227       .dwtag  DW_TAG_member
    4089                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4090                    .dwattr $C$DW$227, DW_AT_name("clockSourceDivider")
    4091                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("clockSourceDivider")
    4092                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4093                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4094                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4095                    .dwattr $C$DW$227, DW_AT_decl_line(0xdc)
    4096                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4097            
    4098            $C$DW$228       .dwtag  DW_TAG_member
    4099                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4100                    .dwattr $C$DW$228, DW_AT_name("timerPeriod")
    4101                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("timerPeriod")
    4102                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4103                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4104                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4105                    .dwattr $C$DW$228, DW_AT_decl_line(0xde)
    4106                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4107            
    4108            $C$DW$229       .dwtag  DW_TAG_member
    4109                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4110                    .dwattr $C$DW$229, DW_AT_name("compareRegister")
    4111                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("compareRegister")
    4112                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4113                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4114                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   84

    4115                    .dwattr $C$DW$229, DW_AT_decl_line(0xe9)
    4116                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4117            
    4118            $C$DW$230       .dwtag  DW_TAG_member
    4119                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    4120                    .dwattr $C$DW$230, DW_AT_name("compareOutputMode")
    4121                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("compareOutputMode")
    4122                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4123                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4124                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4125                    .dwattr $C$DW$230, DW_AT_decl_line(0xf4)
    4126                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4127            
    4128            $C$DW$231       .dwtag  DW_TAG_member
    4129                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    4130                    .dwattr $C$DW$231, DW_AT_name("dutyCycle")
    4131                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("dutyCycle")
    4132                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4133                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4134                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4135                    .dwattr $C$DW$231, DW_AT_decl_line(0xf6)
    4136                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4137            
    4138                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4139                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    4140                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4141                    .dwendtag $C$DW$T$34
    4142            
    4143            $C$DW$T$68      .dwtag  DW_TAG_typedef
    4144                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    4145                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    4146                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4147                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4148                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    4149                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    4150            
    4151            
    4152            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4153                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    4154                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    4155            $C$DW$232       .dwtag  DW_TAG_member
    4156                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    4157                    .dwattr $C$DW$232, DW_AT_name("captureRegister")
    4158                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("captureRegister")
    4159                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4160                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4161                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4162                    .dwattr $C$DW$232, DW_AT_decl_line(0xa0)
    4163                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    4164            
    4165            $C$DW$233       .dwtag  DW_TAG_member
    4166                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    4167                    .dwattr $C$DW$233, DW_AT_name("captureMode")
    4168                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("captureMode")
    4169                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   85

    4170                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4171                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4172                    .dwattr $C$DW$233, DW_AT_decl_line(0xa7)
    4173                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4174            
    4175            $C$DW$234       .dwtag  DW_TAG_member
    4176                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4177                    .dwattr $C$DW$234, DW_AT_name("captureInputSelect")
    4178                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("captureInputSelect")
    4179                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4180                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4181                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4182                    .dwattr $C$DW$234, DW_AT_decl_line(0xae)
    4183                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4184            
    4185            $C$DW$235       .dwtag  DW_TAG_member
    4186                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    4187                    .dwattr $C$DW$235, DW_AT_name("synchronizeCaptureSource")
    4188                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4189                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4190                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4191                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4192                    .dwattr $C$DW$235, DW_AT_decl_line(0xb3)
    4193                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    4194            
    4195            $C$DW$236       .dwtag  DW_TAG_member
    4196                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4197                    .dwattr $C$DW$236, DW_AT_name("captureInterruptEnable")
    4198                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("captureInterruptEnable")
    4199                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4200                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4201                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4202                    .dwattr $C$DW$236, DW_AT_decl_line(0xb8)
    4203                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4204            
    4205            $C$DW$237       .dwtag  DW_TAG_member
    4206                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    4207                    .dwattr $C$DW$237, DW_AT_name("captureOutputMode")
    4208                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("captureOutputMode")
    4209                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4210                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4211                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4212                    .dwattr $C$DW$237, DW_AT_decl_line(0xc3)
    4213                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    4214            
    4215                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4216                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    4217                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4218                    .dwendtag $C$DW$T$35
    4219            
    4220            $C$DW$T$69      .dwtag  DW_TAG_typedef
    4221                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4222                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4223                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4224                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   86

    4225                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4226                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4227            
    4228            
    4229            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4230                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4231                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4232            $C$DW$238       .dwtag  DW_TAG_member
    4233                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    4234                    .dwattr $C$DW$238, DW_AT_name("compareRegister")
    4235                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("compareRegister")
    4236                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4237                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4238                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4239                    .dwattr $C$DW$238, DW_AT_decl_line(0x146)
    4240                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    4241            
    4242            $C$DW$239       .dwtag  DW_TAG_member
    4243                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4244                    .dwattr $C$DW$239, DW_AT_name("compareInterruptEnable")
    4245                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("compareInterruptEnable")
    4246                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4247                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4248                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4249                    .dwattr $C$DW$239, DW_AT_decl_line(0x14b)
    4250                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    4251            
    4252            $C$DW$240       .dwtag  DW_TAG_member
    4253                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    4254                    .dwattr $C$DW$240, DW_AT_name("compareOutputMode")
    4255                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("compareOutputMode")
    4256                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4257                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4258                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4259                    .dwattr $C$DW$240, DW_AT_decl_line(0x156)
    4260                    .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    4261            
    4262            $C$DW$241       .dwtag  DW_TAG_member
    4263                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    4264                    .dwattr $C$DW$241, DW_AT_name("compareValue")
    4265                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("compareValue")
    4266                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4267                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4268                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4269                    .dwattr $C$DW$241, DW_AT_decl_line(0x158)
    4270                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4271            
    4272                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4273                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4274                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4275                    .dwendtag $C$DW$T$36
    4276            
    4277            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4278                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4279                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   87

    4280                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4281                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4282                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4283                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4284            
    4285            
    4286            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4287                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4288                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4289            $C$DW$242       .dwtag  DW_TAG_member
    4290                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$27)
    4291                    .dwattr $C$DW$242, DW_AT_name("clockSource")
    4292                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("clockSource")
    4293                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4294                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4295                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4296                    .dwattr $C$DW$242, DW_AT_decl_line(0xd3)
    4297                    .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
    4298            
    4299            $C$DW$243       .dwtag  DW_TAG_member
    4300                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    4301                    .dwattr $C$DW$243, DW_AT_name("clockSourceDivider")
    4302                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("clockSourceDivider")
    4303                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4304                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4305                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4306                    .dwattr $C$DW$243, DW_AT_decl_line(0xea)
    4307                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    4308            
    4309            $C$DW$244       .dwtag  DW_TAG_member
    4310                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    4311                    .dwattr $C$DW$244, DW_AT_name("timerInterruptEnable_TBIE")
    4312                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4313                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4314                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4315                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4316                    .dwattr $C$DW$244, DW_AT_decl_line(0xef)
    4317                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    4318            
    4319            $C$DW$245       .dwtag  DW_TAG_member
    4320                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    4321                    .dwattr $C$DW$245, DW_AT_name("timerClear")
    4322                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("timerClear")
    4323                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4324                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4325                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4326                    .dwattr $C$DW$245, DW_AT_decl_line(0xf5)
    4327                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    4328            
    4329            $C$DW$246       .dwtag  DW_TAG_member
    4330                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$30)
    4331                    .dwattr $C$DW$246, DW_AT_name("startTimer")
    4332                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("startTimer")
    4333                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4334                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   88

    4335                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4336                    .dwattr $C$DW$246, DW_AT_decl_line(0xf7)
    4337                    .dwattr $C$DW$246, DW_AT_decl_column(0x0a)
    4338            
    4339                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4340                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4341                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4342                    .dwendtag $C$DW$T$37
    4343            
    4344            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4345                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4346                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4347                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4348                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4349                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4350                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4351            
    4352            
    4353            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4354                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4355                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4356            $C$DW$247       .dwtag  DW_TAG_member
    4357                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    4358                    .dwattr $C$DW$247, DW_AT_name("clockSource")
    4359                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("clockSource")
    4360                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4361                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4362                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4363                    .dwattr $C$DW$247, DW_AT_decl_line(0x107)
    4364                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4365            
    4366            $C$DW$248       .dwtag  DW_TAG_member
    4367                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4368                    .dwattr $C$DW$248, DW_AT_name("clockSourceDivider")
    4369                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("clockSourceDivider")
    4370                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4371                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4372                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4373                    .dwattr $C$DW$248, DW_AT_decl_line(0x11e)
    4374                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4375            
    4376            $C$DW$249       .dwtag  DW_TAG_member
    4377                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    4378                    .dwattr $C$DW$249, DW_AT_name("timerPeriod")
    4379                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("timerPeriod")
    4380                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4381                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4382                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4383                    .dwattr $C$DW$249, DW_AT_decl_line(0x120)
    4384                    .dwattr $C$DW$249, DW_AT_decl_column(0x0e)
    4385            
    4386            $C$DW$250       .dwtag  DW_TAG_member
    4387                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    4388                    .dwattr $C$DW$250, DW_AT_name("timerInterruptEnable_TBIE")
    4389                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   89

    4390                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4391                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4392                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4393                    .dwattr $C$DW$250, DW_AT_decl_line(0x125)
    4394                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4395            
    4396            $C$DW$251       .dwtag  DW_TAG_member
    4397                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4398                    .dwattr $C$DW$251, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4399                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4400                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4401                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4402                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4403                    .dwattr $C$DW$251, DW_AT_decl_line(0x12a)
    4404                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4405            
    4406            $C$DW$252       .dwtag  DW_TAG_member
    4407                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    4408                    .dwattr $C$DW$252, DW_AT_name("timerClear")
    4409                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("timerClear")
    4410                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4411                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4412                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4413                    .dwattr $C$DW$252, DW_AT_decl_line(0x130)
    4414                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    4415            
    4416            $C$DW$253       .dwtag  DW_TAG_member
    4417                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$30)
    4418                    .dwattr $C$DW$253, DW_AT_name("startTimer")
    4419                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("startTimer")
    4420                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4421                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4422                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4423                    .dwattr $C$DW$253, DW_AT_decl_line(0x132)
    4424                    .dwattr $C$DW$253, DW_AT_decl_column(0x0a)
    4425            
    4426                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4427                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4428                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4429                    .dwendtag $C$DW$T$38
    4430            
    4431            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4432                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4433                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4434                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4435                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4436                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4437                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4438            
    4439            
    4440            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4441                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4442                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4443            $C$DW$254       .dwtag  DW_TAG_member
    4444                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   90

    4445                    .dwattr $C$DW$254, DW_AT_name("clockSource")
    4446                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("clockSource")
    4447                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4448                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4449                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4450                    .dwattr $C$DW$254, DW_AT_decl_line(0x60)
    4451                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4452            
    4453            $C$DW$255       .dwtag  DW_TAG_member
    4454                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4455                    .dwattr $C$DW$255, DW_AT_name("clockSourceDivider")
    4456                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("clockSourceDivider")
    4457                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4458                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4459                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4460                    .dwattr $C$DW$255, DW_AT_decl_line(0x77)
    4461                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4462            
    4463            $C$DW$256       .dwtag  DW_TAG_member
    4464                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4465                    .dwattr $C$DW$256, DW_AT_name("timerPeriod")
    4466                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("timerPeriod")
    4467                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4468                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4469                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4470                    .dwattr $C$DW$256, DW_AT_decl_line(0x7a)
    4471                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4472            
    4473            $C$DW$257       .dwtag  DW_TAG_member
    4474                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4475                    .dwattr $C$DW$257, DW_AT_name("timerInterruptEnable_TBIE")
    4476                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4477                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4478                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4479                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4480                    .dwattr $C$DW$257, DW_AT_decl_line(0x7f)
    4481                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4482            
    4483            $C$DW$258       .dwtag  DW_TAG_member
    4484                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    4485                    .dwattr $C$DW$258, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4486                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4487                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4488                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4489                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4490                    .dwattr $C$DW$258, DW_AT_decl_line(0x84)
    4491                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    4492            
    4493            $C$DW$259       .dwtag  DW_TAG_member
    4494                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    4495                    .dwattr $C$DW$259, DW_AT_name("timerClear")
    4496                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("timerClear")
    4497                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4498                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4499                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   91

    4500                    .dwattr $C$DW$259, DW_AT_decl_line(0x8a)
    4501                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4502            
    4503            $C$DW$260       .dwtag  DW_TAG_member
    4504                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$30)
    4505                    .dwattr $C$DW$260, DW_AT_name("startTimer")
    4506                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("startTimer")
    4507                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4508                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4509                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4510                    .dwattr $C$DW$260, DW_AT_decl_line(0x8c)
    4511                    .dwattr $C$DW$260, DW_AT_decl_column(0x0a)
    4512            
    4513                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4514                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4515                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    4516                    .dwendtag $C$DW$T$39
    4517            
    4518            $C$DW$T$73      .dwtag  DW_TAG_typedef
    4519                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    4520                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    4521                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4522                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4523                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    4524                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4525            
    4526            
    4527            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4528                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    4529                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4530            $C$DW$261       .dwtag  DW_TAG_member
    4531                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    4532                    .dwattr $C$DW$261, DW_AT_name("clockSource")
    4533                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("clockSource")
    4534                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4535                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4536                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4537                    .dwattr $C$DW$261, DW_AT_decl_line(0x20)
    4538                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    4539            
    4540            $C$DW$262       .dwtag  DW_TAG_member
    4541                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    4542                    .dwattr $C$DW$262, DW_AT_name("clockSourceDivider")
    4543                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("clockSourceDivider")
    4544                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4545                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4546                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4547                    .dwattr $C$DW$262, DW_AT_decl_line(0x37)
    4548                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    4549            
    4550            $C$DW$263       .dwtag  DW_TAG_member
    4551                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    4552                    .dwattr $C$DW$263, DW_AT_name("timerPeriod")
    4553                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("timerPeriod")
    4554                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   92

    4555                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4556                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4557                    .dwattr $C$DW$263, DW_AT_decl_line(0x39)
    4558                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    4559            
    4560            $C$DW$264       .dwtag  DW_TAG_member
    4561                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    4562                    .dwattr $C$DW$264, DW_AT_name("compareRegister")
    4563                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("compareRegister")
    4564                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4565                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4566                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4567                    .dwattr $C$DW$264, DW_AT_decl_line(0x44)
    4568                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    4569            
    4570            $C$DW$265       .dwtag  DW_TAG_member
    4571                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    4572                    .dwattr $C$DW$265, DW_AT_name("compareOutputMode")
    4573                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("compareOutputMode")
    4574                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4575                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4576                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4577                    .dwattr $C$DW$265, DW_AT_decl_line(0x4f)
    4578                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    4579            
    4580            $C$DW$266       .dwtag  DW_TAG_member
    4581                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    4582                    .dwattr $C$DW$266, DW_AT_name("dutyCycle")
    4583                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("dutyCycle")
    4584                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4585                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4586                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4587                    .dwattr $C$DW$266, DW_AT_decl_line(0x51)
    4588                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    4589            
    4590                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4591                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    4592                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4593                    .dwendtag $C$DW$T$40
    4594            
    4595            $C$DW$T$74      .dwtag  DW_TAG_typedef
    4596                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    4597                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    4598                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4599                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4600                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    4601                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4602            
    4603            
    4604            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4605                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4606                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4607            $C$DW$267       .dwtag  DW_TAG_member
    4608                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$24)
    4609                    .dwattr $C$DW$267, DW_AT_name("selectClockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   93

    4610                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("selectClockSource")
    4611                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4612                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4613                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4614                    .dwattr $C$DW$267, DW_AT_decl_line(0x1c)
    4615                    .dwattr $C$DW$267, DW_AT_decl_column(0x0d)
    4616            
    4617            $C$DW$268       .dwtag  DW_TAG_member
    4618                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    4619                    .dwattr $C$DW$268, DW_AT_name("clockPrescalar")
    4620                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("clockPrescalar")
    4621                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4622                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4623                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4624                    .dwattr $C$DW$268, DW_AT_decl_line(0x1e)
    4625                    .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    4626            
    4627            $C$DW$269       .dwtag  DW_TAG_member
    4628                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$24)
    4629                    .dwattr $C$DW$269, DW_AT_name("firstModReg")
    4630                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("firstModReg")
    4631                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4632                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4633                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4634                    .dwattr $C$DW$269, DW_AT_decl_line(0x22)
    4635                    .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    4636            
    4637            $C$DW$270       .dwtag  DW_TAG_member
    4638                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$24)
    4639                    .dwattr $C$DW$270, DW_AT_name("secondModReg")
    4640                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("secondModReg")
    4641                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4642                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4643                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4644                    .dwattr $C$DW$270, DW_AT_decl_line(0x26)
    4645                    .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    4646            
    4647            $C$DW$271       .dwtag  DW_TAG_member
    4648                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$24)
    4649                    .dwattr $C$DW$271, DW_AT_name("parity")
    4650                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("parity")
    4651                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4652                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4653                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4654                    .dwattr $C$DW$271, DW_AT_decl_line(0x2c)
    4655                    .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    4656            
    4657            $C$DW$272       .dwtag  DW_TAG_member
    4658                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$24)
    4659                    .dwattr $C$DW$272, DW_AT_name("msborLsbFirst")
    4660                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("msborLsbFirst")
    4661                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4662                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4663                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4664                    .dwattr $C$DW$272, DW_AT_decl_line(0x31)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   94

    4665                    .dwattr $C$DW$272, DW_AT_decl_column(0x0d)
    4666            
    4667            $C$DW$273       .dwtag  DW_TAG_member
    4668                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$24)
    4669                    .dwattr $C$DW$273, DW_AT_name("numberofStopBits")
    4670                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("numberofStopBits")
    4671                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4672                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4673                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4674                    .dwattr $C$DW$273, DW_AT_decl_line(0x36)
    4675                    .dwattr $C$DW$273, DW_AT_decl_column(0x0d)
    4676            
    4677            $C$DW$274       .dwtag  DW_TAG_member
    4678                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$24)
    4679                    .dwattr $C$DW$274, DW_AT_name("uartMode")
    4680                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("uartMode")
    4681                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4682                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4683                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4684                    .dwattr $C$DW$274, DW_AT_decl_line(0x3d)
    4685                    .dwattr $C$DW$274, DW_AT_decl_column(0x0d)
    4686            
    4687            $C$DW$275       .dwtag  DW_TAG_member
    4688                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$24)
    4689                    .dwattr $C$DW$275, DW_AT_name("overSampling")
    4690                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("overSampling")
    4691                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4692                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4693                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4694                    .dwattr $C$DW$275, DW_AT_decl_line(0x42)
    4695                    .dwattr $C$DW$275, DW_AT_decl_column(0x0d)
    4696            
    4697                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4698                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4699                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4700                    .dwendtag $C$DW$T$41
    4701            
    4702            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4703                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4704                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4705                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4706                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4707                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4708                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4709            
    4710            
    4711            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4712                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4713                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4714            $C$DW$276       .dwtag  DW_TAG_member
    4715                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$43)
    4716                    .dwattr $C$DW$276, DW_AT_name("clockSourceFrequency")
    4717                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("clockSourceFrequency")
    4718                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4719                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   95

    4720                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4721                    .dwattr $C$DW$276, DW_AT_decl_line(0x31)
    4722                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    4723            
    4724            $C$DW$277       .dwtag  DW_TAG_member
    4725                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$43)
    4726                    .dwattr $C$DW$277, DW_AT_name("desiredSpiClock")
    4727                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("desiredSpiClock")
    4728                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4729                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4730                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4731                    .dwattr $C$DW$277, DW_AT_decl_line(0x33)
    4732                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    4733            
    4734                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4735                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4736                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4737                    .dwendtag $C$DW$T$44
    4738            
    4739            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4740                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4741                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4742                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4743                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4744                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4745                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4746            
    4747            
    4748            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4749                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4750                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4751            $C$DW$278       .dwtag  DW_TAG_member
    4752                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$24)
    4753                    .dwattr $C$DW$278, DW_AT_name("selectClockSource")
    4754                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("selectClockSource")
    4755                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4756                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4757                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4758                    .dwattr $C$DW$278, DW_AT_decl_line(0x14)
    4759                    .dwattr $C$DW$278, DW_AT_decl_column(0x0d)
    4760            
    4761            $C$DW$279       .dwtag  DW_TAG_member
    4762                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$43)
    4763                    .dwattr $C$DW$279, DW_AT_name("clockSourceFrequency")
    4764                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("clockSourceFrequency")
    4765                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4766                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4767                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4768                    .dwattr $C$DW$279, DW_AT_decl_line(0x16)
    4769                    .dwattr $C$DW$279, DW_AT_decl_column(0x0e)
    4770            
    4771            $C$DW$280       .dwtag  DW_TAG_member
    4772                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$43)
    4773                    .dwattr $C$DW$280, DW_AT_name("desiredSpiClock")
    4774                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("desiredSpiClock")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:45:59 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Fuel_Gauge.asm                                                       PAGE   96

    4775                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4776                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4777                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4778                    .dwattr $C$DW$280, DW_AT_decl_line(0x18)
    4779                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    4780            
    4781            $C$DW$281       .dwtag  DW_TAG_member
    4782                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$24)
    4783                    .dwattr $C$DW$281, DW_AT_name("msbFirst")
    4784                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("msbFirst")
    4785                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4786                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4787                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4788                    .dwattr $C$DW$281, DW_AT_decl_line(0x1d)
    4789                    .dwattr $C$DW$281, DW_AT_decl_column(0x0d)
