MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 14:02:21 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Initialize.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("ADC12CTL0")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("ADC12CTL0")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$121)

    5571                    .dwattr $C$DW$334, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5572                    .dwattr $C$DW$334, DW_AT_decl_line(0x76)
    5573                    .dwattr $C$DW$334, DW_AT_decl_column(0x05)
    5574            
    5575            $C$DW$335       .dwtag  DW_TAG_enumerator
    5576                    .dwattr $C$DW$335, DW_AT_name("ack")
    5577                    .dwattr $C$DW$335, DW_AT_const_value(0x07)
    5578                    .dwattr $C$DW$335, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5579                    .dwattr $C$DW$335, DW_AT_decl_line(0x77)
    5580                    .dwattr $C$DW$335, DW_AT_decl_column(0x05)
    5581            
    5582            $C$DW$336       .dwtag  DW_TAG_enumerator
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  113

    5583                    .dwattr $C$DW$336, DW_AT_name("var")
    5584                    .dwattr $C$DW$336, DW_AT_const_value(0x08)
    5585                    .dwattr $C$DW$336, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5586                    .dwattr $C$DW$336, DW_AT_decl_line(0x78)
    5587                    .dwattr $C$DW$336, DW_AT_decl_column(0x05)
    5588            
    5589            $C$DW$337       .dwtag  DW_TAG_enumerator
    5590                    .dwattr $C$DW$337, DW_AT_name("UGmsg")
    5591                    .dwattr $C$DW$337, DW_AT_const_value(0x09)
    5592                    .dwattr $C$DW$337, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5593                    .dwattr $C$DW$337, DW_AT_decl_line(0x79)
    5594                    .dwattr $C$DW$337, DW_AT_decl_column(0x05)
    5595            
    5596                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5597                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    5598                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    5599                    .dwendtag $C$DW$T$57
    5600            
    5601            $C$DW$T$58      .dwtag  DW_TAG_typedef
    5602                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    5603                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    5604                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5605                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5606                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    5607                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    5608            
    5609            
    5610            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    5611                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    5612            $C$DW$338       .dwtag  DW_TAG_enumerator
    5613                    .dwattr $C$DW$338, DW_AT_name("init")
    5614                    .dwattr $C$DW$338, DW_AT_const_value(0x00)
    5615                    .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5616                    .dwattr $C$DW$338, DW_AT_decl_line(0x80)
    5617                    .dwattr $C$DW$338, DW_AT_decl_column(0x05)
    5618            
    5619            $C$DW$339       .dwtag  DW_TAG_enumerator
    5620                    .dwattr $C$DW$339, DW_AT_name("running")
    5621                    .dwattr $C$DW$339, DW_AT_const_value(0x01)
    5622                    .dwattr $C$DW$339, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5623                    .dwattr $C$DW$339, DW_AT_decl_line(0x80)
    5624                    .dwattr $C$DW$339, DW_AT_decl_column(0x0b)
    5625            
    5626            $C$DW$340       .dwtag  DW_TAG_enumerator
    5627                    .dwattr $C$DW$340, DW_AT_name("wait")
    5628                    .dwattr $C$DW$340, DW_AT_const_value(0x02)
    5629                    .dwattr $C$DW$340, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5630                    .dwattr $C$DW$340, DW_AT_decl_line(0x80)
    5631                    .dwattr $C$DW$340, DW_AT_decl_column(0x14)
    5632            
    5633                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5634                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    5635                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    5636                    .dwendtag $C$DW$T$59
    5637            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  114

    5638            $C$DW$T$60      .dwtag  DW_TAG_typedef
    5639                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    5640                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    5641                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    5642                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5643                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    5644                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    5645            
    5646            
    5647            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5648                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    5649            $C$DW$341       .dwtag  DW_TAG_member
    5650                    .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$14)
    5651                    .dwattr $C$DW$341, DW_AT_name("__max_align1")
    5652                    .dwattr $C$DW$341, DW_AT_TI_symbol_name("__max_align1")
    5653                    .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5654                    .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5655                    .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    5656                    .dwattr $C$DW$341, DW_AT_decl_line(0x7b)
    5657                    .dwattr $C$DW$341, DW_AT_decl_column(0x0c)
    5658            
    5659            $C$DW$342       .dwtag  DW_TAG_member
    5660                    .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$18)
    5661                    .dwattr $C$DW$342, DW_AT_name("__max_align2")
    5662                    .dwattr $C$DW$342, DW_AT_TI_symbol_name("__max_align2")
    5663                    .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5664                    .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5665                    .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    5666                    .dwattr $C$DW$342, DW_AT_decl_line(0x7c)
    5667                    .dwattr $C$DW$342, DW_AT_decl_column(0x0e)
    5668            
    5669                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    5670                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    5671                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    5672                    .dwendtag $C$DW$T$22
    5673            
    5674            $C$DW$T$61      .dwtag  DW_TAG_typedef
    5675                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    5676                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    5677                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    5678                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    5679                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    5680                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    5681            
    5682            
    5683            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5684                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    5685                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    5686            $C$DW$343       .dwtag  DW_TAG_member
    5687                    .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$24)
    5688                    .dwattr $C$DW$343, DW_AT_name("memoryBufferControlIndex")
    5689                    .dwattr $C$DW$343, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    5690                    .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5691                    .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5692                    .dwattr $C$DW$343, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  115

    5693                    .dwattr $C$DW$343, DW_AT_decl_line(0x27)
    5694                    .dwattr $C$DW$343, DW_AT_decl_column(0x0d)
    5695            
    5696            $C$DW$344       .dwtag  DW_TAG_member
    5697                    .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$24)
    5698                    .dwattr $C$DW$344, DW_AT_name("inputSourceSelect")
    5699                    .dwattr $C$DW$344, DW_AT_TI_symbol_name("inputSourceSelect")
    5700                    .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5701                    .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5702                    .dwattr $C$DW$344, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5703                    .dwattr $C$DW$344, DW_AT_decl_line(0x3b)
    5704                    .dwattr $C$DW$344, DW_AT_decl_column(0x0d)
    5705            
    5706            $C$DW$345       .dwtag  DW_TAG_member
    5707                    .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$24)
    5708                    .dwattr $C$DW$345, DW_AT_name("positiveRefVoltageSourceSelect")
    5709                    .dwattr $C$DW$345, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    5710                    .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5711                    .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5712                    .dwattr $C$DW$345, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5713                    .dwattr $C$DW$345, DW_AT_decl_line(0x42)
    5714                    .dwattr $C$DW$345, DW_AT_decl_column(0x0d)
    5715            
    5716            $C$DW$346       .dwtag  DW_TAG_member
    5717                    .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$24)
    5718                    .dwattr $C$DW$346, DW_AT_name("negativeRefVoltageSourceSelect")
    5719                    .dwattr $C$DW$346, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    5720                    .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5721                    .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5722                    .dwattr $C$DW$346, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5723                    .dwattr $C$DW$346, DW_AT_decl_line(0x48)
    5724                    .dwattr $C$DW$346, DW_AT_decl_column(0x0d)
    5725            
    5726            $C$DW$347       .dwtag  DW_TAG_member
    5727                    .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$24)
    5728                    .dwattr $C$DW$347, DW_AT_name("endOfSequence")
    5729                    .dwattr $C$DW$347, DW_AT_TI_symbol_name("endOfSequence")
    5730                    .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5731                    .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5732                    .dwattr $C$DW$347, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5733                    .dwattr $C$DW$347, DW_AT_decl_line(0x51)
    5734                    .dwattr $C$DW$347, DW_AT_decl_column(0x0d)
    5735            
    5736                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    5737                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    5738                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5739                    .dwendtag $C$DW$T$25
    5740            
    5741            $C$DW$T$62      .dwtag  DW_TAG_typedef
    5742                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    5743                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    5744                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    5745                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    5746                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    5747                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  116

    5748            
    5749            
    5750            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5751                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    5752                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    5753            $C$DW$348       .dwtag  DW_TAG_member
    5754                    .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$27)
    5755                    .dwattr $C$DW$348, DW_AT_name("captureRegister")
    5756                    .dwattr $C$DW$348, DW_AT_TI_symbol_name("captureRegister")
    5757                    .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5758                    .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5759                    .dwattr $C$DW$348, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5760                    .dwattr $C$DW$348, DW_AT_decl_line(0x58)
    5761                    .dwattr $C$DW$348, DW_AT_decl_column(0x0e)
    5762            
    5763            $C$DW$349       .dwtag  DW_TAG_member
    5764                    .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
    5765                    .dwattr $C$DW$349, DW_AT_name("captureMode")
    5766                    .dwattr $C$DW$349, DW_AT_TI_symbol_name("captureMode")
    5767                    .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5768                    .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5769                    .dwattr $C$DW$349, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5770                    .dwattr $C$DW$349, DW_AT_decl_line(0x5f)
    5771                    .dwattr $C$DW$349, DW_AT_decl_column(0x0e)
    5772            
    5773            $C$DW$350       .dwtag  DW_TAG_member
    5774                    .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$27)
    5775                    .dwattr $C$DW$350, DW_AT_name("captureInputSelect")
    5776                    .dwattr $C$DW$350, DW_AT_TI_symbol_name("captureInputSelect")
    5777                    .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5778                    .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5779                    .dwattr $C$DW$350, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5780                    .dwattr $C$DW$350, DW_AT_decl_line(0x66)
    5781                    .dwattr $C$DW$350, DW_AT_decl_column(0x0e)
    5782            
    5783            $C$DW$351       .dwtag  DW_TAG_member
    5784                    .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$27)
    5785                    .dwattr $C$DW$351, DW_AT_name("synchronizeCaptureSource")
    5786                    .dwattr $C$DW$351, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    5787                    .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5788                    .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5789                    .dwattr $C$DW$351, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5790                    .dwattr $C$DW$351, DW_AT_decl_line(0x6b)
    5791                    .dwattr $C$DW$351, DW_AT_decl_column(0x0e)
    5792            
    5793            $C$DW$352       .dwtag  DW_TAG_member
    5794                    .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$27)
    5795                    .dwattr $C$DW$352, DW_AT_name("captureInterruptEnable")
    5796                    .dwattr $C$DW$352, DW_AT_TI_symbol_name("captureInterruptEnable")
    5797                    .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5798                    .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5799                    .dwattr $C$DW$352, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5800                    .dwattr $C$DW$352, DW_AT_decl_line(0x70)
    5801                    .dwattr $C$DW$352, DW_AT_decl_column(0x0e)
    5802            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  117

    5803            $C$DW$353       .dwtag  DW_TAG_member
    5804                    .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$27)
    5805                    .dwattr $C$DW$353, DW_AT_name("captureOutputMode")
    5806                    .dwattr $C$DW$353, DW_AT_TI_symbol_name("captureOutputMode")
    5807                    .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5808                    .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5809                    .dwattr $C$DW$353, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5810                    .dwattr $C$DW$353, DW_AT_decl_line(0x7b)
    5811                    .dwattr $C$DW$353, DW_AT_decl_column(0x0e)
    5812            
    5813                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5814                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    5815                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5816                    .dwendtag $C$DW$T$28
    5817            
    5818            $C$DW$T$63      .dwtag  DW_TAG_typedef
    5819                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    5820                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    5821                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5822                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5823                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    5824                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    5825            
    5826            
    5827            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5828                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    5829                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    5830            $C$DW$354       .dwtag  DW_TAG_member
    5831                    .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$27)
    5832                    .dwattr $C$DW$354, DW_AT_name("compareRegister")
    5833                    .dwattr $C$DW$354, DW_AT_TI_symbol_name("compareRegister")
    5834                    .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5835                    .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5836                    .dwattr $C$DW$354, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5837                    .dwattr $C$DW$354, DW_AT_decl_line(0x145)
    5838                    .dwattr $C$DW$354, DW_AT_decl_column(0x0e)
    5839            
    5840            $C$DW$355       .dwtag  DW_TAG_member
    5841                    .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$27)
    5842                    .dwattr $C$DW$355, DW_AT_name("compareInterruptEnable")
    5843                    .dwattr $C$DW$355, DW_AT_TI_symbol_name("compareInterruptEnable")
    5844                    .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5845                    .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5846                    .dwattr $C$DW$355, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5847                    .dwattr $C$DW$355, DW_AT_decl_line(0x14a)
    5848                    .dwattr $C$DW$355, DW_AT_decl_column(0x0e)
    5849            
    5850            $C$DW$356       .dwtag  DW_TAG_member
    5851                    .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$27)
    5852                    .dwattr $C$DW$356, DW_AT_name("compareOutputMode")
    5853                    .dwattr $C$DW$356, DW_AT_TI_symbol_name("compareOutputMode")
    5854                    .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5855                    .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5856                    .dwattr $C$DW$356, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5857                    .dwattr $C$DW$356, DW_AT_decl_line(0x155)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  118

    5858                    .dwattr $C$DW$356, DW_AT_decl_column(0x0e)
    5859            
    5860            $C$DW$357       .dwtag  DW_TAG_member
    5861                    .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$27)
    5862                    .dwattr $C$DW$357, DW_AT_name("compareValue")
    5863                    .dwattr $C$DW$357, DW_AT_TI_symbol_name("compareValue")
    5864                    .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5865                    .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5866                    .dwattr $C$DW$357, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5867                    .dwattr $C$DW$357, DW_AT_decl_line(0x157)
    5868                    .dwattr $C$DW$357, DW_AT_decl_column(0x0e)
    5869            
    5870                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5871                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    5872                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5873                    .dwendtag $C$DW$T$29
    5874            
    5875            $C$DW$T$64      .dwtag  DW_TAG_typedef
    5876                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    5877                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    5878                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    5879                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5880                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    5881                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    5882            
    5883            
    5884            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5885                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    5886                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    5887            $C$DW$358       .dwtag  DW_TAG_member
    5888                    .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$27)
    5889                    .dwattr $C$DW$358, DW_AT_name("clockSource")
    5890                    .dwattr $C$DW$358, DW_AT_TI_symbol_name("clockSource")
    5891                    .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5892                    .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5893                    .dwattr $C$DW$358, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5894                    .dwattr $C$DW$358, DW_AT_decl_line(0x20)
    5895                    .dwattr $C$DW$358, DW_AT_decl_column(0x0e)
    5896            
    5897            $C$DW$359       .dwtag  DW_TAG_member
    5898                    .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$27)
    5899                    .dwattr $C$DW$359, DW_AT_name("clockSourceDivider")
    5900                    .dwattr $C$DW$359, DW_AT_TI_symbol_name("clockSourceDivider")
    5901                    .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5902                    .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5903                    .dwattr $C$DW$359, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5904                    .dwattr $C$DW$359, DW_AT_decl_line(0x37)
    5905                    .dwattr $C$DW$359, DW_AT_decl_column(0x0e)
    5906            
    5907            $C$DW$360       .dwtag  DW_TAG_member
    5908                    .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$27)
    5909                    .dwattr $C$DW$360, DW_AT_name("timerInterruptEnable_TAIE")
    5910                    .dwattr $C$DW$360, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5911                    .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5912                    .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  119

    5913                    .dwattr $C$DW$360, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5914                    .dwattr $C$DW$360, DW_AT_decl_line(0x3c)
    5915                    .dwattr $C$DW$360, DW_AT_decl_column(0x0e)
    5916            
    5917            $C$DW$361       .dwtag  DW_TAG_member
    5918                    .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$27)
    5919                    .dwattr $C$DW$361, DW_AT_name("timerClear")
    5920                    .dwattr $C$DW$361, DW_AT_TI_symbol_name("timerClear")
    5921                    .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5922                    .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5923                    .dwattr $C$DW$361, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5924                    .dwattr $C$DW$361, DW_AT_decl_line(0x42)
    5925                    .dwattr $C$DW$361, DW_AT_decl_column(0x0e)
    5926            
    5927            $C$DW$362       .dwtag  DW_TAG_member
    5928                    .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$30)
    5929                    .dwattr $C$DW$362, DW_AT_name("startTimer")
    5930                    .dwattr $C$DW$362, DW_AT_TI_symbol_name("startTimer")
    5931                    .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5932                    .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5933                    .dwattr $C$DW$362, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5934                    .dwattr $C$DW$362, DW_AT_decl_line(0x44)
    5935                    .dwattr $C$DW$362, DW_AT_decl_column(0x0a)
    5936            
    5937                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5938                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    5939                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5940                    .dwendtag $C$DW$T$31
    5941            
    5942            $C$DW$T$65      .dwtag  DW_TAG_typedef
    5943                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    5944                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    5945                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5946                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5947                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    5948                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    5949            
    5950            
    5951            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5952                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    5953                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    5954            $C$DW$363       .dwtag  DW_TAG_member
    5955                    .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$27)
    5956                    .dwattr $C$DW$363, DW_AT_name("clockSource")
    5957                    .dwattr $C$DW$363, DW_AT_TI_symbol_name("clockSource")
    5958                    .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5959                    .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5960                    .dwattr $C$DW$363, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5961                    .dwattr $C$DW$363, DW_AT_decl_line(0x8b)
    5962                    .dwattr $C$DW$363, DW_AT_decl_column(0x0e)
    5963            
    5964            $C$DW$364       .dwtag  DW_TAG_member
    5965                    .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$27)
    5966                    .dwattr $C$DW$364, DW_AT_name("clockSourceDivider")
    5967                    .dwattr $C$DW$364, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  120

    5968                    .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5969                    .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5970                    .dwattr $C$DW$364, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5971                    .dwattr $C$DW$364, DW_AT_decl_line(0xa2)
    5972                    .dwattr $C$DW$364, DW_AT_decl_column(0x0e)
    5973            
    5974            $C$DW$365       .dwtag  DW_TAG_member
    5975                    .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$27)
    5976                    .dwattr $C$DW$365, DW_AT_name("timerPeriod")
    5977                    .dwattr $C$DW$365, DW_AT_TI_symbol_name("timerPeriod")
    5978                    .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5979                    .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5980                    .dwattr $C$DW$365, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5981                    .dwattr $C$DW$365, DW_AT_decl_line(0xa4)
    5982                    .dwattr $C$DW$365, DW_AT_decl_column(0x0e)
    5983            
    5984            $C$DW$366       .dwtag  DW_TAG_member
    5985                    .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$27)
    5986                    .dwattr $C$DW$366, DW_AT_name("timerInterruptEnable_TAIE")
    5987                    .dwattr $C$DW$366, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5988                    .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5989                    .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5990                    .dwattr $C$DW$366, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5991                    .dwattr $C$DW$366, DW_AT_decl_line(0xa9)
    5992                    .dwattr $C$DW$366, DW_AT_decl_column(0x0e)
    5993            
    5994            $C$DW$367       .dwtag  DW_TAG_member
    5995                    .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$27)
    5996                    .dwattr $C$DW$367, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5997                    .dwattr $C$DW$367, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5998                    .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5999                    .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6000                    .dwattr $C$DW$367, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6001                    .dwattr $C$DW$367, DW_AT_decl_line(0xae)
    6002                    .dwattr $C$DW$367, DW_AT_decl_column(0x0e)
    6003            
    6004            $C$DW$368       .dwtag  DW_TAG_member
    6005                    .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$27)
    6006                    .dwattr $C$DW$368, DW_AT_name("timerClear")
    6007                    .dwattr $C$DW$368, DW_AT_TI_symbol_name("timerClear")
    6008                    .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6009                    .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6010                    .dwattr $C$DW$368, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6011                    .dwattr $C$DW$368, DW_AT_decl_line(0xb4)
    6012                    .dwattr $C$DW$368, DW_AT_decl_column(0x0e)
    6013            
    6014            $C$DW$369       .dwtag  DW_TAG_member
    6015                    .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$30)
    6016                    .dwattr $C$DW$369, DW_AT_name("startTimer")
    6017                    .dwattr $C$DW$369, DW_AT_TI_symbol_name("startTimer")
    6018                    .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6019                    .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6020                    .dwattr $C$DW$369, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6021                    .dwattr $C$DW$369, DW_AT_decl_line(0xb6)
    6022                    .dwattr $C$DW$369, DW_AT_decl_column(0x0a)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  121

    6023            
    6024                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6025                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    6026                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    6027                    .dwendtag $C$DW$T$32
    6028            
    6029            $C$DW$T$66      .dwtag  DW_TAG_typedef
    6030                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    6031                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    6032                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    6033                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6034                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    6035                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    6036            
    6037            
    6038            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6039                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    6040                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    6041            $C$DW$370       .dwtag  DW_TAG_member
    6042                    .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$27)
    6043                    .dwattr $C$DW$370, DW_AT_name("clockSource")
    6044                    .dwattr $C$DW$370, DW_AT_TI_symbol_name("clockSource")
    6045                    .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6046                    .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6047                    .dwattr $C$DW$370, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6048                    .dwattr $C$DW$370, DW_AT_decl_line(0x105)
    6049                    .dwattr $C$DW$370, DW_AT_decl_column(0x0e)
    6050            
    6051            $C$DW$371       .dwtag  DW_TAG_member
    6052                    .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$27)
    6053                    .dwattr $C$DW$371, DW_AT_name("clockSourceDivider")
    6054                    .dwattr $C$DW$371, DW_AT_TI_symbol_name("clockSourceDivider")
    6055                    .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6056                    .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6057                    .dwattr $C$DW$371, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6058                    .dwattr $C$DW$371, DW_AT_decl_line(0x11c)
    6059                    .dwattr $C$DW$371, DW_AT_decl_column(0x0e)
    6060            
    6061            $C$DW$372       .dwtag  DW_TAG_member
    6062                    .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$27)
    6063                    .dwattr $C$DW$372, DW_AT_name("timerPeriod")
    6064                    .dwattr $C$DW$372, DW_AT_TI_symbol_name("timerPeriod")
    6065                    .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6066                    .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6067                    .dwattr $C$DW$372, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6068                    .dwattr $C$DW$372, DW_AT_decl_line(0x11f)
    6069                    .dwattr $C$DW$372, DW_AT_decl_column(0x0e)
    6070            
    6071            $C$DW$373       .dwtag  DW_TAG_member
    6072                    .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$27)
    6073                    .dwattr $C$DW$373, DW_AT_name("timerInterruptEnable_TAIE")
    6074                    .dwattr $C$DW$373, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    6075                    .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6076                    .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6077                    .dwattr $C$DW$373, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  122

    6078                    .dwattr $C$DW$373, DW_AT_decl_line(0x124)
    6079                    .dwattr $C$DW$373, DW_AT_decl_column(0x0e)
    6080            
    6081            $C$DW$374       .dwtag  DW_TAG_member
    6082                    .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$27)
    6083                    .dwattr $C$DW$374, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6084                    .dwattr $C$DW$374, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6085                    .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6086                    .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6087                    .dwattr $C$DW$374, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6088                    .dwattr $C$DW$374, DW_AT_decl_line(0x129)
    6089                    .dwattr $C$DW$374, DW_AT_decl_column(0x0e)
    6090            
    6091            $C$DW$375       .dwtag  DW_TAG_member
    6092                    .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$27)
    6093                    .dwattr $C$DW$375, DW_AT_name("timerClear")
    6094                    .dwattr $C$DW$375, DW_AT_TI_symbol_name("timerClear")
    6095                    .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6096                    .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6097                    .dwattr $C$DW$375, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6098                    .dwattr $C$DW$375, DW_AT_decl_line(0x12f)
    6099                    .dwattr $C$DW$375, DW_AT_decl_column(0x0e)
    6100            
    6101            $C$DW$376       .dwtag  DW_TAG_member
    6102                    .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$30)
    6103                    .dwattr $C$DW$376, DW_AT_name("startTimer")
    6104                    .dwattr $C$DW$376, DW_AT_TI_symbol_name("startTimer")
    6105                    .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6106                    .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6107                    .dwattr $C$DW$376, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6108                    .dwattr $C$DW$376, DW_AT_decl_line(0x131)
    6109                    .dwattr $C$DW$376, DW_AT_decl_column(0x0a)
    6110            
    6111                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6112                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    6113                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    6114                    .dwendtag $C$DW$T$33
    6115            
    6116            $C$DW$T$67      .dwtag  DW_TAG_typedef
    6117                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    6118                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    6119                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    6120                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6121                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    6122                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    6123            
    6124            
    6125            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6126                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    6127                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    6128            $C$DW$377       .dwtag  DW_TAG_member
    6129                    .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$27)
    6130                    .dwattr $C$DW$377, DW_AT_name("clockSource")
    6131                    .dwattr $C$DW$377, DW_AT_TI_symbol_name("clockSource")
    6132                    .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  123

    6133                    .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6134                    .dwattr $C$DW$377, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6135                    .dwattr $C$DW$377, DW_AT_decl_line(0xc5)
    6136                    .dwattr $C$DW$377, DW_AT_decl_column(0x0e)
    6137            
    6138            $C$DW$378       .dwtag  DW_TAG_member
    6139                    .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$27)
    6140                    .dwattr $C$DW$378, DW_AT_name("clockSourceDivider")
    6141                    .dwattr $C$DW$378, DW_AT_TI_symbol_name("clockSourceDivider")
    6142                    .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6143                    .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6144                    .dwattr $C$DW$378, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6145                    .dwattr $C$DW$378, DW_AT_decl_line(0xdc)
    6146                    .dwattr $C$DW$378, DW_AT_decl_column(0x0e)
    6147            
    6148            $C$DW$379       .dwtag  DW_TAG_member
    6149                    .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$27)
    6150                    .dwattr $C$DW$379, DW_AT_name("timerPeriod")
    6151                    .dwattr $C$DW$379, DW_AT_TI_symbol_name("timerPeriod")
    6152                    .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6153                    .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6154                    .dwattr $C$DW$379, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6155                    .dwattr $C$DW$379, DW_AT_decl_line(0xde)
    6156                    .dwattr $C$DW$379, DW_AT_decl_column(0x0e)
    6157            
    6158            $C$DW$380       .dwtag  DW_TAG_member
    6159                    .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$27)
    6160                    .dwattr $C$DW$380, DW_AT_name("compareRegister")
    6161                    .dwattr $C$DW$380, DW_AT_TI_symbol_name("compareRegister")
    6162                    .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6163                    .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6164                    .dwattr $C$DW$380, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6165                    .dwattr $C$DW$380, DW_AT_decl_line(0xe9)
    6166                    .dwattr $C$DW$380, DW_AT_decl_column(0x0e)
    6167            
    6168            $C$DW$381       .dwtag  DW_TAG_member
    6169                    .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$27)
    6170                    .dwattr $C$DW$381, DW_AT_name("compareOutputMode")
    6171                    .dwattr $C$DW$381, DW_AT_TI_symbol_name("compareOutputMode")
    6172                    .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6173                    .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6174                    .dwattr $C$DW$381, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6175                    .dwattr $C$DW$381, DW_AT_decl_line(0xf4)
    6176                    .dwattr $C$DW$381, DW_AT_decl_column(0x0e)
    6177            
    6178            $C$DW$382       .dwtag  DW_TAG_member
    6179                    .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$27)
    6180                    .dwattr $C$DW$382, DW_AT_name("dutyCycle")
    6181                    .dwattr $C$DW$382, DW_AT_TI_symbol_name("dutyCycle")
    6182                    .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6183                    .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6184                    .dwattr $C$DW$382, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6185                    .dwattr $C$DW$382, DW_AT_decl_line(0xf6)
    6186                    .dwattr $C$DW$382, DW_AT_decl_column(0x0e)
    6187            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  124

    6188                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6189                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    6190                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    6191                    .dwendtag $C$DW$T$34
    6192            
    6193            $C$DW$T$68      .dwtag  DW_TAG_typedef
    6194                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    6195                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    6196                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    6197                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6198                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    6199                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    6200            
    6201            
    6202            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6203                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    6204                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    6205            $C$DW$383       .dwtag  DW_TAG_member
    6206                    .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$27)
    6207                    .dwattr $C$DW$383, DW_AT_name("captureRegister")
    6208                    .dwattr $C$DW$383, DW_AT_TI_symbol_name("captureRegister")
    6209                    .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6210                    .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    6211                    .dwattr $C$DW$383, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6212                    .dwattr $C$DW$383, DW_AT_decl_line(0xa0)
    6213                    .dwattr $C$DW$383, DW_AT_decl_column(0x0e)
    6214            
    6215            $C$DW$384       .dwtag  DW_TAG_member
    6216                    .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$27)
    6217                    .dwattr $C$DW$384, DW_AT_name("captureMode")
    6218                    .dwattr $C$DW$384, DW_AT_TI_symbol_name("captureMode")
    6219                    .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6220                    .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6221                    .dwattr $C$DW$384, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6222                    .dwattr $C$DW$384, DW_AT_decl_line(0xa7)
    6223                    .dwattr $C$DW$384, DW_AT_decl_column(0x0e)
    6224            
    6225            $C$DW$385       .dwtag  DW_TAG_member
    6226                    .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$27)
    6227                    .dwattr $C$DW$385, DW_AT_name("captureInputSelect")
    6228                    .dwattr $C$DW$385, DW_AT_TI_symbol_name("captureInputSelect")
    6229                    .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6230                    .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6231                    .dwattr $C$DW$385, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6232                    .dwattr $C$DW$385, DW_AT_decl_line(0xae)
    6233                    .dwattr $C$DW$385, DW_AT_decl_column(0x0e)
    6234            
    6235            $C$DW$386       .dwtag  DW_TAG_member
    6236                    .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$27)
    6237                    .dwattr $C$DW$386, DW_AT_name("synchronizeCaptureSource")
    6238                    .dwattr $C$DW$386, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    6239                    .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6240                    .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6241                    .dwattr $C$DW$386, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6242                    .dwattr $C$DW$386, DW_AT_decl_line(0xb3)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  125

    6243                    .dwattr $C$DW$386, DW_AT_decl_column(0x0e)
    6244            
    6245            $C$DW$387       .dwtag  DW_TAG_member
    6246                    .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$27)
    6247                    .dwattr $C$DW$387, DW_AT_name("captureInterruptEnable")
    6248                    .dwattr $C$DW$387, DW_AT_TI_symbol_name("captureInterruptEnable")
    6249                    .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6250                    .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6251                    .dwattr $C$DW$387, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6252                    .dwattr $C$DW$387, DW_AT_decl_line(0xb8)
    6253                    .dwattr $C$DW$387, DW_AT_decl_column(0x0e)
    6254            
    6255            $C$DW$388       .dwtag  DW_TAG_member
    6256                    .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$27)
    6257                    .dwattr $C$DW$388, DW_AT_name("captureOutputMode")
    6258                    .dwattr $C$DW$388, DW_AT_TI_symbol_name("captureOutputMode")
    6259                    .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6260                    .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6261                    .dwattr $C$DW$388, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6262                    .dwattr $C$DW$388, DW_AT_decl_line(0xc3)
    6263                    .dwattr $C$DW$388, DW_AT_decl_column(0x0e)
    6264            
    6265                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6266                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    6267                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    6268                    .dwendtag $C$DW$T$35
    6269            
    6270            $C$DW$T$69      .dwtag  DW_TAG_typedef
    6271                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    6272                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    6273                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    6274                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6275                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    6276                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    6277            
    6278            
    6279            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6280                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    6281                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    6282            $C$DW$389       .dwtag  DW_TAG_member
    6283                    .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$27)
    6284                    .dwattr $C$DW$389, DW_AT_name("compareRegister")
    6285                    .dwattr $C$DW$389, DW_AT_TI_symbol_name("compareRegister")
    6286                    .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6287                    .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6288                    .dwattr $C$DW$389, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6289                    .dwattr $C$DW$389, DW_AT_decl_line(0x146)
    6290                    .dwattr $C$DW$389, DW_AT_decl_column(0x0e)
    6291            
    6292            $C$DW$390       .dwtag  DW_TAG_member
    6293                    .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$27)
    6294                    .dwattr $C$DW$390, DW_AT_name("compareInterruptEnable")
    6295                    .dwattr $C$DW$390, DW_AT_TI_symbol_name("compareInterruptEnable")
    6296                    .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6297                    .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  126

    6298                    .dwattr $C$DW$390, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6299                    .dwattr $C$DW$390, DW_AT_decl_line(0x14b)
    6300                    .dwattr $C$DW$390, DW_AT_decl_column(0x0e)
    6301            
    6302            $C$DW$391       .dwtag  DW_TAG_member
    6303                    .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$27)
    6304                    .dwattr $C$DW$391, DW_AT_name("compareOutputMode")
    6305                    .dwattr $C$DW$391, DW_AT_TI_symbol_name("compareOutputMode")
    6306                    .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6307                    .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6308                    .dwattr $C$DW$391, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6309                    .dwattr $C$DW$391, DW_AT_decl_line(0x156)
    6310                    .dwattr $C$DW$391, DW_AT_decl_column(0x0e)
    6311            
    6312            $C$DW$392       .dwtag  DW_TAG_member
    6313                    .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$27)
    6314                    .dwattr $C$DW$392, DW_AT_name("compareValue")
    6315                    .dwattr $C$DW$392, DW_AT_TI_symbol_name("compareValue")
    6316                    .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6317                    .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6318                    .dwattr $C$DW$392, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6319                    .dwattr $C$DW$392, DW_AT_decl_line(0x158)
    6320                    .dwattr $C$DW$392, DW_AT_decl_column(0x0e)
    6321            
    6322                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6323                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    6324                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    6325                    .dwendtag $C$DW$T$36
    6326            
    6327            $C$DW$T$70      .dwtag  DW_TAG_typedef
    6328                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    6329                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    6330                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    6331                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6332                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    6333                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    6334            
    6335            
    6336            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6337                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    6338                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    6339            $C$DW$393       .dwtag  DW_TAG_member
    6340                    .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$27)
    6341                    .dwattr $C$DW$393, DW_AT_name("clockSource")
    6342                    .dwattr $C$DW$393, DW_AT_TI_symbol_name("clockSource")
    6343                    .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6344                    .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6345                    .dwattr $C$DW$393, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6346                    .dwattr $C$DW$393, DW_AT_decl_line(0xd3)
    6347                    .dwattr $C$DW$393, DW_AT_decl_column(0x0e)
    6348            
    6349            $C$DW$394       .dwtag  DW_TAG_member
    6350                    .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$27)
    6351                    .dwattr $C$DW$394, DW_AT_name("clockSourceDivider")
    6352                    .dwattr $C$DW$394, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  127

    6353                    .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6354                    .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6355                    .dwattr $C$DW$394, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6356                    .dwattr $C$DW$394, DW_AT_decl_line(0xea)
    6357                    .dwattr $C$DW$394, DW_AT_decl_column(0x0e)
    6358            
    6359            $C$DW$395       .dwtag  DW_TAG_member
    6360                    .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$27)
    6361                    .dwattr $C$DW$395, DW_AT_name("timerInterruptEnable_TBIE")
    6362                    .dwattr $C$DW$395, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    6363                    .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6364                    .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6365                    .dwattr $C$DW$395, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6366                    .dwattr $C$DW$395, DW_AT_decl_line(0xef)
    6367                    .dwattr $C$DW$395, DW_AT_decl_column(0x0e)
    6368            
    6369            $C$DW$396       .dwtag  DW_TAG_member
    6370                    .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$27)
    6371                    .dwattr $C$DW$396, DW_AT_name("timerClear")
    6372                    .dwattr $C$DW$396, DW_AT_TI_symbol_name("timerClear")
    6373                    .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6374                    .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6375                    .dwattr $C$DW$396, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6376                    .dwattr $C$DW$396, DW_AT_decl_line(0xf5)
    6377                    .dwattr $C$DW$396, DW_AT_decl_column(0x0e)
    6378            
    6379            $C$DW$397       .dwtag  DW_TAG_member
    6380                    .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$30)
    6381                    .dwattr $C$DW$397, DW_AT_name("startTimer")
    6382                    .dwattr $C$DW$397, DW_AT_TI_symbol_name("startTimer")
    6383                    .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6384                    .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6385                    .dwattr $C$DW$397, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6386                    .dwattr $C$DW$397, DW_AT_decl_line(0xf7)
    6387                    .dwattr $C$DW$397, DW_AT_decl_column(0x0a)
    6388            
    6389                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6390                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    6391                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    6392                    .dwendtag $C$DW$T$37
    6393            
    6394            $C$DW$T$71      .dwtag  DW_TAG_typedef
    6395                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    6396                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    6397                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    6398                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6399                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    6400                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    6401            
    6402            
    6403            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6404                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    6405                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    6406            $C$DW$398       .dwtag  DW_TAG_member
    6407                    .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  128

    6408                    .dwattr $C$DW$398, DW_AT_name("clockSource")
    6409                    .dwattr $C$DW$398, DW_AT_TI_symbol_name("clockSource")
    6410                    .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6411                    .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6412                    .dwattr $C$DW$398, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6413                    .dwattr $C$DW$398, DW_AT_decl_line(0x107)
    6414                    .dwattr $C$DW$398, DW_AT_decl_column(0x0e)
    6415            
    6416            $C$DW$399       .dwtag  DW_TAG_member
    6417                    .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$27)
    6418                    .dwattr $C$DW$399, DW_AT_name("clockSourceDivider")
    6419                    .dwattr $C$DW$399, DW_AT_TI_symbol_name("clockSourceDivider")
    6420                    .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6421                    .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6422                    .dwattr $C$DW$399, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6423                    .dwattr $C$DW$399, DW_AT_decl_line(0x11e)
    6424                    .dwattr $C$DW$399, DW_AT_decl_column(0x0e)
    6425            
    6426            $C$DW$400       .dwtag  DW_TAG_member
    6427                    .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$27)
    6428                    .dwattr $C$DW$400, DW_AT_name("timerPeriod")
    6429                    .dwattr $C$DW$400, DW_AT_TI_symbol_name("timerPeriod")
    6430                    .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6431                    .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6432                    .dwattr $C$DW$400, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6433                    .dwattr $C$DW$400, DW_AT_decl_line(0x120)
    6434                    .dwattr $C$DW$400, DW_AT_decl_column(0x0e)
    6435            
    6436            $C$DW$401       .dwtag  DW_TAG_member
    6437                    .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$27)
    6438                    .dwattr $C$DW$401, DW_AT_name("timerInterruptEnable_TBIE")
    6439                    .dwattr $C$DW$401, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    6440                    .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6441                    .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6442                    .dwattr $C$DW$401, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6443                    .dwattr $C$DW$401, DW_AT_decl_line(0x125)
    6444                    .dwattr $C$DW$401, DW_AT_decl_column(0x0e)
    6445            
    6446            $C$DW$402       .dwtag  DW_TAG_member
    6447                    .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$27)
    6448                    .dwattr $C$DW$402, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6449                    .dwattr $C$DW$402, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6450                    .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6451                    .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6452                    .dwattr $C$DW$402, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6453                    .dwattr $C$DW$402, DW_AT_decl_line(0x12a)
    6454                    .dwattr $C$DW$402, DW_AT_decl_column(0x0e)
    6455            
    6456            $C$DW$403       .dwtag  DW_TAG_member
    6457                    .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$27)
    6458                    .dwattr $C$DW$403, DW_AT_name("timerClear")
    6459                    .dwattr $C$DW$403, DW_AT_TI_symbol_name("timerClear")
    6460                    .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6461                    .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6462                    .dwattr $C$DW$403, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  129

    6463                    .dwattr $C$DW$403, DW_AT_decl_line(0x130)
    6464                    .dwattr $C$DW$403, DW_AT_decl_column(0x0e)
    6465            
    6466            $C$DW$404       .dwtag  DW_TAG_member
    6467                    .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$30)
    6468                    .dwattr $C$DW$404, DW_AT_name("startTimer")
    6469                    .dwattr $C$DW$404, DW_AT_TI_symbol_name("startTimer")
    6470                    .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6471                    .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6472                    .dwattr $C$DW$404, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6473                    .dwattr $C$DW$404, DW_AT_decl_line(0x132)
    6474                    .dwattr $C$DW$404, DW_AT_decl_column(0x0a)
    6475            
    6476                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6477                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    6478                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    6479                    .dwendtag $C$DW$T$38
    6480            
    6481            $C$DW$T$72      .dwtag  DW_TAG_typedef
    6482                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    6483                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    6484                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6485                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6486                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    6487                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    6488            
    6489            
    6490            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6491                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    6492                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    6493            $C$DW$405       .dwtag  DW_TAG_member
    6494                    .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$27)
    6495                    .dwattr $C$DW$405, DW_AT_name("clockSource")
    6496                    .dwattr $C$DW$405, DW_AT_TI_symbol_name("clockSource")
    6497                    .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6498                    .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6499                    .dwattr $C$DW$405, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6500                    .dwattr $C$DW$405, DW_AT_decl_line(0x60)
    6501                    .dwattr $C$DW$405, DW_AT_decl_column(0x0e)
    6502            
    6503            $C$DW$406       .dwtag  DW_TAG_member
    6504                    .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$27)
    6505                    .dwattr $C$DW$406, DW_AT_name("clockSourceDivider")
    6506                    .dwattr $C$DW$406, DW_AT_TI_symbol_name("clockSourceDivider")
    6507                    .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6508                    .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6509                    .dwattr $C$DW$406, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6510                    .dwattr $C$DW$406, DW_AT_decl_line(0x77)
    6511                    .dwattr $C$DW$406, DW_AT_decl_column(0x0e)
    6512            
    6513            $C$DW$407       .dwtag  DW_TAG_member
    6514                    .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$27)
    6515                    .dwattr $C$DW$407, DW_AT_name("timerPeriod")
    6516                    .dwattr $C$DW$407, DW_AT_TI_symbol_name("timerPeriod")
    6517                    .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  130

    6518                    .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6519                    .dwattr $C$DW$407, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6520                    .dwattr $C$DW$407, DW_AT_decl_line(0x7a)
    6521                    .dwattr $C$DW$407, DW_AT_decl_column(0x0e)
    6522            
    6523            $C$DW$408       .dwtag  DW_TAG_member
    6524                    .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$27)
    6525                    .dwattr $C$DW$408, DW_AT_name("timerInterruptEnable_TBIE")
    6526                    .dwattr $C$DW$408, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    6527                    .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6528                    .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6529                    .dwattr $C$DW$408, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6530                    .dwattr $C$DW$408, DW_AT_decl_line(0x7f)
    6531                    .dwattr $C$DW$408, DW_AT_decl_column(0x0e)
    6532            
    6533            $C$DW$409       .dwtag  DW_TAG_member
    6534                    .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$27)
    6535                    .dwattr $C$DW$409, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6536                    .dwattr $C$DW$409, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6537                    .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6538                    .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6539                    .dwattr $C$DW$409, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6540                    .dwattr $C$DW$409, DW_AT_decl_line(0x84)
    6541                    .dwattr $C$DW$409, DW_AT_decl_column(0x0e)
    6542            
    6543            $C$DW$410       .dwtag  DW_TAG_member
    6544                    .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$27)
    6545                    .dwattr $C$DW$410, DW_AT_name("timerClear")
    6546                    .dwattr $C$DW$410, DW_AT_TI_symbol_name("timerClear")
    6547                    .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6548                    .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6549                    .dwattr $C$DW$410, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6550                    .dwattr $C$DW$410, DW_AT_decl_line(0x8a)
    6551                    .dwattr $C$DW$410, DW_AT_decl_column(0x0e)
    6552            
    6553            $C$DW$411       .dwtag  DW_TAG_member
    6554                    .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$30)
    6555                    .dwattr $C$DW$411, DW_AT_name("startTimer")
    6556                    .dwattr $C$DW$411, DW_AT_TI_symbol_name("startTimer")
    6557                    .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6558                    .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6559                    .dwattr $C$DW$411, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6560                    .dwattr $C$DW$411, DW_AT_decl_line(0x8c)
    6561                    .dwattr $C$DW$411, DW_AT_decl_column(0x0a)
    6562            
    6563                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6564                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    6565                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    6566                    .dwendtag $C$DW$T$39
    6567            
    6568            $C$DW$T$73      .dwtag  DW_TAG_typedef
    6569                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    6570                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    6571                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6572                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  131

    6573                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    6574                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    6575            
    6576            
    6577            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6578                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    6579                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    6580            $C$DW$412       .dwtag  DW_TAG_member
    6581                    .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$27)
    6582                    .dwattr $C$DW$412, DW_AT_name("clockSource")
    6583                    .dwattr $C$DW$412, DW_AT_TI_symbol_name("clockSource")
    6584                    .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6585                    .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6586                    .dwattr $C$DW$412, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6587                    .dwattr $C$DW$412, DW_AT_decl_line(0x20)
    6588                    .dwattr $C$DW$412, DW_AT_decl_column(0x0e)
    6589            
    6590            $C$DW$413       .dwtag  DW_TAG_member
    6591                    .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$27)
    6592                    .dwattr $C$DW$413, DW_AT_name("clockSourceDivider")
    6593                    .dwattr $C$DW$413, DW_AT_TI_symbol_name("clockSourceDivider")
    6594                    .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6595                    .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6596                    .dwattr $C$DW$413, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6597                    .dwattr $C$DW$413, DW_AT_decl_line(0x37)
    6598                    .dwattr $C$DW$413, DW_AT_decl_column(0x0e)
    6599            
    6600            $C$DW$414       .dwtag  DW_TAG_member
    6601                    .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$27)
    6602                    .dwattr $C$DW$414, DW_AT_name("timerPeriod")
    6603                    .dwattr $C$DW$414, DW_AT_TI_symbol_name("timerPeriod")
    6604                    .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6605                    .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6606                    .dwattr $C$DW$414, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6607                    .dwattr $C$DW$414, DW_AT_decl_line(0x39)
    6608                    .dwattr $C$DW$414, DW_AT_decl_column(0x0e)
    6609            
    6610            $C$DW$415       .dwtag  DW_TAG_member
    6611                    .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$27)
    6612                    .dwattr $C$DW$415, DW_AT_name("compareRegister")
    6613                    .dwattr $C$DW$415, DW_AT_TI_symbol_name("compareRegister")
    6614                    .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6615                    .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6616                    .dwattr $C$DW$415, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6617                    .dwattr $C$DW$415, DW_AT_decl_line(0x44)
    6618                    .dwattr $C$DW$415, DW_AT_decl_column(0x0e)
    6619            
    6620            $C$DW$416       .dwtag  DW_TAG_member
    6621                    .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$27)
    6622                    .dwattr $C$DW$416, DW_AT_name("compareOutputMode")
    6623                    .dwattr $C$DW$416, DW_AT_TI_symbol_name("compareOutputMode")
    6624                    .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6625                    .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6626                    .dwattr $C$DW$416, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6627                    .dwattr $C$DW$416, DW_AT_decl_line(0x4f)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  132

    6628                    .dwattr $C$DW$416, DW_AT_decl_column(0x0e)
    6629            
    6630            $C$DW$417       .dwtag  DW_TAG_member
    6631                    .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$27)
    6632                    .dwattr $C$DW$417, DW_AT_name("dutyCycle")
    6633                    .dwattr $C$DW$417, DW_AT_TI_symbol_name("dutyCycle")
    6634                    .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6635                    .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6636                    .dwattr $C$DW$417, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6637                    .dwattr $C$DW$417, DW_AT_decl_line(0x51)
    6638                    .dwattr $C$DW$417, DW_AT_decl_column(0x0e)
    6639            
    6640                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6641                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    6642                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    6643                    .dwendtag $C$DW$T$40
    6644            
    6645            $C$DW$T$74      .dwtag  DW_TAG_typedef
    6646                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    6647                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    6648                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    6649                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6650                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    6651                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    6652            
    6653            
    6654            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6655                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    6656                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    6657            $C$DW$418       .dwtag  DW_TAG_member
    6658                    .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$24)
    6659                    .dwattr $C$DW$418, DW_AT_name("selectClockSource")
    6660                    .dwattr $C$DW$418, DW_AT_TI_symbol_name("selectClockSource")
    6661                    .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6662                    .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6663                    .dwattr $C$DW$418, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6664                    .dwattr $C$DW$418, DW_AT_decl_line(0x1c)
    6665                    .dwattr $C$DW$418, DW_AT_decl_column(0x0d)
    6666            
    6667            $C$DW$419       .dwtag  DW_TAG_member
    6668                    .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$27)
    6669                    .dwattr $C$DW$419, DW_AT_name("clockPrescalar")
    6670                    .dwattr $C$DW$419, DW_AT_TI_symbol_name("clockPrescalar")
    6671                    .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6672                    .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6673                    .dwattr $C$DW$419, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6674                    .dwattr $C$DW$419, DW_AT_decl_line(0x1e)
    6675                    .dwattr $C$DW$419, DW_AT_decl_column(0x0e)
    6676            
    6677            $C$DW$420       .dwtag  DW_TAG_member
    6678                    .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$24)
    6679                    .dwattr $C$DW$420, DW_AT_name("firstModReg")
    6680                    .dwattr $C$DW$420, DW_AT_TI_symbol_name("firstModReg")
    6681                    .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6682                    .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  133

    6683                    .dwattr $C$DW$420, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6684                    .dwattr $C$DW$420, DW_AT_decl_line(0x22)
    6685                    .dwattr $C$DW$420, DW_AT_decl_column(0x0d)
    6686            
    6687            $C$DW$421       .dwtag  DW_TAG_member
    6688                    .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$24)
    6689                    .dwattr $C$DW$421, DW_AT_name("secondModReg")
    6690                    .dwattr $C$DW$421, DW_AT_TI_symbol_name("secondModReg")
    6691                    .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6692                    .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6693                    .dwattr $C$DW$421, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6694                    .dwattr $C$DW$421, DW_AT_decl_line(0x26)
    6695                    .dwattr $C$DW$421, DW_AT_decl_column(0x0d)
    6696            
    6697            $C$DW$422       .dwtag  DW_TAG_member
    6698                    .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$24)
    6699                    .dwattr $C$DW$422, DW_AT_name("parity")
    6700                    .dwattr $C$DW$422, DW_AT_TI_symbol_name("parity")
    6701                    .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6702                    .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6703                    .dwattr $C$DW$422, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6704                    .dwattr $C$DW$422, DW_AT_decl_line(0x2c)
    6705                    .dwattr $C$DW$422, DW_AT_decl_column(0x0d)
    6706            
    6707            $C$DW$423       .dwtag  DW_TAG_member
    6708                    .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$24)
    6709                    .dwattr $C$DW$423, DW_AT_name("msborLsbFirst")
    6710                    .dwattr $C$DW$423, DW_AT_TI_symbol_name("msborLsbFirst")
    6711                    .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6712                    .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6713                    .dwattr $C$DW$423, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6714                    .dwattr $C$DW$423, DW_AT_decl_line(0x31)
    6715                    .dwattr $C$DW$423, DW_AT_decl_column(0x0d)
    6716            
    6717            $C$DW$424       .dwtag  DW_TAG_member
    6718                    .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$24)
    6719                    .dwattr $C$DW$424, DW_AT_name("numberofStopBits")
    6720                    .dwattr $C$DW$424, DW_AT_TI_symbol_name("numberofStopBits")
    6721                    .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6722                    .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6723                    .dwattr $C$DW$424, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6724                    .dwattr $C$DW$424, DW_AT_decl_line(0x36)
    6725                    .dwattr $C$DW$424, DW_AT_decl_column(0x0d)
    6726            
    6727            $C$DW$425       .dwtag  DW_TAG_member
    6728                    .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    6729                    .dwattr $C$DW$425, DW_AT_name("uartMode")
    6730                    .dwattr $C$DW$425, DW_AT_TI_symbol_name("uartMode")
    6731                    .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6732                    .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6733                    .dwattr $C$DW$425, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6734                    .dwattr $C$DW$425, DW_AT_decl_line(0x3d)
    6735                    .dwattr $C$DW$425, DW_AT_decl_column(0x0d)
    6736            
    6737            $C$DW$426       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  134

    6738                    .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$24)
    6739                    .dwattr $C$DW$426, DW_AT_name("overSampling")
    6740                    .dwattr $C$DW$426, DW_AT_TI_symbol_name("overSampling")
    6741                    .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6742                    .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6743                    .dwattr $C$DW$426, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6744                    .dwattr $C$DW$426, DW_AT_decl_line(0x42)
    6745                    .dwattr $C$DW$426, DW_AT_decl_column(0x0d)
    6746            
    6747                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6748                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    6749                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6750                    .dwendtag $C$DW$T$41
    6751            
    6752            $C$DW$T$75      .dwtag  DW_TAG_typedef
    6753                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    6754                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    6755                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    6756                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6757                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    6758                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    6759            
    6760            
    6761            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6762                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    6763                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    6764            $C$DW$427       .dwtag  DW_TAG_member
    6765                    .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$43)
    6766                    .dwattr $C$DW$427, DW_AT_name("clockSourceFrequency")
    6767                    .dwattr $C$DW$427, DW_AT_TI_symbol_name("clockSourceFrequency")
    6768                    .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6769                    .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6770                    .dwattr $C$DW$427, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6771                    .dwattr $C$DW$427, DW_AT_decl_line(0x31)
    6772                    .dwattr $C$DW$427, DW_AT_decl_column(0x0e)
    6773            
    6774            $C$DW$428       .dwtag  DW_TAG_member
    6775                    .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$43)
    6776                    .dwattr $C$DW$428, DW_AT_name("desiredSpiClock")
    6777                    .dwattr $C$DW$428, DW_AT_TI_symbol_name("desiredSpiClock")
    6778                    .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6779                    .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6780                    .dwattr $C$DW$428, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6781                    .dwattr $C$DW$428, DW_AT_decl_line(0x33)
    6782                    .dwattr $C$DW$428, DW_AT_decl_column(0x0e)
    6783            
    6784                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6785                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    6786                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    6787                    .dwendtag $C$DW$T$44
    6788            
    6789            $C$DW$T$76      .dwtag  DW_TAG_typedef
    6790                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    6791                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    6792                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:02:21 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Initialize.asm                                                       PAGE  135

    6793                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6794                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    6795                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    6796            
    6797            
    6798            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6799                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    6800                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    6801            $C$DW$429       .dwtag  DW_TAG_member
    6802                    .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    6803                    .dwattr $C$DW$429, DW_AT_name("selectClockSource")
    6804                    .dwattr $C$DW$429, DW_AT_TI_symbol_name("selectClockSource")
    6805                    .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6806                    .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6807                    .dwattr $C$DW$429, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6808                    .dwattr $C$DW$429, DW_AT_decl_line(0x14)
    6809                    .dwattr $C$DW$429, DW_AT_decl_column(0x0d)
    6810            
    6811            $C$DW$430       .dwtag  DW_TAG_member
    6812                    .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$43)
    6813                    .dwattr $C$DW$430, DW_AT_name("clockSourceFrequency")
    6814                    .dwattr $C$DW$430, DW_AT_TI_symbol_name("clockSourceFrequency")
    6815                    .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6816                    .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6817                    .dwattr $C$DW$430, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6818                    .dwattr $C$DW$430, DW_AT_decl_line(0x16)
    6819                    .dwattr $C$DW$430, DW_AT_decl_column(0x0e)
    6820            
    6821            $C$DW$431       .dwtag  DW_TAG_member
    6822                    .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$43)
    6823                    .dwattr $C$DW$431, DW_AT_name("desiredSpiClock")
    6824                    .dwattr $C$DW$431, DW_AT_TI_symbol_name("desiredSpiClock")
    6825                    .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6826                    .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6827                    .dwattr $C$DW$431, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6828                    .dwattr $C$DW$431, DW_AT_decl_line(0x18)
    6829                    .dwattr $C$DW$431, DW_AT_decl_column(0x0e)
    6830            
    6831            $C$DW$432       .dwtag  DW_TAG_member
    6832                    .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
    6833                    .dwattr $C$DW$432, DW_AT_name("msbFirst")
    6834                    .dwattr $C$DW$432, DW_AT_TI_symbol_name("msbFirst")
    6835                    .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6836                    .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6837                    .dwattr $C$DW$432, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6838                    .dwattr $C$DW$432, DW_AT_decl_line(0x1d)
    6839                    .dwattr $C$DW$432, DW_AT_decl_column(0x0d)
    6840            
    6841            $C$DW$433       .dwtag  DW_TAG_member
    6842                    .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$24)
