MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 14:10:54 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/ISR.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            ;       Interrupt vector table mappings
      13 000000               .intvec ".int47",       P1_ISR
         000000       
      14 000000               .intvec ".int53",       Timer_A
         000000       
      15 000000               .intvec ".int54",       TA0_ISR

    4527                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4528                    .dwattr $C$DW$198, DW_AT_decl_line(0x76)
    4529                    .dwattr $C$DW$198, DW_AT_decl_column(0x05)
    4530            
    4531            $C$DW$199       .dwtag  DW_TAG_enumerator
    4532                    .dwattr $C$DW$199, DW_AT_name("ack")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   90

    4533                    .dwattr $C$DW$199, DW_AT_const_value(0x07)
    4534                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4535                    .dwattr $C$DW$199, DW_AT_decl_line(0x77)
    4536                    .dwattr $C$DW$199, DW_AT_decl_column(0x05)
    4537            
    4538            $C$DW$200       .dwtag  DW_TAG_enumerator
    4539                    .dwattr $C$DW$200, DW_AT_name("var")
    4540                    .dwattr $C$DW$200, DW_AT_const_value(0x08)
    4541                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4542                    .dwattr $C$DW$200, DW_AT_decl_line(0x78)
    4543                    .dwattr $C$DW$200, DW_AT_decl_column(0x05)
    4544            
    4545            $C$DW$201       .dwtag  DW_TAG_enumerator
    4546                    .dwattr $C$DW$201, DW_AT_name("UGmsg")
    4547                    .dwattr $C$DW$201, DW_AT_const_value(0x09)
    4548                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4549                    .dwattr $C$DW$201, DW_AT_decl_line(0x79)
    4550                    .dwattr $C$DW$201, DW_AT_decl_column(0x05)
    4551            
    4552                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4553                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    4554                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    4555                    .dwendtag $C$DW$T$57
    4556            
    4557            $C$DW$T$58      .dwtag  DW_TAG_typedef
    4558                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    4559                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4560                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4561                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4562                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    4563                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4564            
    4565            
    4566            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    4567                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    4568            $C$DW$202       .dwtag  DW_TAG_enumerator
    4569                    .dwattr $C$DW$202, DW_AT_name("init")
    4570                    .dwattr $C$DW$202, DW_AT_const_value(0x00)
    4571                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4572                    .dwattr $C$DW$202, DW_AT_decl_line(0x80)
    4573                    .dwattr $C$DW$202, DW_AT_decl_column(0x05)
    4574            
    4575            $C$DW$203       .dwtag  DW_TAG_enumerator
    4576                    .dwattr $C$DW$203, DW_AT_name("running")
    4577                    .dwattr $C$DW$203, DW_AT_const_value(0x01)
    4578                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4579                    .dwattr $C$DW$203, DW_AT_decl_line(0x80)
    4580                    .dwattr $C$DW$203, DW_AT_decl_column(0x0b)
    4581            
    4582            $C$DW$204       .dwtag  DW_TAG_enumerator
    4583                    .dwattr $C$DW$204, DW_AT_name("wait")
    4584                    .dwattr $C$DW$204, DW_AT_const_value(0x02)
    4585                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4586                    .dwattr $C$DW$204, DW_AT_decl_line(0x80)
    4587                    .dwattr $C$DW$204, DW_AT_decl_column(0x14)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   91

    4588            
    4589                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4590                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    4591                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4592                    .dwendtag $C$DW$T$59
    4593            
    4594            $C$DW$T$60      .dwtag  DW_TAG_typedef
    4595                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    4596                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4597                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4598                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4599                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    4600                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    4601            
    4602            
    4603            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4604                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4605            $C$DW$205       .dwtag  DW_TAG_member
    4606                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$14)
    4607                    .dwattr $C$DW$205, DW_AT_name("__max_align1")
    4608                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("__max_align1")
    4609                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4610                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4611                    .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4612                    .dwattr $C$DW$205, DW_AT_decl_line(0x7b)
    4613                    .dwattr $C$DW$205, DW_AT_decl_column(0x0c)
    4614            
    4615            $C$DW$206       .dwtag  DW_TAG_member
    4616                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$18)
    4617                    .dwattr $C$DW$206, DW_AT_name("__max_align2")
    4618                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("__max_align2")
    4619                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4620                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4621                    .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4622                    .dwattr $C$DW$206, DW_AT_decl_line(0x7c)
    4623                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    4624            
    4625                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4626                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    4627                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4628                    .dwendtag $C$DW$T$22
    4629            
    4630            $C$DW$T$61      .dwtag  DW_TAG_typedef
    4631                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    4632                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    4633                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4634                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4635                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    4636                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    4637            
    4638            
    4639            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4640                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    4641                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    4642            $C$DW$207       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   92

    4643                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$24)
    4644                    .dwattr $C$DW$207, DW_AT_name("memoryBufferControlIndex")
    4645                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    4646                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4647                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4648                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4649                    .dwattr $C$DW$207, DW_AT_decl_line(0x27)
    4650                    .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    4651            
    4652            $C$DW$208       .dwtag  DW_TAG_member
    4653                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    4654                    .dwattr $C$DW$208, DW_AT_name("inputSourceSelect")
    4655                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("inputSourceSelect")
    4656                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4657                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4658                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4659                    .dwattr $C$DW$208, DW_AT_decl_line(0x3b)
    4660                    .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    4661            
    4662            $C$DW$209       .dwtag  DW_TAG_member
    4663                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$24)
    4664                    .dwattr $C$DW$209, DW_AT_name("positiveRefVoltageSourceSelect")
    4665                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    4666                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4667                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4668                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4669                    .dwattr $C$DW$209, DW_AT_decl_line(0x42)
    4670                    .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    4671            
    4672            $C$DW$210       .dwtag  DW_TAG_member
    4673                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$24)
    4674                    .dwattr $C$DW$210, DW_AT_name("negativeRefVoltageSourceSelect")
    4675                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    4676                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4677                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4678                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4679                    .dwattr $C$DW$210, DW_AT_decl_line(0x48)
    4680                    .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    4681            
    4682            $C$DW$211       .dwtag  DW_TAG_member
    4683                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$24)
    4684                    .dwattr $C$DW$211, DW_AT_name("endOfSequence")
    4685                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("endOfSequence")
    4686                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4687                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4688                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4689                    .dwattr $C$DW$211, DW_AT_decl_line(0x51)
    4690                    .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    4691            
    4692                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4693                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    4694                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4695                    .dwendtag $C$DW$T$25
    4696            
    4697            $C$DW$T$62      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   93

    4698                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    4699                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    4700                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4701                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4702                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    4703                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    4704            
    4705            
    4706            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4707                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    4708                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    4709            $C$DW$212       .dwtag  DW_TAG_member
    4710                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    4711                    .dwattr $C$DW$212, DW_AT_name("captureRegister")
    4712                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("captureRegister")
    4713                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4714                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4715                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4716                    .dwattr $C$DW$212, DW_AT_decl_line(0x58)
    4717                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    4718            
    4719            $C$DW$213       .dwtag  DW_TAG_member
    4720                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    4721                    .dwattr $C$DW$213, DW_AT_name("captureMode")
    4722                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("captureMode")
    4723                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4724                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4725                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4726                    .dwattr $C$DW$213, DW_AT_decl_line(0x5f)
    4727                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    4728            
    4729            $C$DW$214       .dwtag  DW_TAG_member
    4730                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    4731                    .dwattr $C$DW$214, DW_AT_name("captureInputSelect")
    4732                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("captureInputSelect")
    4733                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4734                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4735                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4736                    .dwattr $C$DW$214, DW_AT_decl_line(0x66)
    4737                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    4738            
    4739            $C$DW$215       .dwtag  DW_TAG_member
    4740                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    4741                    .dwattr $C$DW$215, DW_AT_name("synchronizeCaptureSource")
    4742                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4743                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4744                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4745                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4746                    .dwattr $C$DW$215, DW_AT_decl_line(0x6b)
    4747                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    4748            
    4749            $C$DW$216       .dwtag  DW_TAG_member
    4750                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    4751                    .dwattr $C$DW$216, DW_AT_name("captureInterruptEnable")
    4752                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("captureInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   94

    4753                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4754                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4755                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4756                    .dwattr $C$DW$216, DW_AT_decl_line(0x70)
    4757                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    4758            
    4759            $C$DW$217       .dwtag  DW_TAG_member
    4760                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    4761                    .dwattr $C$DW$217, DW_AT_name("captureOutputMode")
    4762                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("captureOutputMode")
    4763                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4764                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4765                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4766                    .dwattr $C$DW$217, DW_AT_decl_line(0x7b)
    4767                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    4768            
    4769                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4770                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    4771                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4772                    .dwendtag $C$DW$T$28
    4773            
    4774            $C$DW$T$63      .dwtag  DW_TAG_typedef
    4775                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    4776                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    4777                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4778                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4779                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    4780                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    4781            
    4782            
    4783            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4784                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    4785                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4786            $C$DW$218       .dwtag  DW_TAG_member
    4787                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    4788                    .dwattr $C$DW$218, DW_AT_name("compareRegister")
    4789                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("compareRegister")
    4790                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4791                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4792                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4793                    .dwattr $C$DW$218, DW_AT_decl_line(0x145)
    4794                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    4795            
    4796            $C$DW$219       .dwtag  DW_TAG_member
    4797                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    4798                    .dwattr $C$DW$219, DW_AT_name("compareInterruptEnable")
    4799                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("compareInterruptEnable")
    4800                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4801                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4802                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4803                    .dwattr $C$DW$219, DW_AT_decl_line(0x14a)
    4804                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    4805            
    4806            $C$DW$220       .dwtag  DW_TAG_member
    4807                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   95

    4808                    .dwattr $C$DW$220, DW_AT_name("compareOutputMode")
    4809                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("compareOutputMode")
    4810                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4811                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4812                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4813                    .dwattr $C$DW$220, DW_AT_decl_line(0x155)
    4814                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    4815            
    4816            $C$DW$221       .dwtag  DW_TAG_member
    4817                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    4818                    .dwattr $C$DW$221, DW_AT_name("compareValue")
    4819                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("compareValue")
    4820                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4821                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4822                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4823                    .dwattr $C$DW$221, DW_AT_decl_line(0x157)
    4824                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    4825            
    4826                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4827                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4828                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4829                    .dwendtag $C$DW$T$29
    4830            
    4831            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4832                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4833                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4834                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4835                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4836                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4837                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    4838            
    4839            
    4840            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4841                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    4842                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4843            $C$DW$222       .dwtag  DW_TAG_member
    4844                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    4845                    .dwattr $C$DW$222, DW_AT_name("clockSource")
    4846                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("clockSource")
    4847                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4848                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4849                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4850                    .dwattr $C$DW$222, DW_AT_decl_line(0x20)
    4851                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    4852            
    4853            $C$DW$223       .dwtag  DW_TAG_member
    4854                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    4855                    .dwattr $C$DW$223, DW_AT_name("clockSourceDivider")
    4856                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("clockSourceDivider")
    4857                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4858                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4859                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4860                    .dwattr $C$DW$223, DW_AT_decl_line(0x37)
    4861                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    4862            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   96

    4863            $C$DW$224       .dwtag  DW_TAG_member
    4864                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    4865                    .dwattr $C$DW$224, DW_AT_name("timerInterruptEnable_TAIE")
    4866                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4867                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4868                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4869                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4870                    .dwattr $C$DW$224, DW_AT_decl_line(0x3c)
    4871                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    4872            
    4873            $C$DW$225       .dwtag  DW_TAG_member
    4874                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    4875                    .dwattr $C$DW$225, DW_AT_name("timerClear")
    4876                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("timerClear")
    4877                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4878                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4879                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4880                    .dwattr $C$DW$225, DW_AT_decl_line(0x42)
    4881                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    4882            
    4883            $C$DW$226       .dwtag  DW_TAG_member
    4884                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$30)
    4885                    .dwattr $C$DW$226, DW_AT_name("startTimer")
    4886                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("startTimer")
    4887                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4888                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4889                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4890                    .dwattr $C$DW$226, DW_AT_decl_line(0x44)
    4891                    .dwattr $C$DW$226, DW_AT_decl_column(0x0a)
    4892            
    4893                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4894                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    4895                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4896                    .dwendtag $C$DW$T$31
    4897            
    4898            $C$DW$T$65      .dwtag  DW_TAG_typedef
    4899                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    4900                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    4901                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4902                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4903                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    4904                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4905            
    4906            
    4907            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4908                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    4909                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    4910            $C$DW$227       .dwtag  DW_TAG_member
    4911                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4912                    .dwattr $C$DW$227, DW_AT_name("clockSource")
    4913                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("clockSource")
    4914                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4915                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4916                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4917                    .dwattr $C$DW$227, DW_AT_decl_line(0x8b)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   97

    4918                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4919            
    4920            $C$DW$228       .dwtag  DW_TAG_member
    4921                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4922                    .dwattr $C$DW$228, DW_AT_name("clockSourceDivider")
    4923                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("clockSourceDivider")
    4924                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4925                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4926                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4927                    .dwattr $C$DW$228, DW_AT_decl_line(0xa2)
    4928                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4929            
    4930            $C$DW$229       .dwtag  DW_TAG_member
    4931                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4932                    .dwattr $C$DW$229, DW_AT_name("timerPeriod")
    4933                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("timerPeriod")
    4934                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4935                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4936                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4937                    .dwattr $C$DW$229, DW_AT_decl_line(0xa4)
    4938                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4939            
    4940            $C$DW$230       .dwtag  DW_TAG_member
    4941                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    4942                    .dwattr $C$DW$230, DW_AT_name("timerInterruptEnable_TAIE")
    4943                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4944                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4945                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4946                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4947                    .dwattr $C$DW$230, DW_AT_decl_line(0xa9)
    4948                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4949            
    4950            $C$DW$231       .dwtag  DW_TAG_member
    4951                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    4952                    .dwattr $C$DW$231, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4953                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4954                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4955                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4956                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4957                    .dwattr $C$DW$231, DW_AT_decl_line(0xae)
    4958                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4959            
    4960            $C$DW$232       .dwtag  DW_TAG_member
    4961                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    4962                    .dwattr $C$DW$232, DW_AT_name("timerClear")
    4963                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("timerClear")
    4964                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4965                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4966                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4967                    .dwattr $C$DW$232, DW_AT_decl_line(0xb4)
    4968                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    4969            
    4970            $C$DW$233       .dwtag  DW_TAG_member
    4971                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$30)
    4972                    .dwattr $C$DW$233, DW_AT_name("startTimer")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   98

    4973                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("startTimer")
    4974                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4975                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4976                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4977                    .dwattr $C$DW$233, DW_AT_decl_line(0xb6)
    4978                    .dwattr $C$DW$233, DW_AT_decl_column(0x0a)
    4979            
    4980                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4981                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    4982                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4983                    .dwendtag $C$DW$T$32
    4984            
    4985            $C$DW$T$66      .dwtag  DW_TAG_typedef
    4986                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    4987                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    4988                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4989                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4990                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    4991                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    4992            
    4993            
    4994            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4995                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    4996                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    4997            $C$DW$234       .dwtag  DW_TAG_member
    4998                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4999                    .dwattr $C$DW$234, DW_AT_name("clockSource")
    5000                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("clockSource")
    5001                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5002                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    5003                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5004                    .dwattr $C$DW$234, DW_AT_decl_line(0x105)
    5005                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    5006            
    5007            $C$DW$235       .dwtag  DW_TAG_member
    5008                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    5009                    .dwattr $C$DW$235, DW_AT_name("clockSourceDivider")
    5010                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("clockSourceDivider")
    5011                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5012                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    5013                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5014                    .dwattr $C$DW$235, DW_AT_decl_line(0x11c)
    5015                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    5016            
    5017            $C$DW$236       .dwtag  DW_TAG_member
    5018                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    5019                    .dwattr $C$DW$236, DW_AT_name("timerPeriod")
    5020                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("timerPeriod")
    5021                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5022                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    5023                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5024                    .dwattr $C$DW$236, DW_AT_decl_line(0x11f)
    5025                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    5026            
    5027            $C$DW$237       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE   99

    5028                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    5029                    .dwattr $C$DW$237, DW_AT_name("timerInterruptEnable_TAIE")
    5030                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5031                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5032                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    5033                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5034                    .dwattr $C$DW$237, DW_AT_decl_line(0x124)
    5035                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    5036            
    5037            $C$DW$238       .dwtag  DW_TAG_member
    5038                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    5039                    .dwattr $C$DW$238, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5040                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5041                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5042                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    5043                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5044                    .dwattr $C$DW$238, DW_AT_decl_line(0x129)
    5045                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    5046            
    5047            $C$DW$239       .dwtag  DW_TAG_member
    5048                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    5049                    .dwattr $C$DW$239, DW_AT_name("timerClear")
    5050                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("timerClear")
    5051                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5052                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    5053                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5054                    .dwattr $C$DW$239, DW_AT_decl_line(0x12f)
    5055                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    5056            
    5057            $C$DW$240       .dwtag  DW_TAG_member
    5058                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$30)
    5059                    .dwattr $C$DW$240, DW_AT_name("startTimer")
    5060                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("startTimer")
    5061                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5062                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    5063                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5064                    .dwattr $C$DW$240, DW_AT_decl_line(0x131)
    5065                    .dwattr $C$DW$240, DW_AT_decl_column(0x0a)
    5066            
    5067                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5068                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    5069                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    5070                    .dwendtag $C$DW$T$33
    5071            
    5072            $C$DW$T$67      .dwtag  DW_TAG_typedef
    5073                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    5074                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    5075                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    5076                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5077                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    5078                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    5079            
    5080            
    5081            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5082                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  100

    5083                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    5084            $C$DW$241       .dwtag  DW_TAG_member
    5085                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    5086                    .dwattr $C$DW$241, DW_AT_name("clockSource")
    5087                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("clockSource")
    5088                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5089                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    5090                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5091                    .dwattr $C$DW$241, DW_AT_decl_line(0xc5)
    5092                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    5093            
    5094            $C$DW$242       .dwtag  DW_TAG_member
    5095                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$27)
    5096                    .dwattr $C$DW$242, DW_AT_name("clockSourceDivider")
    5097                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("clockSourceDivider")
    5098                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5099                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    5100                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5101                    .dwattr $C$DW$242, DW_AT_decl_line(0xdc)
    5102                    .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
    5103            
    5104            $C$DW$243       .dwtag  DW_TAG_member
    5105                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    5106                    .dwattr $C$DW$243, DW_AT_name("timerPeriod")
    5107                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("timerPeriod")
    5108                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5109                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    5110                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5111                    .dwattr $C$DW$243, DW_AT_decl_line(0xde)
    5112                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    5113            
    5114            $C$DW$244       .dwtag  DW_TAG_member
    5115                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    5116                    .dwattr $C$DW$244, DW_AT_name("compareRegister")
    5117                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("compareRegister")
    5118                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5119                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5120                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5121                    .dwattr $C$DW$244, DW_AT_decl_line(0xe9)
    5122                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    5123            
    5124            $C$DW$245       .dwtag  DW_TAG_member
    5125                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    5126                    .dwattr $C$DW$245, DW_AT_name("compareOutputMode")
    5127                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("compareOutputMode")
    5128                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5129                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5130                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5131                    .dwattr $C$DW$245, DW_AT_decl_line(0xf4)
    5132                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    5133            
    5134            $C$DW$246       .dwtag  DW_TAG_member
    5135                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    5136                    .dwattr $C$DW$246, DW_AT_name("dutyCycle")
    5137                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("dutyCycle")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  101

    5138                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5139                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5140                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5141                    .dwattr $C$DW$246, DW_AT_decl_line(0xf6)
    5142                    .dwattr $C$DW$246, DW_AT_decl_column(0x0e)
    5143            
    5144                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5145                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    5146                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    5147                    .dwendtag $C$DW$T$34
    5148            
    5149            $C$DW$T$68      .dwtag  DW_TAG_typedef
    5150                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    5151                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    5152                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    5153                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5154                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    5155                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    5156            
    5157            
    5158            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5159                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    5160                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    5161            $C$DW$247       .dwtag  DW_TAG_member
    5162                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    5163                    .dwattr $C$DW$247, DW_AT_name("captureRegister")
    5164                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("captureRegister")
    5165                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5166                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5167                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5168                    .dwattr $C$DW$247, DW_AT_decl_line(0xa0)
    5169                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    5170            
    5171            $C$DW$248       .dwtag  DW_TAG_member
    5172                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    5173                    .dwattr $C$DW$248, DW_AT_name("captureMode")
    5174                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("captureMode")
    5175                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5176                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5177                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5178                    .dwattr $C$DW$248, DW_AT_decl_line(0xa7)
    5179                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    5180            
    5181            $C$DW$249       .dwtag  DW_TAG_member
    5182                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    5183                    .dwattr $C$DW$249, DW_AT_name("captureInputSelect")
    5184                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("captureInputSelect")
    5185                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5186                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5187                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5188                    .dwattr $C$DW$249, DW_AT_decl_line(0xae)
    5189                    .dwattr $C$DW$249, DW_AT_decl_column(0x0e)
    5190            
    5191            $C$DW$250       .dwtag  DW_TAG_member
    5192                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  102

    5193                    .dwattr $C$DW$250, DW_AT_name("synchronizeCaptureSource")
    5194                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    5195                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5196                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5197                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5198                    .dwattr $C$DW$250, DW_AT_decl_line(0xb3)
    5199                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    5200            
    5201            $C$DW$251       .dwtag  DW_TAG_member
    5202                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    5203                    .dwattr $C$DW$251, DW_AT_name("captureInterruptEnable")
    5204                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("captureInterruptEnable")
    5205                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5206                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5207                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5208                    .dwattr $C$DW$251, DW_AT_decl_line(0xb8)
    5209                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    5210            
    5211            $C$DW$252       .dwtag  DW_TAG_member
    5212                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    5213                    .dwattr $C$DW$252, DW_AT_name("captureOutputMode")
    5214                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("captureOutputMode")
    5215                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5216                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5217                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5218                    .dwattr $C$DW$252, DW_AT_decl_line(0xc3)
    5219                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    5220            
    5221                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5222                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    5223                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    5224                    .dwendtag $C$DW$T$35
    5225            
    5226            $C$DW$T$69      .dwtag  DW_TAG_typedef
    5227                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    5228                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    5229                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    5230                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5231                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    5232                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    5233            
    5234            
    5235            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5236                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    5237                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    5238            $C$DW$253       .dwtag  DW_TAG_member
    5239                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    5240                    .dwattr $C$DW$253, DW_AT_name("compareRegister")
    5241                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("compareRegister")
    5242                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5243                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5244                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5245                    .dwattr $C$DW$253, DW_AT_decl_line(0x146)
    5246                    .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    5247            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  103

    5248            $C$DW$254       .dwtag  DW_TAG_member
    5249                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    5250                    .dwattr $C$DW$254, DW_AT_name("compareInterruptEnable")
    5251                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("compareInterruptEnable")
    5252                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5253                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5254                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5255                    .dwattr $C$DW$254, DW_AT_decl_line(0x14b)
    5256                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    5257            
    5258            $C$DW$255       .dwtag  DW_TAG_member
    5259                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    5260                    .dwattr $C$DW$255, DW_AT_name("compareOutputMode")
    5261                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("compareOutputMode")
    5262                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5263                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5264                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5265                    .dwattr $C$DW$255, DW_AT_decl_line(0x156)
    5266                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    5267            
    5268            $C$DW$256       .dwtag  DW_TAG_member
    5269                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    5270                    .dwattr $C$DW$256, DW_AT_name("compareValue")
    5271                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("compareValue")
    5272                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5273                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5274                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5275                    .dwattr $C$DW$256, DW_AT_decl_line(0x158)
    5276                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    5277            
    5278                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5279                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    5280                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    5281                    .dwendtag $C$DW$T$36
    5282            
    5283            $C$DW$T$70      .dwtag  DW_TAG_typedef
    5284                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    5285                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    5286                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    5287                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5288                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    5289                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    5290            
    5291            
    5292            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5293                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    5294                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    5295            $C$DW$257       .dwtag  DW_TAG_member
    5296                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    5297                    .dwattr $C$DW$257, DW_AT_name("clockSource")
    5298                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("clockSource")
    5299                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5300                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5301                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5302                    .dwattr $C$DW$257, DW_AT_decl_line(0xd3)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  104

    5303                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    5304            
    5305            $C$DW$258       .dwtag  DW_TAG_member
    5306                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    5307                    .dwattr $C$DW$258, DW_AT_name("clockSourceDivider")
    5308                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("clockSourceDivider")
    5309                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5310                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5311                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5312                    .dwattr $C$DW$258, DW_AT_decl_line(0xea)
    5313                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    5314            
    5315            $C$DW$259       .dwtag  DW_TAG_member
    5316                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    5317                    .dwattr $C$DW$259, DW_AT_name("timerInterruptEnable_TBIE")
    5318                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5319                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5320                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5321                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5322                    .dwattr $C$DW$259, DW_AT_decl_line(0xef)
    5323                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    5324            
    5325            $C$DW$260       .dwtag  DW_TAG_member
    5326                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    5327                    .dwattr $C$DW$260, DW_AT_name("timerClear")
    5328                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("timerClear")
    5329                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5330                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5331                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5332                    .dwattr $C$DW$260, DW_AT_decl_line(0xf5)
    5333                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    5334            
    5335            $C$DW$261       .dwtag  DW_TAG_member
    5336                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$30)
    5337                    .dwattr $C$DW$261, DW_AT_name("startTimer")
    5338                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("startTimer")
    5339                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5340                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5341                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5342                    .dwattr $C$DW$261, DW_AT_decl_line(0xf7)
    5343                    .dwattr $C$DW$261, DW_AT_decl_column(0x0a)
    5344            
    5345                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5346                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    5347                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5348                    .dwendtag $C$DW$T$37
    5349            
    5350            $C$DW$T$71      .dwtag  DW_TAG_typedef
    5351                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    5352                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    5353                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    5354                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5355                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    5356                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    5357            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  105

    5358            
    5359            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5360                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    5361                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    5362            $C$DW$262       .dwtag  DW_TAG_member
    5363                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    5364                    .dwattr $C$DW$262, DW_AT_name("clockSource")
    5365                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("clockSource")
    5366                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5367                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5368                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5369                    .dwattr $C$DW$262, DW_AT_decl_line(0x107)
    5370                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    5371            
    5372            $C$DW$263       .dwtag  DW_TAG_member
    5373                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    5374                    .dwattr $C$DW$263, DW_AT_name("clockSourceDivider")
    5375                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("clockSourceDivider")
    5376                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5377                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5378                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5379                    .dwattr $C$DW$263, DW_AT_decl_line(0x11e)
    5380                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    5381            
    5382            $C$DW$264       .dwtag  DW_TAG_member
    5383                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    5384                    .dwattr $C$DW$264, DW_AT_name("timerPeriod")
    5385                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("timerPeriod")
    5386                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5387                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5388                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5389                    .dwattr $C$DW$264, DW_AT_decl_line(0x120)
    5390                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    5391            
    5392            $C$DW$265       .dwtag  DW_TAG_member
    5393                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    5394                    .dwattr $C$DW$265, DW_AT_name("timerInterruptEnable_TBIE")
    5395                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5396                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5397                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5398                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5399                    .dwattr $C$DW$265, DW_AT_decl_line(0x125)
    5400                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    5401            
    5402            $C$DW$266       .dwtag  DW_TAG_member
    5403                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    5404                    .dwattr $C$DW$266, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5405                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5406                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5407                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5408                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5409                    .dwattr $C$DW$266, DW_AT_decl_line(0x12a)
    5410                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    5411            
    5412            $C$DW$267       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  106

    5413                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    5414                    .dwattr $C$DW$267, DW_AT_name("timerClear")
    5415                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("timerClear")
    5416                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5417                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5418                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5419                    .dwattr $C$DW$267, DW_AT_decl_line(0x130)
    5420                    .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    5421            
    5422            $C$DW$268       .dwtag  DW_TAG_member
    5423                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$30)
    5424                    .dwattr $C$DW$268, DW_AT_name("startTimer")
    5425                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("startTimer")
    5426                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5427                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5428                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5429                    .dwattr $C$DW$268, DW_AT_decl_line(0x132)
    5430                    .dwattr $C$DW$268, DW_AT_decl_column(0x0a)
    5431            
    5432                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5433                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    5434                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    5435                    .dwendtag $C$DW$T$38
    5436            
    5437            $C$DW$T$72      .dwtag  DW_TAG_typedef
    5438                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    5439                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    5440                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    5441                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5442                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    5443                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    5444            
    5445            
    5446            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5447                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    5448                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    5449            $C$DW$269       .dwtag  DW_TAG_member
    5450                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    5451                    .dwattr $C$DW$269, DW_AT_name("clockSource")
    5452                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("clockSource")
    5453                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5454                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5455                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5456                    .dwattr $C$DW$269, DW_AT_decl_line(0x60)
    5457                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    5458            
    5459            $C$DW$270       .dwtag  DW_TAG_member
    5460                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    5461                    .dwattr $C$DW$270, DW_AT_name("clockSourceDivider")
    5462                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("clockSourceDivider")
    5463                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5464                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5465                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5466                    .dwattr $C$DW$270, DW_AT_decl_line(0x77)
    5467                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  107

    5468            
    5469            $C$DW$271       .dwtag  DW_TAG_member
    5470                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    5471                    .dwattr $C$DW$271, DW_AT_name("timerPeriod")
    5472                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("timerPeriod")
    5473                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5474                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5475                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5476                    .dwattr $C$DW$271, DW_AT_decl_line(0x7a)
    5477                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    5478            
    5479            $C$DW$272       .dwtag  DW_TAG_member
    5480                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    5481                    .dwattr $C$DW$272, DW_AT_name("timerInterruptEnable_TBIE")
    5482                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5483                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5484                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5485                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5486                    .dwattr $C$DW$272, DW_AT_decl_line(0x7f)
    5487                    .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
    5488            
    5489            $C$DW$273       .dwtag  DW_TAG_member
    5490                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    5491                    .dwattr $C$DW$273, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5492                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5493                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5494                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5495                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5496                    .dwattr $C$DW$273, DW_AT_decl_line(0x84)
    5497                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    5498            
    5499            $C$DW$274       .dwtag  DW_TAG_member
    5500                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    5501                    .dwattr $C$DW$274, DW_AT_name("timerClear")
    5502                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("timerClear")
    5503                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5504                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5505                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5506                    .dwattr $C$DW$274, DW_AT_decl_line(0x8a)
    5507                    .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    5508            
    5509            $C$DW$275       .dwtag  DW_TAG_member
    5510                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$30)
    5511                    .dwattr $C$DW$275, DW_AT_name("startTimer")
    5512                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("startTimer")
    5513                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5514                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5515                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5516                    .dwattr $C$DW$275, DW_AT_decl_line(0x8c)
    5517                    .dwattr $C$DW$275, DW_AT_decl_column(0x0a)
    5518            
    5519                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5520                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    5521                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    5522                    .dwendtag $C$DW$T$39
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  108

    5523            
    5524            $C$DW$T$73      .dwtag  DW_TAG_typedef
    5525                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    5526                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    5527                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5528                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5529                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    5530                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    5531            
    5532            
    5533            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5534                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    5535                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    5536            $C$DW$276       .dwtag  DW_TAG_member
    5537                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    5538                    .dwattr $C$DW$276, DW_AT_name("clockSource")
    5539                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("clockSource")
    5540                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5541                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5542                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5543                    .dwattr $C$DW$276, DW_AT_decl_line(0x20)
    5544                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    5545            
    5546            $C$DW$277       .dwtag  DW_TAG_member
    5547                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    5548                    .dwattr $C$DW$277, DW_AT_name("clockSourceDivider")
    5549                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("clockSourceDivider")
    5550                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5551                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5552                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5553                    .dwattr $C$DW$277, DW_AT_decl_line(0x37)
    5554                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    5555            
    5556            $C$DW$278       .dwtag  DW_TAG_member
    5557                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    5558                    .dwattr $C$DW$278, DW_AT_name("timerPeriod")
    5559                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("timerPeriod")
    5560                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5561                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5562                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5563                    .dwattr $C$DW$278, DW_AT_decl_line(0x39)
    5564                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    5565            
    5566            $C$DW$279       .dwtag  DW_TAG_member
    5567                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    5568                    .dwattr $C$DW$279, DW_AT_name("compareRegister")
    5569                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("compareRegister")
    5570                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5571                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5572                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5573                    .dwattr $C$DW$279, DW_AT_decl_line(0x44)
    5574                    .dwattr $C$DW$279, DW_AT_decl_column(0x0e)
    5575            
    5576            $C$DW$280       .dwtag  DW_TAG_member
    5577                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  109

    5578                    .dwattr $C$DW$280, DW_AT_name("compareOutputMode")
    5579                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("compareOutputMode")
    5580                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5581                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5582                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5583                    .dwattr $C$DW$280, DW_AT_decl_line(0x4f)
    5584                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    5585            
    5586            $C$DW$281       .dwtag  DW_TAG_member
    5587                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    5588                    .dwattr $C$DW$281, DW_AT_name("dutyCycle")
    5589                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("dutyCycle")
    5590                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5591                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5592                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5593                    .dwattr $C$DW$281, DW_AT_decl_line(0x51)
    5594                    .dwattr $C$DW$281, DW_AT_decl_column(0x0e)
    5595            
    5596                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5597                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    5598                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    5599                    .dwendtag $C$DW$T$40
    5600            
    5601            $C$DW$T$74      .dwtag  DW_TAG_typedef
    5602                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    5603                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    5604                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5605                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5606                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    5607                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    5608            
    5609            
    5610            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5611                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    5612                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    5613            $C$DW$282       .dwtag  DW_TAG_member
    5614                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$24)
    5615                    .dwattr $C$DW$282, DW_AT_name("selectClockSource")
    5616                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("selectClockSource")
    5617                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5618                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5619                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5620                    .dwattr $C$DW$282, DW_AT_decl_line(0x1c)
    5621                    .dwattr $C$DW$282, DW_AT_decl_column(0x0d)
    5622            
    5623            $C$DW$283       .dwtag  DW_TAG_member
    5624                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    5625                    .dwattr $C$DW$283, DW_AT_name("clockPrescalar")
    5626                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("clockPrescalar")
    5627                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5628                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5629                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5630                    .dwattr $C$DW$283, DW_AT_decl_line(0x1e)
    5631                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    5632            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  110

    5633            $C$DW$284       .dwtag  DW_TAG_member
    5634                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$24)
    5635                    .dwattr $C$DW$284, DW_AT_name("firstModReg")
    5636                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("firstModReg")
    5637                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5638                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5639                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5640                    .dwattr $C$DW$284, DW_AT_decl_line(0x22)
    5641                    .dwattr $C$DW$284, DW_AT_decl_column(0x0d)
    5642            
    5643            $C$DW$285       .dwtag  DW_TAG_member
    5644                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$24)
    5645                    .dwattr $C$DW$285, DW_AT_name("secondModReg")
    5646                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("secondModReg")
    5647                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5648                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5649                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5650                    .dwattr $C$DW$285, DW_AT_decl_line(0x26)
    5651                    .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    5652            
    5653            $C$DW$286       .dwtag  DW_TAG_member
    5654                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$24)
    5655                    .dwattr $C$DW$286, DW_AT_name("parity")
    5656                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("parity")
    5657                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5658                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5659                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5660                    .dwattr $C$DW$286, DW_AT_decl_line(0x2c)
    5661                    .dwattr $C$DW$286, DW_AT_decl_column(0x0d)
    5662            
    5663            $C$DW$287       .dwtag  DW_TAG_member
    5664                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$24)
    5665                    .dwattr $C$DW$287, DW_AT_name("msborLsbFirst")
    5666                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("msborLsbFirst")
    5667                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5668                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5669                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5670                    .dwattr $C$DW$287, DW_AT_decl_line(0x31)
    5671                    .dwattr $C$DW$287, DW_AT_decl_column(0x0d)
    5672            
    5673            $C$DW$288       .dwtag  DW_TAG_member
    5674                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$24)
    5675                    .dwattr $C$DW$288, DW_AT_name("numberofStopBits")
    5676                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("numberofStopBits")
    5677                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5678                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5679                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5680                    .dwattr $C$DW$288, DW_AT_decl_line(0x36)
    5681                    .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    5682            
    5683            $C$DW$289       .dwtag  DW_TAG_member
    5684                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$24)
    5685                    .dwattr $C$DW$289, DW_AT_name("uartMode")
    5686                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("uartMode")
    5687                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  111

    5688                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5689                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5690                    .dwattr $C$DW$289, DW_AT_decl_line(0x3d)
    5691                    .dwattr $C$DW$289, DW_AT_decl_column(0x0d)
    5692            
    5693            $C$DW$290       .dwtag  DW_TAG_member
    5694                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$24)
    5695                    .dwattr $C$DW$290, DW_AT_name("overSampling")
    5696                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("overSampling")
    5697                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5698                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5699                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5700                    .dwattr $C$DW$290, DW_AT_decl_line(0x42)
    5701                    .dwattr $C$DW$290, DW_AT_decl_column(0x0d)
    5702            
    5703                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5704                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    5705                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5706                    .dwendtag $C$DW$T$41
    5707            
    5708            $C$DW$T$75      .dwtag  DW_TAG_typedef
    5709                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    5710                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    5711                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5712                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5713                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    5714                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    5715            
    5716            
    5717            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5718                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5719                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    5720            $C$DW$291       .dwtag  DW_TAG_member
    5721                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$43)
    5722                    .dwattr $C$DW$291, DW_AT_name("clockSourceFrequency")
    5723                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("clockSourceFrequency")
    5724                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5725                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5726                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5727                    .dwattr $C$DW$291, DW_AT_decl_line(0x31)
    5728                    .dwattr $C$DW$291, DW_AT_decl_column(0x0e)
    5729            
    5730            $C$DW$292       .dwtag  DW_TAG_member
    5731                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$43)
    5732                    .dwattr $C$DW$292, DW_AT_name("desiredSpiClock")
    5733                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("desiredSpiClock")
    5734                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5735                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5736                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5737                    .dwattr $C$DW$292, DW_AT_decl_line(0x33)
    5738                    .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    5739            
    5740                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5741                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    5742                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
ISR.asm                                                              PAGE  112

    5743                    .dwendtag $C$DW$T$44
    5744            
    5745            $C$DW$T$76      .dwtag  DW_TAG_typedef
    5746                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5747                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    5748                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5749                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5750                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    5751                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    5752            
    5753            
    5754            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5755                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    5756                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    5757            $C$DW$293       .dwtag  DW_TAG_member
    5758                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$24)
    5759                    .dwattr $C$DW$293, DW_AT_name("selectClockSource")
    5760                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("selectClockSource")
    5761                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5762                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5763                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5764                    .dwattr $C$DW$293, DW_AT_decl_line(0x14)
    5765                    .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    5766            
    5767            $C$DW$294       .dwtag  DW_TAG_member
    5768                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$43)
    5769                    .dwattr $C$DW$294, DW_AT_name("clockSourceFrequency")
    5770                    .dwattr $C$DW$294, DW_AT_TI_symbol_name("clockSourceFrequency")
    5771                    .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5772                    .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5773                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5774                    .dwattr $C$DW$294, DW_AT_decl_line(0x16)
    5775                    .dwattr $C$DW$294, DW_AT_decl_column(0x0e)
    5776            
    5777            $C$DW$295       .dwtag  DW_TAG_member
    5778                    .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$43)
    5779                    .dwattr $C$DW$295, DW_AT_name("desiredSpiClock")
    5780                    .dwattr $C$DW$295, DW_AT_TI_symbol_name("desiredSpiClock")
    5781                    .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5782                    .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5783                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5784                    .dwattr $C$DW$295, DW_AT_decl_line(0x18)
    5785                    .dwattr $C$DW$295, DW_AT_decl_column(0x0e)
    5786            
    5787            $C$DW$296       .dwtag  DW_TAG_member
    5788                    .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$24)
    5789                    .dwattr $C$DW$296, DW_AT_name("msbFirst")
    5790                    .dwattr $C$DW$296, DW_AT_TI_symbol_name("msbFirst")
    5791                    .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5792                    .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5793                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5794                    .dwattr $C$DW$296, DW_AT_decl_line(0x1d)
    5795                    .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    5796            
    5797            $C$DW$297       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:10:54 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
