MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:00 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Limits.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("TA0CCR3")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("TA0CCR3")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$111)

    2770            $C$DW$129       .dwtag  DW_TAG_enumerator
    2771                    .dwattr $C$DW$129, DW_AT_name("crc2")
    2772                    .dwattr $C$DW$129, DW_AT_const_value(0x06)
    2773                    .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2774                    .dwattr $C$DW$129, DW_AT_decl_line(0x76)
    2775                    .dwattr $C$DW$129, DW_AT_decl_column(0x05)
    2776            
    2777            $C$DW$130       .dwtag  DW_TAG_enumerator
    2778                    .dwattr $C$DW$130, DW_AT_name("ack")
    2779                    .dwattr $C$DW$130, DW_AT_const_value(0x07)
    2780                    .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2781                    .dwattr $C$DW$130, DW_AT_decl_line(0x77)
    2782                    .dwattr $C$DW$130, DW_AT_decl_column(0x05)
    2783            
    2784            $C$DW$131       .dwtag  DW_TAG_enumerator
    2785                    .dwattr $C$DW$131, DW_AT_name("var")
    2786                    .dwattr $C$DW$131, DW_AT_const_value(0x08)
    2787                    .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2788                    .dwattr $C$DW$131, DW_AT_decl_line(0x78)
    2789                    .dwattr $C$DW$131, DW_AT_decl_column(0x05)
    2790            
    2791            $C$DW$132       .dwtag  DW_TAG_enumerator
    2792                    .dwattr $C$DW$132, DW_AT_name("UGmsg")
    2793                    .dwattr $C$DW$132, DW_AT_const_value(0x09)
    2794                    .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2795                    .dwattr $C$DW$132, DW_AT_decl_line(0x79)
    2796                    .dwattr $C$DW$132, DW_AT_decl_column(0x05)
    2797            
    2798                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2799                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2800                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2801                    .dwendtag $C$DW$T$57
    2802            
    2803            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2804                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2805                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2806                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2807                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2808                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   56

    2809                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2810            
    2811            
    2812            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2813                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2814            $C$DW$133       .dwtag  DW_TAG_enumerator
    2815                    .dwattr $C$DW$133, DW_AT_name("init")
    2816                    .dwattr $C$DW$133, DW_AT_const_value(0x00)
    2817                    .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2818                    .dwattr $C$DW$133, DW_AT_decl_line(0x80)
    2819                    .dwattr $C$DW$133, DW_AT_decl_column(0x05)
    2820            
    2821            $C$DW$134       .dwtag  DW_TAG_enumerator
    2822                    .dwattr $C$DW$134, DW_AT_name("running")
    2823                    .dwattr $C$DW$134, DW_AT_const_value(0x01)
    2824                    .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2825                    .dwattr $C$DW$134, DW_AT_decl_line(0x80)
    2826                    .dwattr $C$DW$134, DW_AT_decl_column(0x0b)
    2827            
    2828            $C$DW$135       .dwtag  DW_TAG_enumerator
    2829                    .dwattr $C$DW$135, DW_AT_name("wait")
    2830                    .dwattr $C$DW$135, DW_AT_const_value(0x02)
    2831                    .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2832                    .dwattr $C$DW$135, DW_AT_decl_line(0x80)
    2833                    .dwattr $C$DW$135, DW_AT_decl_column(0x14)
    2834            
    2835                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2836                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2837                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    2838                    .dwendtag $C$DW$T$59
    2839            
    2840            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2841                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2842                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2843                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2844                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2845                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2846                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2847            
    2848            
    2849            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2850                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2851            $C$DW$136       .dwtag  DW_TAG_member
    2852                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$14)
    2853                    .dwattr $C$DW$136, DW_AT_name("__max_align1")
    2854                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("__max_align1")
    2855                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2857                    .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2858                    .dwattr $C$DW$136, DW_AT_decl_line(0x7b)
    2859                    .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    2860            
    2861            $C$DW$137       .dwtag  DW_TAG_member
    2862                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$18)
    2863                    .dwattr $C$DW$137, DW_AT_name("__max_align2")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   57

    2864                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("__max_align2")
    2865                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2866                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2867                    .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2868                    .dwattr $C$DW$137, DW_AT_decl_line(0x7c)
    2869                    .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2870            
    2871                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2872                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    2873                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2874                    .dwendtag $C$DW$T$22
    2875            
    2876            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2877                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    2878                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    2879                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2880                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2881                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    2882                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2883            
    2884            
    2885            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2886                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    2887                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    2888            $C$DW$138       .dwtag  DW_TAG_member
    2889                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$24)
    2890                    .dwattr $C$DW$138, DW_AT_name("memoryBufferControlIndex")
    2891                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    2892                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2894                    .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2895                    .dwattr $C$DW$138, DW_AT_decl_line(0x27)
    2896                    .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2897            
    2898            $C$DW$139       .dwtag  DW_TAG_member
    2899                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$24)
    2900                    .dwattr $C$DW$139, DW_AT_name("inputSourceSelect")
    2901                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("inputSourceSelect")
    2902                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2903                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2904                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2905                    .dwattr $C$DW$139, DW_AT_decl_line(0x3b)
    2906                    .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2907            
    2908            $C$DW$140       .dwtag  DW_TAG_member
    2909                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$24)
    2910                    .dwattr $C$DW$140, DW_AT_name("positiveRefVoltageSourceSelect")
    2911                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    2912                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2913                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2914                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2915                    .dwattr $C$DW$140, DW_AT_decl_line(0x42)
    2916                    .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2917            
    2918            $C$DW$141       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   58

    2919                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$24)
    2920                    .dwattr $C$DW$141, DW_AT_name("negativeRefVoltageSourceSelect")
    2921                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    2922                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2923                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2924                    .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2925                    .dwattr $C$DW$141, DW_AT_decl_line(0x48)
    2926                    .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    2927            
    2928            $C$DW$142       .dwtag  DW_TAG_member
    2929                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$24)
    2930                    .dwattr $C$DW$142, DW_AT_name("endOfSequence")
    2931                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("endOfSequence")
    2932                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2933                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2934                    .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2935                    .dwattr $C$DW$142, DW_AT_decl_line(0x51)
    2936                    .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    2937            
    2938                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2939                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    2940                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2941                    .dwendtag $C$DW$T$25
    2942            
    2943            $C$DW$T$62      .dwtag  DW_TAG_typedef
    2944                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    2945                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    2946                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2947                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2948                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    2949                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2950            
    2951            
    2952            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2953                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    2954                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2955            $C$DW$143       .dwtag  DW_TAG_member
    2956                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    2957                    .dwattr $C$DW$143, DW_AT_name("captureRegister")
    2958                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("captureRegister")
    2959                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2960                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2961                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2962                    .dwattr $C$DW$143, DW_AT_decl_line(0x58)
    2963                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2964            
    2965            $C$DW$144       .dwtag  DW_TAG_member
    2966                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2967                    .dwattr $C$DW$144, DW_AT_name("captureMode")
    2968                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("captureMode")
    2969                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2970                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2971                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2972                    .dwattr $C$DW$144, DW_AT_decl_line(0x5f)
    2973                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   59

    2974            
    2975            $C$DW$145       .dwtag  DW_TAG_member
    2976                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2977                    .dwattr $C$DW$145, DW_AT_name("captureInputSelect")
    2978                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("captureInputSelect")
    2979                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2980                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2981                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2982                    .dwattr $C$DW$145, DW_AT_decl_line(0x66)
    2983                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2984            
    2985            $C$DW$146       .dwtag  DW_TAG_member
    2986                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2987                    .dwattr $C$DW$146, DW_AT_name("synchronizeCaptureSource")
    2988                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2989                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2990                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2991                    .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2992                    .dwattr $C$DW$146, DW_AT_decl_line(0x6b)
    2993                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2994            
    2995            $C$DW$147       .dwtag  DW_TAG_member
    2996                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2997                    .dwattr $C$DW$147, DW_AT_name("captureInterruptEnable")
    2998                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("captureInterruptEnable")
    2999                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3000                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3001                    .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3002                    .dwattr $C$DW$147, DW_AT_decl_line(0x70)
    3003                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    3004            
    3005            $C$DW$148       .dwtag  DW_TAG_member
    3006                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    3007                    .dwattr $C$DW$148, DW_AT_name("captureOutputMode")
    3008                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("captureOutputMode")
    3009                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3010                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3011                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3012                    .dwattr $C$DW$148, DW_AT_decl_line(0x7b)
    3013                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    3014            
    3015                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3016                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3017                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3018                    .dwendtag $C$DW$T$28
    3019            
    3020            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3021                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3022                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3023                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3024                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3025                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3026                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3027            
    3028            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   60

    3029            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3030                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3031                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3032            $C$DW$149       .dwtag  DW_TAG_member
    3033                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    3034                    .dwattr $C$DW$149, DW_AT_name("compareRegister")
    3035                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("compareRegister")
    3036                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3037                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3038                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3039                    .dwattr $C$DW$149, DW_AT_decl_line(0x145)
    3040                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    3041            
    3042            $C$DW$150       .dwtag  DW_TAG_member
    3043                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    3044                    .dwattr $C$DW$150, DW_AT_name("compareInterruptEnable")
    3045                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("compareInterruptEnable")
    3046                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3047                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3048                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3049                    .dwattr $C$DW$150, DW_AT_decl_line(0x14a)
    3050                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    3051            
    3052            $C$DW$151       .dwtag  DW_TAG_member
    3053                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    3054                    .dwattr $C$DW$151, DW_AT_name("compareOutputMode")
    3055                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("compareOutputMode")
    3056                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3057                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3058                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3059                    .dwattr $C$DW$151, DW_AT_decl_line(0x155)
    3060                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    3061            
    3062            $C$DW$152       .dwtag  DW_TAG_member
    3063                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    3064                    .dwattr $C$DW$152, DW_AT_name("compareValue")
    3065                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("compareValue")
    3066                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3067                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3068                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3069                    .dwattr $C$DW$152, DW_AT_decl_line(0x157)
    3070                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    3071            
    3072                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3073                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3074                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3075                    .dwendtag $C$DW$T$29
    3076            
    3077            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3078                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3079                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3080                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3081                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3082                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3083                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   61

    3084            
    3085            
    3086            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3087                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3088                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3089            $C$DW$153       .dwtag  DW_TAG_member
    3090                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    3091                    .dwattr $C$DW$153, DW_AT_name("clockSource")
    3092                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("clockSource")
    3093                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3094                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3095                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3096                    .dwattr $C$DW$153, DW_AT_decl_line(0x20)
    3097                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    3098            
    3099            $C$DW$154       .dwtag  DW_TAG_member
    3100                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    3101                    .dwattr $C$DW$154, DW_AT_name("clockSourceDivider")
    3102                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("clockSourceDivider")
    3103                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3104                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3105                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3106                    .dwattr $C$DW$154, DW_AT_decl_line(0x37)
    3107                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    3108            
    3109            $C$DW$155       .dwtag  DW_TAG_member
    3110                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    3111                    .dwattr $C$DW$155, DW_AT_name("timerInterruptEnable_TAIE")
    3112                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3113                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3114                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3115                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3116                    .dwattr $C$DW$155, DW_AT_decl_line(0x3c)
    3117                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    3118            
    3119            $C$DW$156       .dwtag  DW_TAG_member
    3120                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    3121                    .dwattr $C$DW$156, DW_AT_name("timerClear")
    3122                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("timerClear")
    3123                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3124                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3125                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3126                    .dwattr $C$DW$156, DW_AT_decl_line(0x42)
    3127                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    3128            
    3129            $C$DW$157       .dwtag  DW_TAG_member
    3130                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$30)
    3131                    .dwattr $C$DW$157, DW_AT_name("startTimer")
    3132                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("startTimer")
    3133                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3134                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3135                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3136                    .dwattr $C$DW$157, DW_AT_decl_line(0x44)
    3137                    .dwattr $C$DW$157, DW_AT_decl_column(0x0a)
    3138            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   62

    3139                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3140                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3141                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3142                    .dwendtag $C$DW$T$31
    3143            
    3144            $C$DW$T$65      .dwtag  DW_TAG_typedef
    3145                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3146                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    3147                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3148                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3149                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3150                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3151            
    3152            
    3153            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3154                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3155                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3156            $C$DW$158       .dwtag  DW_TAG_member
    3157                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    3158                    .dwattr $C$DW$158, DW_AT_name("clockSource")
    3159                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSource")
    3160                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3161                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3162                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3163                    .dwattr $C$DW$158, DW_AT_decl_line(0x8b)
    3164                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    3165            
    3166            $C$DW$159       .dwtag  DW_TAG_member
    3167                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    3168                    .dwattr $C$DW$159, DW_AT_name("clockSourceDivider")
    3169                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("clockSourceDivider")
    3170                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3171                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3172                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3173                    .dwattr $C$DW$159, DW_AT_decl_line(0xa2)
    3174                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    3175            
    3176            $C$DW$160       .dwtag  DW_TAG_member
    3177                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    3178                    .dwattr $C$DW$160, DW_AT_name("timerPeriod")
    3179                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerPeriod")
    3180                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3181                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3182                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3183                    .dwattr $C$DW$160, DW_AT_decl_line(0xa4)
    3184                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    3185            
    3186            $C$DW$161       .dwtag  DW_TAG_member
    3187                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3188                    .dwattr $C$DW$161, DW_AT_name("timerInterruptEnable_TAIE")
    3189                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3190                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3191                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3192                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3193                    .dwattr $C$DW$161, DW_AT_decl_line(0xa9)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   63

    3194                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3195            
    3196            $C$DW$162       .dwtag  DW_TAG_member
    3197                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    3198                    .dwattr $C$DW$162, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3199                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3200                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3201                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3202                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3203                    .dwattr $C$DW$162, DW_AT_decl_line(0xae)
    3204                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3205            
    3206            $C$DW$163       .dwtag  DW_TAG_member
    3207                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3208                    .dwattr $C$DW$163, DW_AT_name("timerClear")
    3209                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("timerClear")
    3210                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3211                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3212                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3213                    .dwattr $C$DW$163, DW_AT_decl_line(0xb4)
    3214                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3215            
    3216            $C$DW$164       .dwtag  DW_TAG_member
    3217                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$30)
    3218                    .dwattr $C$DW$164, DW_AT_name("startTimer")
    3219                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("startTimer")
    3220                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3221                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3222                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3223                    .dwattr $C$DW$164, DW_AT_decl_line(0xb6)
    3224                    .dwattr $C$DW$164, DW_AT_decl_column(0x0a)
    3225            
    3226                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3227                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3228                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3229                    .dwendtag $C$DW$T$32
    3230            
    3231            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3232                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3233                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3234                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3235                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3236                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3237                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3238            
    3239            
    3240            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3241                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3242                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3243            $C$DW$165       .dwtag  DW_TAG_member
    3244                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3245                    .dwattr $C$DW$165, DW_AT_name("clockSource")
    3246                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("clockSource")
    3247                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3248                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   64

    3249                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3250                    .dwattr $C$DW$165, DW_AT_decl_line(0x105)
    3251                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3252            
    3253            $C$DW$166       .dwtag  DW_TAG_member
    3254                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3255                    .dwattr $C$DW$166, DW_AT_name("clockSourceDivider")
    3256                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockSourceDivider")
    3257                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3258                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3259                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3260                    .dwattr $C$DW$166, DW_AT_decl_line(0x11c)
    3261                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3262            
    3263            $C$DW$167       .dwtag  DW_TAG_member
    3264                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3265                    .dwattr $C$DW$167, DW_AT_name("timerPeriod")
    3266                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("timerPeriod")
    3267                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3268                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3269                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3270                    .dwattr $C$DW$167, DW_AT_decl_line(0x11f)
    3271                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3272            
    3273            $C$DW$168       .dwtag  DW_TAG_member
    3274                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3275                    .dwattr $C$DW$168, DW_AT_name("timerInterruptEnable_TAIE")
    3276                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3277                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3278                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3279                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3280                    .dwattr $C$DW$168, DW_AT_decl_line(0x124)
    3281                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3282            
    3283            $C$DW$169       .dwtag  DW_TAG_member
    3284                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3285                    .dwattr $C$DW$169, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3286                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3287                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3288                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3289                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3290                    .dwattr $C$DW$169, DW_AT_decl_line(0x129)
    3291                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3292            
    3293            $C$DW$170       .dwtag  DW_TAG_member
    3294                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3295                    .dwattr $C$DW$170, DW_AT_name("timerClear")
    3296                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("timerClear")
    3297                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3298                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3299                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3300                    .dwattr $C$DW$170, DW_AT_decl_line(0x12f)
    3301                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3302            
    3303            $C$DW$171       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   65

    3304                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$30)
    3305                    .dwattr $C$DW$171, DW_AT_name("startTimer")
    3306                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("startTimer")
    3307                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3308                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3309                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3310                    .dwattr $C$DW$171, DW_AT_decl_line(0x131)
    3311                    .dwattr $C$DW$171, DW_AT_decl_column(0x0a)
    3312            
    3313                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3314                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3315                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3316                    .dwendtag $C$DW$T$33
    3317            
    3318            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3319                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3320                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3321                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3322                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3323                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3324                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3325            
    3326            
    3327            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3328                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3329                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3330            $C$DW$172       .dwtag  DW_TAG_member
    3331                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3332                    .dwattr $C$DW$172, DW_AT_name("clockSource")
    3333                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("clockSource")
    3334                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3335                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3336                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3337                    .dwattr $C$DW$172, DW_AT_decl_line(0xc5)
    3338                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3339            
    3340            $C$DW$173       .dwtag  DW_TAG_member
    3341                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3342                    .dwattr $C$DW$173, DW_AT_name("clockSourceDivider")
    3343                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("clockSourceDivider")
    3344                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3345                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3346                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3347                    .dwattr $C$DW$173, DW_AT_decl_line(0xdc)
    3348                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3349            
    3350            $C$DW$174       .dwtag  DW_TAG_member
    3351                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3352                    .dwattr $C$DW$174, DW_AT_name("timerPeriod")
    3353                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("timerPeriod")
    3354                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3355                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3356                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3357                    .dwattr $C$DW$174, DW_AT_decl_line(0xde)
    3358                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   66

    3359            
    3360            $C$DW$175       .dwtag  DW_TAG_member
    3361                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3362                    .dwattr $C$DW$175, DW_AT_name("compareRegister")
    3363                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("compareRegister")
    3364                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3365                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3366                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3367                    .dwattr $C$DW$175, DW_AT_decl_line(0xe9)
    3368                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3369            
    3370            $C$DW$176       .dwtag  DW_TAG_member
    3371                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    3372                    .dwattr $C$DW$176, DW_AT_name("compareOutputMode")
    3373                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("compareOutputMode")
    3374                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3375                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3376                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3377                    .dwattr $C$DW$176, DW_AT_decl_line(0xf4)
    3378                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    3379            
    3380            $C$DW$177       .dwtag  DW_TAG_member
    3381                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3382                    .dwattr $C$DW$177, DW_AT_name("dutyCycle")
    3383                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("dutyCycle")
    3384                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3385                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3386                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3387                    .dwattr $C$DW$177, DW_AT_decl_line(0xf6)
    3388                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3389            
    3390                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3391                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3392                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3393                    .dwendtag $C$DW$T$34
    3394            
    3395            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3396                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3397                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3398                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3399                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3400                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3401                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3402            
    3403            
    3404            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3405                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3406                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3407            $C$DW$178       .dwtag  DW_TAG_member
    3408                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3409                    .dwattr $C$DW$178, DW_AT_name("captureRegister")
    3410                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("captureRegister")
    3411                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3412                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3413                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   67

    3414                    .dwattr $C$DW$178, DW_AT_decl_line(0xa0)
    3415                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3416            
    3417            $C$DW$179       .dwtag  DW_TAG_member
    3418                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3419                    .dwattr $C$DW$179, DW_AT_name("captureMode")
    3420                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("captureMode")
    3421                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3422                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3423                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3424                    .dwattr $C$DW$179, DW_AT_decl_line(0xa7)
    3425                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3426            
    3427            $C$DW$180       .dwtag  DW_TAG_member
    3428                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3429                    .dwattr $C$DW$180, DW_AT_name("captureInputSelect")
    3430                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("captureInputSelect")
    3431                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3432                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3433                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3434                    .dwattr $C$DW$180, DW_AT_decl_line(0xae)
    3435                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3436            
    3437            $C$DW$181       .dwtag  DW_TAG_member
    3438                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    3439                    .dwattr $C$DW$181, DW_AT_name("synchronizeCaptureSource")
    3440                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3441                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3442                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3443                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3444                    .dwattr $C$DW$181, DW_AT_decl_line(0xb3)
    3445                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3446            
    3447            $C$DW$182       .dwtag  DW_TAG_member
    3448                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    3449                    .dwattr $C$DW$182, DW_AT_name("captureInterruptEnable")
    3450                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("captureInterruptEnable")
    3451                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3452                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3453                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3454                    .dwattr $C$DW$182, DW_AT_decl_line(0xb8)
    3455                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3456            
    3457            $C$DW$183       .dwtag  DW_TAG_member
    3458                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3459                    .dwattr $C$DW$183, DW_AT_name("captureOutputMode")
    3460                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("captureOutputMode")
    3461                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3462                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3463                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3464                    .dwattr $C$DW$183, DW_AT_decl_line(0xc3)
    3465                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3466            
    3467                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3468                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   68

    3469                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3470                    .dwendtag $C$DW$T$35
    3471            
    3472            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3473                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3474                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    3475                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3476                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3477                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3478                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3479            
    3480            
    3481            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3482                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3483                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3484            $C$DW$184       .dwtag  DW_TAG_member
    3485                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3486                    .dwattr $C$DW$184, DW_AT_name("compareRegister")
    3487                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("compareRegister")
    3488                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3489                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3490                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3491                    .dwattr $C$DW$184, DW_AT_decl_line(0x146)
    3492                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3493            
    3494            $C$DW$185       .dwtag  DW_TAG_member
    3495                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$27)
    3496                    .dwattr $C$DW$185, DW_AT_name("compareInterruptEnable")
    3497                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("compareInterruptEnable")
    3498                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3499                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3500                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3501                    .dwattr $C$DW$185, DW_AT_decl_line(0x14b)
    3502                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    3503            
    3504            $C$DW$186       .dwtag  DW_TAG_member
    3505                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3506                    .dwattr $C$DW$186, DW_AT_name("compareOutputMode")
    3507                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("compareOutputMode")
    3508                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3509                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3510                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3511                    .dwattr $C$DW$186, DW_AT_decl_line(0x156)
    3512                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3513            
    3514            $C$DW$187       .dwtag  DW_TAG_member
    3515                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3516                    .dwattr $C$DW$187, DW_AT_name("compareValue")
    3517                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("compareValue")
    3518                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3519                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3520                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3521                    .dwattr $C$DW$187, DW_AT_decl_line(0x158)
    3522                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3523            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   69

    3524                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3525                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3526                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3527                    .dwendtag $C$DW$T$36
    3528            
    3529            $C$DW$T$70      .dwtag  DW_TAG_typedef
    3530                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    3531                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    3532                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3533                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3534                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    3535                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3536            
    3537            
    3538            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3539                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    3540                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    3541            $C$DW$188       .dwtag  DW_TAG_member
    3542                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3543                    .dwattr $C$DW$188, DW_AT_name("clockSource")
    3544                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("clockSource")
    3545                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3546                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3547                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3548                    .dwattr $C$DW$188, DW_AT_decl_line(0xd3)
    3549                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3550            
    3551            $C$DW$189       .dwtag  DW_TAG_member
    3552                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3553                    .dwattr $C$DW$189, DW_AT_name("clockSourceDivider")
    3554                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("clockSourceDivider")
    3555                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3556                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3557                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3558                    .dwattr $C$DW$189, DW_AT_decl_line(0xea)
    3559                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3560            
    3561            $C$DW$190       .dwtag  DW_TAG_member
    3562                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3563                    .dwattr $C$DW$190, DW_AT_name("timerInterruptEnable_TBIE")
    3564                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3565                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3566                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3567                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3568                    .dwattr $C$DW$190, DW_AT_decl_line(0xef)
    3569                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3570            
    3571            $C$DW$191       .dwtag  DW_TAG_member
    3572                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3573                    .dwattr $C$DW$191, DW_AT_name("timerClear")
    3574                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("timerClear")
    3575                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3576                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3577                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3578                    .dwattr $C$DW$191, DW_AT_decl_line(0xf5)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   70

    3579                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3580            
    3581            $C$DW$192       .dwtag  DW_TAG_member
    3582                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$30)
    3583                    .dwattr $C$DW$192, DW_AT_name("startTimer")
    3584                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("startTimer")
    3585                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3586                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3587                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3588                    .dwattr $C$DW$192, DW_AT_decl_line(0xf7)
    3589                    .dwattr $C$DW$192, DW_AT_decl_column(0x0a)
    3590            
    3591                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3592                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    3593                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3594                    .dwendtag $C$DW$T$37
    3595            
    3596            $C$DW$T$71      .dwtag  DW_TAG_typedef
    3597                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    3598                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    3599                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3600                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3601                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    3602                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    3603            
    3604            
    3605            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3606                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    3607                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    3608            $C$DW$193       .dwtag  DW_TAG_member
    3609                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3610                    .dwattr $C$DW$193, DW_AT_name("clockSource")
    3611                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("clockSource")
    3612                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3613                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3614                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3615                    .dwattr $C$DW$193, DW_AT_decl_line(0x107)
    3616                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3617            
    3618            $C$DW$194       .dwtag  DW_TAG_member
    3619                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3620                    .dwattr $C$DW$194, DW_AT_name("clockSourceDivider")
    3621                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("clockSourceDivider")
    3622                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3623                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3624                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3625                    .dwattr $C$DW$194, DW_AT_decl_line(0x11e)
    3626                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3627            
    3628            $C$DW$195       .dwtag  DW_TAG_member
    3629                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3630                    .dwattr $C$DW$195, DW_AT_name("timerPeriod")
    3631                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerPeriod")
    3632                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3633                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   71

    3634                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3635                    .dwattr $C$DW$195, DW_AT_decl_line(0x120)
    3636                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3637            
    3638            $C$DW$196       .dwtag  DW_TAG_member
    3639                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3640                    .dwattr $C$DW$196, DW_AT_name("timerInterruptEnable_TBIE")
    3641                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3642                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3643                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3644                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3645                    .dwattr $C$DW$196, DW_AT_decl_line(0x125)
    3646                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3647            
    3648            $C$DW$197       .dwtag  DW_TAG_member
    3649                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3650                    .dwattr $C$DW$197, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3651                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3652                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3653                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3654                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3655                    .dwattr $C$DW$197, DW_AT_decl_line(0x12a)
    3656                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3657            
    3658            $C$DW$198       .dwtag  DW_TAG_member
    3659                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3660                    .dwattr $C$DW$198, DW_AT_name("timerClear")
    3661                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("timerClear")
    3662                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3663                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3664                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3665                    .dwattr $C$DW$198, DW_AT_decl_line(0x130)
    3666                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3667            
    3668            $C$DW$199       .dwtag  DW_TAG_member
    3669                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$30)
    3670                    .dwattr $C$DW$199, DW_AT_name("startTimer")
    3671                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("startTimer")
    3672                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3673                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3674                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3675                    .dwattr $C$DW$199, DW_AT_decl_line(0x132)
    3676                    .dwattr $C$DW$199, DW_AT_decl_column(0x0a)
    3677            
    3678                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3679                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    3680                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3681                    .dwendtag $C$DW$T$38
    3682            
    3683            $C$DW$T$72      .dwtag  DW_TAG_typedef
    3684                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    3685                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    3686                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3687                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3688                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   72

    3689                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3690            
    3691            
    3692            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3693                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    3694                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    3695            $C$DW$200       .dwtag  DW_TAG_member
    3696                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3697                    .dwattr $C$DW$200, DW_AT_name("clockSource")
    3698                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("clockSource")
    3699                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3700                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3701                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3702                    .dwattr $C$DW$200, DW_AT_decl_line(0x60)
    3703                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3704            
    3705            $C$DW$201       .dwtag  DW_TAG_member
    3706                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3707                    .dwattr $C$DW$201, DW_AT_name("clockSourceDivider")
    3708                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("clockSourceDivider")
    3709                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3710                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3711                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3712                    .dwattr $C$DW$201, DW_AT_decl_line(0x77)
    3713                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3714            
    3715            $C$DW$202       .dwtag  DW_TAG_member
    3716                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3717                    .dwattr $C$DW$202, DW_AT_name("timerPeriod")
    3718                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("timerPeriod")
    3719                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3720                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3721                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3722                    .dwattr $C$DW$202, DW_AT_decl_line(0x7a)
    3723                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3724            
    3725            $C$DW$203       .dwtag  DW_TAG_member
    3726                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3727                    .dwattr $C$DW$203, DW_AT_name("timerInterruptEnable_TBIE")
    3728                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3729                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3730                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3731                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3732                    .dwattr $C$DW$203, DW_AT_decl_line(0x7f)
    3733                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3734            
    3735            $C$DW$204       .dwtag  DW_TAG_member
    3736                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3737                    .dwattr $C$DW$204, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3738                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3739                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3740                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3741                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3742                    .dwattr $C$DW$204, DW_AT_decl_line(0x84)
    3743                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   73

    3744            
    3745            $C$DW$205       .dwtag  DW_TAG_member
    3746                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3747                    .dwattr $C$DW$205, DW_AT_name("timerClear")
    3748                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("timerClear")
    3749                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3750                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3751                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3752                    .dwattr $C$DW$205, DW_AT_decl_line(0x8a)
    3753                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3754            
    3755            $C$DW$206       .dwtag  DW_TAG_member
    3756                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$30)
    3757                    .dwattr $C$DW$206, DW_AT_name("startTimer")
    3758                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("startTimer")
    3759                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3760                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3761                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3762                    .dwattr $C$DW$206, DW_AT_decl_line(0x8c)
    3763                    .dwattr $C$DW$206, DW_AT_decl_column(0x0a)
    3764            
    3765                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3766                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    3767                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    3768                    .dwendtag $C$DW$T$39
    3769            
    3770            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3771                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3772                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    3773                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3774                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3775                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3776                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3777            
    3778            
    3779            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3780                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3781                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3782            $C$DW$207       .dwtag  DW_TAG_member
    3783                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3784                    .dwattr $C$DW$207, DW_AT_name("clockSource")
    3785                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("clockSource")
    3786                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3787                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3788                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3789                    .dwattr $C$DW$207, DW_AT_decl_line(0x20)
    3790                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3791            
    3792            $C$DW$208       .dwtag  DW_TAG_member
    3793                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3794                    .dwattr $C$DW$208, DW_AT_name("clockSourceDivider")
    3795                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("clockSourceDivider")
    3796                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3797                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3798                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   74

    3799                    .dwattr $C$DW$208, DW_AT_decl_line(0x37)
    3800                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3801            
    3802            $C$DW$209       .dwtag  DW_TAG_member
    3803                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3804                    .dwattr $C$DW$209, DW_AT_name("timerPeriod")
    3805                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("timerPeriod")
    3806                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3807                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3808                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3809                    .dwattr $C$DW$209, DW_AT_decl_line(0x39)
    3810                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3811            
    3812            $C$DW$210       .dwtag  DW_TAG_member
    3813                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3814                    .dwattr $C$DW$210, DW_AT_name("compareRegister")
    3815                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("compareRegister")
    3816                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3817                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3818                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3819                    .dwattr $C$DW$210, DW_AT_decl_line(0x44)
    3820                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3821            
    3822            $C$DW$211       .dwtag  DW_TAG_member
    3823                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3824                    .dwattr $C$DW$211, DW_AT_name("compareOutputMode")
    3825                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("compareOutputMode")
    3826                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3827                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3828                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3829                    .dwattr $C$DW$211, DW_AT_decl_line(0x4f)
    3830                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    3831            
    3832            $C$DW$212       .dwtag  DW_TAG_member
    3833                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    3834                    .dwattr $C$DW$212, DW_AT_name("dutyCycle")
    3835                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("dutyCycle")
    3836                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3837                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3838                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3839                    .dwattr $C$DW$212, DW_AT_decl_line(0x51)
    3840                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3841            
    3842                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3843                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3844                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3845                    .dwendtag $C$DW$T$40
    3846            
    3847            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3848                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3849                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3850                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3851                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3852                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3853                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   75

    3854            
    3855            
    3856            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3857                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    3858                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3859            $C$DW$213       .dwtag  DW_TAG_member
    3860                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$24)
    3861                    .dwattr $C$DW$213, DW_AT_name("selectClockSource")
    3862                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("selectClockSource")
    3863                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3864                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3865                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3866                    .dwattr $C$DW$213, DW_AT_decl_line(0x1c)
    3867                    .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    3868            
    3869            $C$DW$214       .dwtag  DW_TAG_member
    3870                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    3871                    .dwattr $C$DW$214, DW_AT_name("clockPrescalar")
    3872                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("clockPrescalar")
    3873                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3874                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3875                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3876                    .dwattr $C$DW$214, DW_AT_decl_line(0x1e)
    3877                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    3878            
    3879            $C$DW$215       .dwtag  DW_TAG_member
    3880                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$24)
    3881                    .dwattr $C$DW$215, DW_AT_name("firstModReg")
    3882                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("firstModReg")
    3883                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3884                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3885                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3886                    .dwattr $C$DW$215, DW_AT_decl_line(0x22)
    3887                    .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    3888            
    3889            $C$DW$216       .dwtag  DW_TAG_member
    3890                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$24)
    3891                    .dwattr $C$DW$216, DW_AT_name("secondModReg")
    3892                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("secondModReg")
    3893                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3894                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3895                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3896                    .dwattr $C$DW$216, DW_AT_decl_line(0x26)
    3897                    .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    3898            
    3899            $C$DW$217       .dwtag  DW_TAG_member
    3900                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$24)
    3901                    .dwattr $C$DW$217, DW_AT_name("parity")
    3902                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("parity")
    3903                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3904                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3905                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3906                    .dwattr $C$DW$217, DW_AT_decl_line(0x2c)
    3907                    .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    3908            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   76

    3909            $C$DW$218       .dwtag  DW_TAG_member
    3910                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$24)
    3911                    .dwattr $C$DW$218, DW_AT_name("msborLsbFirst")
    3912                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("msborLsbFirst")
    3913                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3914                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3915                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3916                    .dwattr $C$DW$218, DW_AT_decl_line(0x31)
    3917                    .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    3918            
    3919            $C$DW$219       .dwtag  DW_TAG_member
    3920                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$24)
    3921                    .dwattr $C$DW$219, DW_AT_name("numberofStopBits")
    3922                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("numberofStopBits")
    3923                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3924                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3925                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3926                    .dwattr $C$DW$219, DW_AT_decl_line(0x36)
    3927                    .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    3928            
    3929            $C$DW$220       .dwtag  DW_TAG_member
    3930                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    3931                    .dwattr $C$DW$220, DW_AT_name("uartMode")
    3932                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("uartMode")
    3933                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3934                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3935                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3936                    .dwattr $C$DW$220, DW_AT_decl_line(0x3d)
    3937                    .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    3938            
    3939            $C$DW$221       .dwtag  DW_TAG_member
    3940                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$24)
    3941                    .dwattr $C$DW$221, DW_AT_name("overSampling")
    3942                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("overSampling")
    3943                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3944                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3945                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3946                    .dwattr $C$DW$221, DW_AT_decl_line(0x42)
    3947                    .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    3948            
    3949                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3950                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    3951                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3952                    .dwendtag $C$DW$T$41
    3953            
    3954            $C$DW$T$75      .dwtag  DW_TAG_typedef
    3955                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    3956                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    3957                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3958                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3959                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    3960                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3961            
    3962            
    3963            $C$DW$T$44      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   77

    3964                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3965                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    3966            $C$DW$222       .dwtag  DW_TAG_member
    3967                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$43)
    3968                    .dwattr $C$DW$222, DW_AT_name("clockSourceFrequency")
    3969                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("clockSourceFrequency")
    3970                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3971                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3972                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3973                    .dwattr $C$DW$222, DW_AT_decl_line(0x31)
    3974                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    3975            
    3976            $C$DW$223       .dwtag  DW_TAG_member
    3977                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$43)
    3978                    .dwattr $C$DW$223, DW_AT_name("desiredSpiClock")
    3979                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("desiredSpiClock")
    3980                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3981                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3982                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3983                    .dwattr $C$DW$223, DW_AT_decl_line(0x33)
    3984                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    3985            
    3986                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3987                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    3988                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3989                    .dwendtag $C$DW$T$44
    3990            
    3991            $C$DW$T$76      .dwtag  DW_TAG_typedef
    3992                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3993                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    3994                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3995                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3996                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    3997                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3998            
    3999            
    4000            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4001                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4002                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4003            $C$DW$224       .dwtag  DW_TAG_member
    4004                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$24)
    4005                    .dwattr $C$DW$224, DW_AT_name("selectClockSource")
    4006                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("selectClockSource")
    4007                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4008                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4009                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4010                    .dwattr $C$DW$224, DW_AT_decl_line(0x14)
    4011                    .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    4012            
    4013            $C$DW$225       .dwtag  DW_TAG_member
    4014                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$43)
    4015                    .dwattr $C$DW$225, DW_AT_name("clockSourceFrequency")
    4016                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("clockSourceFrequency")
    4017                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4018                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:00 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Limits.asm                                                           PAGE   78

    4019                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4020                    .dwattr $C$DW$225, DW_AT_decl_line(0x16)
    4021                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    4022            
    4023            $C$DW$226       .dwtag  DW_TAG_member
    4024                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$43)
    4025                    .dwattr $C$DW$226, DW_AT_name("desiredSpiClock")
    4026                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("desiredSpiClock")
    4027                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4028                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4029                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4030                    .dwattr $C$DW$226, DW_AT_decl_line(0x18)
    4031                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    4032            
    4033            $C$DW$227       .dwtag  DW_TAG_member
    4034                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$24)
    4035                    .dwattr $C$DW$227, DW_AT_name("msbFirst")
    4036                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("msbFirst")
    4037                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4038                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4039                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4040                    .dwattr $C$DW$227, DW_AT_decl_line(0x1d)
    4041                    .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    4042            
