MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:05 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/loadfollow.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12                    .global mode
      13                    .common mode,2,2
      14            $C$DW$1 .dwtag  DW_TAG_variable
      15                    .dwattr $C$DW$1, DW_AT_name("mode")
      16                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("mode")

    5578                    .dwattr $C$DW$343, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5579                    .dwattr $C$DW$343, DW_AT_decl_line(0x76)
    5580                    .dwattr $C$DW$343, DW_AT_decl_column(0x05)
    5581            
    5582            $C$DW$344       .dwtag  DW_TAG_enumerator
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  120

    5583                    .dwattr $C$DW$344, DW_AT_name("ack")
    5584                    .dwattr $C$DW$344, DW_AT_const_value(0x07)
    5585                    .dwattr $C$DW$344, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5586                    .dwattr $C$DW$344, DW_AT_decl_line(0x77)
    5587                    .dwattr $C$DW$344, DW_AT_decl_column(0x05)
    5588            
    5589            $C$DW$345       .dwtag  DW_TAG_enumerator
    5590                    .dwattr $C$DW$345, DW_AT_name("var")
    5591                    .dwattr $C$DW$345, DW_AT_const_value(0x08)
    5592                    .dwattr $C$DW$345, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5593                    .dwattr $C$DW$345, DW_AT_decl_line(0x78)
    5594                    .dwattr $C$DW$345, DW_AT_decl_column(0x05)
    5595            
    5596            $C$DW$346       .dwtag  DW_TAG_enumerator
    5597                    .dwattr $C$DW$346, DW_AT_name("UGmsg")
    5598                    .dwattr $C$DW$346, DW_AT_const_value(0x09)
    5599                    .dwattr $C$DW$346, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5600                    .dwattr $C$DW$346, DW_AT_decl_line(0x79)
    5601                    .dwattr $C$DW$346, DW_AT_decl_column(0x05)
    5602            
    5603                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5604                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    5605                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    5606                    .dwendtag $C$DW$T$57
    5607            
    5608            $C$DW$T$58      .dwtag  DW_TAG_typedef
    5609                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    5610                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    5611                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5612                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5613                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    5614                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    5615            
    5616            
    5617            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    5618                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    5619            $C$DW$347       .dwtag  DW_TAG_enumerator
    5620                    .dwattr $C$DW$347, DW_AT_name("init")
    5621                    .dwattr $C$DW$347, DW_AT_const_value(0x00)
    5622                    .dwattr $C$DW$347, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5623                    .dwattr $C$DW$347, DW_AT_decl_line(0x80)
    5624                    .dwattr $C$DW$347, DW_AT_decl_column(0x05)
    5625            
    5626            $C$DW$348       .dwtag  DW_TAG_enumerator
    5627                    .dwattr $C$DW$348, DW_AT_name("running")
    5628                    .dwattr $C$DW$348, DW_AT_const_value(0x01)
    5629                    .dwattr $C$DW$348, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5630                    .dwattr $C$DW$348, DW_AT_decl_line(0x80)
    5631                    .dwattr $C$DW$348, DW_AT_decl_column(0x0b)
    5632            
    5633            $C$DW$349       .dwtag  DW_TAG_enumerator
    5634                    .dwattr $C$DW$349, DW_AT_name("wait")
    5635                    .dwattr $C$DW$349, DW_AT_const_value(0x02)
    5636                    .dwattr $C$DW$349, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5637                    .dwattr $C$DW$349, DW_AT_decl_line(0x80)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  121

    5638                    .dwattr $C$DW$349, DW_AT_decl_column(0x14)
    5639            
    5640                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5641                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    5642                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    5643                    .dwendtag $C$DW$T$59
    5644            
    5645            $C$DW$T$60      .dwtag  DW_TAG_typedef
    5646                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    5647                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    5648                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    5649                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5650                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    5651                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    5652            
    5653            
    5654            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5655                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    5656            $C$DW$350       .dwtag  DW_TAG_member
    5657                    .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$14)
    5658                    .dwattr $C$DW$350, DW_AT_name("__max_align1")
    5659                    .dwattr $C$DW$350, DW_AT_TI_symbol_name("__max_align1")
    5660                    .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5661                    .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5662                    .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    5663                    .dwattr $C$DW$350, DW_AT_decl_line(0x7b)
    5664                    .dwattr $C$DW$350, DW_AT_decl_column(0x0c)
    5665            
    5666            $C$DW$351       .dwtag  DW_TAG_member
    5667                    .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$18)
    5668                    .dwattr $C$DW$351, DW_AT_name("__max_align2")
    5669                    .dwattr $C$DW$351, DW_AT_TI_symbol_name("__max_align2")
    5670                    .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5671                    .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5672                    .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    5673                    .dwattr $C$DW$351, DW_AT_decl_line(0x7c)
    5674                    .dwattr $C$DW$351, DW_AT_decl_column(0x0e)
    5675            
    5676                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    5677                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    5678                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    5679                    .dwendtag $C$DW$T$22
    5680            
    5681            $C$DW$T$61      .dwtag  DW_TAG_typedef
    5682                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    5683                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    5684                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    5685                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    5686                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    5687                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    5688            
    5689            
    5690            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5691                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    5692                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  122

    5693            $C$DW$352       .dwtag  DW_TAG_member
    5694                    .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$24)
    5695                    .dwattr $C$DW$352, DW_AT_name("memoryBufferControlIndex")
    5696                    .dwattr $C$DW$352, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    5697                    .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5698                    .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5699                    .dwattr $C$DW$352, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5700                    .dwattr $C$DW$352, DW_AT_decl_line(0x27)
    5701                    .dwattr $C$DW$352, DW_AT_decl_column(0x0d)
    5702            
    5703            $C$DW$353       .dwtag  DW_TAG_member
    5704                    .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$24)
    5705                    .dwattr $C$DW$353, DW_AT_name("inputSourceSelect")
    5706                    .dwattr $C$DW$353, DW_AT_TI_symbol_name("inputSourceSelect")
    5707                    .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5708                    .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5709                    .dwattr $C$DW$353, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5710                    .dwattr $C$DW$353, DW_AT_decl_line(0x3b)
    5711                    .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    5712            
    5713            $C$DW$354       .dwtag  DW_TAG_member
    5714                    .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$24)
    5715                    .dwattr $C$DW$354, DW_AT_name("positiveRefVoltageSourceSelect")
    5716                    .dwattr $C$DW$354, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    5717                    .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5718                    .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5719                    .dwattr $C$DW$354, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5720                    .dwattr $C$DW$354, DW_AT_decl_line(0x42)
    5721                    .dwattr $C$DW$354, DW_AT_decl_column(0x0d)
    5722            
    5723            $C$DW$355       .dwtag  DW_TAG_member
    5724                    .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$24)
    5725                    .dwattr $C$DW$355, DW_AT_name("negativeRefVoltageSourceSelect")
    5726                    .dwattr $C$DW$355, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    5727                    .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5728                    .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5729                    .dwattr $C$DW$355, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5730                    .dwattr $C$DW$355, DW_AT_decl_line(0x48)
    5731                    .dwattr $C$DW$355, DW_AT_decl_column(0x0d)
    5732            
    5733            $C$DW$356       .dwtag  DW_TAG_member
    5734                    .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$24)
    5735                    .dwattr $C$DW$356, DW_AT_name("endOfSequence")
    5736                    .dwattr $C$DW$356, DW_AT_TI_symbol_name("endOfSequence")
    5737                    .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5738                    .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5739                    .dwattr $C$DW$356, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5740                    .dwattr $C$DW$356, DW_AT_decl_line(0x51)
    5741                    .dwattr $C$DW$356, DW_AT_decl_column(0x0d)
    5742            
    5743                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    5744                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    5745                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5746                    .dwendtag $C$DW$T$25
    5747            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  123

    5748            $C$DW$T$62      .dwtag  DW_TAG_typedef
    5749                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    5750                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    5751                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    5752                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    5753                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    5754                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    5755            
    5756            
    5757            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5758                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    5759                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    5760            $C$DW$357       .dwtag  DW_TAG_member
    5761                    .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$27)
    5762                    .dwattr $C$DW$357, DW_AT_name("captureRegister")
    5763                    .dwattr $C$DW$357, DW_AT_TI_symbol_name("captureRegister")
    5764                    .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5765                    .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5766                    .dwattr $C$DW$357, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5767                    .dwattr $C$DW$357, DW_AT_decl_line(0x58)
    5768                    .dwattr $C$DW$357, DW_AT_decl_column(0x0e)
    5769            
    5770            $C$DW$358       .dwtag  DW_TAG_member
    5771                    .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$27)
    5772                    .dwattr $C$DW$358, DW_AT_name("captureMode")
    5773                    .dwattr $C$DW$358, DW_AT_TI_symbol_name("captureMode")
    5774                    .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5775                    .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5776                    .dwattr $C$DW$358, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5777                    .dwattr $C$DW$358, DW_AT_decl_line(0x5f)
    5778                    .dwattr $C$DW$358, DW_AT_decl_column(0x0e)
    5779            
    5780            $C$DW$359       .dwtag  DW_TAG_member
    5781                    .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$27)
    5782                    .dwattr $C$DW$359, DW_AT_name("captureInputSelect")
    5783                    .dwattr $C$DW$359, DW_AT_TI_symbol_name("captureInputSelect")
    5784                    .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5785                    .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5786                    .dwattr $C$DW$359, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5787                    .dwattr $C$DW$359, DW_AT_decl_line(0x66)
    5788                    .dwattr $C$DW$359, DW_AT_decl_column(0x0e)
    5789            
    5790            $C$DW$360       .dwtag  DW_TAG_member
    5791                    .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$27)
    5792                    .dwattr $C$DW$360, DW_AT_name("synchronizeCaptureSource")
    5793                    .dwattr $C$DW$360, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    5794                    .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5795                    .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5796                    .dwattr $C$DW$360, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5797                    .dwattr $C$DW$360, DW_AT_decl_line(0x6b)
    5798                    .dwattr $C$DW$360, DW_AT_decl_column(0x0e)
    5799            
    5800            $C$DW$361       .dwtag  DW_TAG_member
    5801                    .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$27)
    5802                    .dwattr $C$DW$361, DW_AT_name("captureInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  124

    5803                    .dwattr $C$DW$361, DW_AT_TI_symbol_name("captureInterruptEnable")
    5804                    .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5805                    .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5806                    .dwattr $C$DW$361, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5807                    .dwattr $C$DW$361, DW_AT_decl_line(0x70)
    5808                    .dwattr $C$DW$361, DW_AT_decl_column(0x0e)
    5809            
    5810            $C$DW$362       .dwtag  DW_TAG_member
    5811                    .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$27)
    5812                    .dwattr $C$DW$362, DW_AT_name("captureOutputMode")
    5813                    .dwattr $C$DW$362, DW_AT_TI_symbol_name("captureOutputMode")
    5814                    .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5815                    .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5816                    .dwattr $C$DW$362, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5817                    .dwattr $C$DW$362, DW_AT_decl_line(0x7b)
    5818                    .dwattr $C$DW$362, DW_AT_decl_column(0x0e)
    5819            
    5820                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5821                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    5822                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5823                    .dwendtag $C$DW$T$28
    5824            
    5825            $C$DW$T$63      .dwtag  DW_TAG_typedef
    5826                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    5827                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    5828                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5829                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5830                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    5831                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    5832            
    5833            
    5834            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5835                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    5836                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    5837            $C$DW$363       .dwtag  DW_TAG_member
    5838                    .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$27)
    5839                    .dwattr $C$DW$363, DW_AT_name("compareRegister")
    5840                    .dwattr $C$DW$363, DW_AT_TI_symbol_name("compareRegister")
    5841                    .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5842                    .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5843                    .dwattr $C$DW$363, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5844                    .dwattr $C$DW$363, DW_AT_decl_line(0x145)
    5845                    .dwattr $C$DW$363, DW_AT_decl_column(0x0e)
    5846            
    5847            $C$DW$364       .dwtag  DW_TAG_member
    5848                    .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$27)
    5849                    .dwattr $C$DW$364, DW_AT_name("compareInterruptEnable")
    5850                    .dwattr $C$DW$364, DW_AT_TI_symbol_name("compareInterruptEnable")
    5851                    .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5852                    .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5853                    .dwattr $C$DW$364, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5854                    .dwattr $C$DW$364, DW_AT_decl_line(0x14a)
    5855                    .dwattr $C$DW$364, DW_AT_decl_column(0x0e)
    5856            
    5857            $C$DW$365       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  125

    5858                    .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$27)
    5859                    .dwattr $C$DW$365, DW_AT_name("compareOutputMode")
    5860                    .dwattr $C$DW$365, DW_AT_TI_symbol_name("compareOutputMode")
    5861                    .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5862                    .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5863                    .dwattr $C$DW$365, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5864                    .dwattr $C$DW$365, DW_AT_decl_line(0x155)
    5865                    .dwattr $C$DW$365, DW_AT_decl_column(0x0e)
    5866            
    5867            $C$DW$366       .dwtag  DW_TAG_member
    5868                    .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$27)
    5869                    .dwattr $C$DW$366, DW_AT_name("compareValue")
    5870                    .dwattr $C$DW$366, DW_AT_TI_symbol_name("compareValue")
    5871                    .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5872                    .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5873                    .dwattr $C$DW$366, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5874                    .dwattr $C$DW$366, DW_AT_decl_line(0x157)
    5875                    .dwattr $C$DW$366, DW_AT_decl_column(0x0e)
    5876            
    5877                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5878                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    5879                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5880                    .dwendtag $C$DW$T$29
    5881            
    5882            $C$DW$T$64      .dwtag  DW_TAG_typedef
    5883                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    5884                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    5885                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    5886                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5887                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    5888                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    5889            
    5890            
    5891            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5892                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    5893                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    5894            $C$DW$367       .dwtag  DW_TAG_member
    5895                    .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$27)
    5896                    .dwattr $C$DW$367, DW_AT_name("clockSource")
    5897                    .dwattr $C$DW$367, DW_AT_TI_symbol_name("clockSource")
    5898                    .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5899                    .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5900                    .dwattr $C$DW$367, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5901                    .dwattr $C$DW$367, DW_AT_decl_line(0x20)
    5902                    .dwattr $C$DW$367, DW_AT_decl_column(0x0e)
    5903            
    5904            $C$DW$368       .dwtag  DW_TAG_member
    5905                    .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$27)
    5906                    .dwattr $C$DW$368, DW_AT_name("clockSourceDivider")
    5907                    .dwattr $C$DW$368, DW_AT_TI_symbol_name("clockSourceDivider")
    5908                    .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5909                    .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5910                    .dwattr $C$DW$368, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5911                    .dwattr $C$DW$368, DW_AT_decl_line(0x37)
    5912                    .dwattr $C$DW$368, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  126

    5913            
    5914            $C$DW$369       .dwtag  DW_TAG_member
    5915                    .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$27)
    5916                    .dwattr $C$DW$369, DW_AT_name("timerInterruptEnable_TAIE")
    5917                    .dwattr $C$DW$369, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5918                    .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5919                    .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5920                    .dwattr $C$DW$369, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5921                    .dwattr $C$DW$369, DW_AT_decl_line(0x3c)
    5922                    .dwattr $C$DW$369, DW_AT_decl_column(0x0e)
    5923            
    5924            $C$DW$370       .dwtag  DW_TAG_member
    5925                    .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$27)
    5926                    .dwattr $C$DW$370, DW_AT_name("timerClear")
    5927                    .dwattr $C$DW$370, DW_AT_TI_symbol_name("timerClear")
    5928                    .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5929                    .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5930                    .dwattr $C$DW$370, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5931                    .dwattr $C$DW$370, DW_AT_decl_line(0x42)
    5932                    .dwattr $C$DW$370, DW_AT_decl_column(0x0e)
    5933            
    5934            $C$DW$371       .dwtag  DW_TAG_member
    5935                    .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$30)
    5936                    .dwattr $C$DW$371, DW_AT_name("startTimer")
    5937                    .dwattr $C$DW$371, DW_AT_TI_symbol_name("startTimer")
    5938                    .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5939                    .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5940                    .dwattr $C$DW$371, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5941                    .dwattr $C$DW$371, DW_AT_decl_line(0x44)
    5942                    .dwattr $C$DW$371, DW_AT_decl_column(0x0a)
    5943            
    5944                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5945                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    5946                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5947                    .dwendtag $C$DW$T$31
    5948            
    5949            $C$DW$T$65      .dwtag  DW_TAG_typedef
    5950                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    5951                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    5952                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5953                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5954                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    5955                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    5956            
    5957            
    5958            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5959                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    5960                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    5961            $C$DW$372       .dwtag  DW_TAG_member
    5962                    .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$27)
    5963                    .dwattr $C$DW$372, DW_AT_name("clockSource")
    5964                    .dwattr $C$DW$372, DW_AT_TI_symbol_name("clockSource")
    5965                    .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5966                    .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5967                    .dwattr $C$DW$372, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  127

    5968                    .dwattr $C$DW$372, DW_AT_decl_line(0x8b)
    5969                    .dwattr $C$DW$372, DW_AT_decl_column(0x0e)
    5970            
    5971            $C$DW$373       .dwtag  DW_TAG_member
    5972                    .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$27)
    5973                    .dwattr $C$DW$373, DW_AT_name("clockSourceDivider")
    5974                    .dwattr $C$DW$373, DW_AT_TI_symbol_name("clockSourceDivider")
    5975                    .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5976                    .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5977                    .dwattr $C$DW$373, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5978                    .dwattr $C$DW$373, DW_AT_decl_line(0xa2)
    5979                    .dwattr $C$DW$373, DW_AT_decl_column(0x0e)
    5980            
    5981            $C$DW$374       .dwtag  DW_TAG_member
    5982                    .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$27)
    5983                    .dwattr $C$DW$374, DW_AT_name("timerPeriod")
    5984                    .dwattr $C$DW$374, DW_AT_TI_symbol_name("timerPeriod")
    5985                    .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5986                    .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5987                    .dwattr $C$DW$374, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5988                    .dwattr $C$DW$374, DW_AT_decl_line(0xa4)
    5989                    .dwattr $C$DW$374, DW_AT_decl_column(0x0e)
    5990            
    5991            $C$DW$375       .dwtag  DW_TAG_member
    5992                    .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$27)
    5993                    .dwattr $C$DW$375, DW_AT_name("timerInterruptEnable_TAIE")
    5994                    .dwattr $C$DW$375, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5995                    .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5996                    .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5997                    .dwattr $C$DW$375, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5998                    .dwattr $C$DW$375, DW_AT_decl_line(0xa9)
    5999                    .dwattr $C$DW$375, DW_AT_decl_column(0x0e)
    6000            
    6001            $C$DW$376       .dwtag  DW_TAG_member
    6002                    .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$27)
    6003                    .dwattr $C$DW$376, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6004                    .dwattr $C$DW$376, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6005                    .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6006                    .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6007                    .dwattr $C$DW$376, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6008                    .dwattr $C$DW$376, DW_AT_decl_line(0xae)
    6009                    .dwattr $C$DW$376, DW_AT_decl_column(0x0e)
    6010            
    6011            $C$DW$377       .dwtag  DW_TAG_member
    6012                    .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$27)
    6013                    .dwattr $C$DW$377, DW_AT_name("timerClear")
    6014                    .dwattr $C$DW$377, DW_AT_TI_symbol_name("timerClear")
    6015                    .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6016                    .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6017                    .dwattr $C$DW$377, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6018                    .dwattr $C$DW$377, DW_AT_decl_line(0xb4)
    6019                    .dwattr $C$DW$377, DW_AT_decl_column(0x0e)
    6020            
    6021            $C$DW$378       .dwtag  DW_TAG_member
    6022                    .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  128

    6023                    .dwattr $C$DW$378, DW_AT_name("startTimer")
    6024                    .dwattr $C$DW$378, DW_AT_TI_symbol_name("startTimer")
    6025                    .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6026                    .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6027                    .dwattr $C$DW$378, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6028                    .dwattr $C$DW$378, DW_AT_decl_line(0xb6)
    6029                    .dwattr $C$DW$378, DW_AT_decl_column(0x0a)
    6030            
    6031                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6032                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    6033                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    6034                    .dwendtag $C$DW$T$32
    6035            
    6036            $C$DW$T$66      .dwtag  DW_TAG_typedef
    6037                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    6038                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    6039                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    6040                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6041                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    6042                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    6043            
    6044            
    6045            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6046                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    6047                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    6048            $C$DW$379       .dwtag  DW_TAG_member
    6049                    .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$27)
    6050                    .dwattr $C$DW$379, DW_AT_name("clockSource")
    6051                    .dwattr $C$DW$379, DW_AT_TI_symbol_name("clockSource")
    6052                    .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6053                    .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6054                    .dwattr $C$DW$379, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6055                    .dwattr $C$DW$379, DW_AT_decl_line(0x105)
    6056                    .dwattr $C$DW$379, DW_AT_decl_column(0x0e)
    6057            
    6058            $C$DW$380       .dwtag  DW_TAG_member
    6059                    .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$27)
    6060                    .dwattr $C$DW$380, DW_AT_name("clockSourceDivider")
    6061                    .dwattr $C$DW$380, DW_AT_TI_symbol_name("clockSourceDivider")
    6062                    .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6063                    .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6064                    .dwattr $C$DW$380, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6065                    .dwattr $C$DW$380, DW_AT_decl_line(0x11c)
    6066                    .dwattr $C$DW$380, DW_AT_decl_column(0x0e)
    6067            
    6068            $C$DW$381       .dwtag  DW_TAG_member
    6069                    .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$27)
    6070                    .dwattr $C$DW$381, DW_AT_name("timerPeriod")
    6071                    .dwattr $C$DW$381, DW_AT_TI_symbol_name("timerPeriod")
    6072                    .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6073                    .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6074                    .dwattr $C$DW$381, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6075                    .dwattr $C$DW$381, DW_AT_decl_line(0x11f)
    6076                    .dwattr $C$DW$381, DW_AT_decl_column(0x0e)
    6077            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  129

    6078            $C$DW$382       .dwtag  DW_TAG_member
    6079                    .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$27)
    6080                    .dwattr $C$DW$382, DW_AT_name("timerInterruptEnable_TAIE")
    6081                    .dwattr $C$DW$382, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    6082                    .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6083                    .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6084                    .dwattr $C$DW$382, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6085                    .dwattr $C$DW$382, DW_AT_decl_line(0x124)
    6086                    .dwattr $C$DW$382, DW_AT_decl_column(0x0e)
    6087            
    6088            $C$DW$383       .dwtag  DW_TAG_member
    6089                    .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$27)
    6090                    .dwattr $C$DW$383, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6091                    .dwattr $C$DW$383, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6092                    .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6093                    .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    6094                    .dwattr $C$DW$383, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6095                    .dwattr $C$DW$383, DW_AT_decl_line(0x129)
    6096                    .dwattr $C$DW$383, DW_AT_decl_column(0x0e)
    6097            
    6098            $C$DW$384       .dwtag  DW_TAG_member
    6099                    .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$27)
    6100                    .dwattr $C$DW$384, DW_AT_name("timerClear")
    6101                    .dwattr $C$DW$384, DW_AT_TI_symbol_name("timerClear")
    6102                    .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6103                    .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6104                    .dwattr $C$DW$384, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6105                    .dwattr $C$DW$384, DW_AT_decl_line(0x12f)
    6106                    .dwattr $C$DW$384, DW_AT_decl_column(0x0e)
    6107            
    6108            $C$DW$385       .dwtag  DW_TAG_member
    6109                    .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$30)
    6110                    .dwattr $C$DW$385, DW_AT_name("startTimer")
    6111                    .dwattr $C$DW$385, DW_AT_TI_symbol_name("startTimer")
    6112                    .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6113                    .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6114                    .dwattr $C$DW$385, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6115                    .dwattr $C$DW$385, DW_AT_decl_line(0x131)
    6116                    .dwattr $C$DW$385, DW_AT_decl_column(0x0a)
    6117            
    6118                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6119                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    6120                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    6121                    .dwendtag $C$DW$T$33
    6122            
    6123            $C$DW$T$67      .dwtag  DW_TAG_typedef
    6124                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    6125                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    6126                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    6127                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6128                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    6129                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    6130            
    6131            
    6132            $C$DW$T$34      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  130

    6133                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    6134                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    6135            $C$DW$386       .dwtag  DW_TAG_member
    6136                    .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$27)
    6137                    .dwattr $C$DW$386, DW_AT_name("clockSource")
    6138                    .dwattr $C$DW$386, DW_AT_TI_symbol_name("clockSource")
    6139                    .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6140                    .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6141                    .dwattr $C$DW$386, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6142                    .dwattr $C$DW$386, DW_AT_decl_line(0xc5)
    6143                    .dwattr $C$DW$386, DW_AT_decl_column(0x0e)
    6144            
    6145            $C$DW$387       .dwtag  DW_TAG_member
    6146                    .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$27)
    6147                    .dwattr $C$DW$387, DW_AT_name("clockSourceDivider")
    6148                    .dwattr $C$DW$387, DW_AT_TI_symbol_name("clockSourceDivider")
    6149                    .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6150                    .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6151                    .dwattr $C$DW$387, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6152                    .dwattr $C$DW$387, DW_AT_decl_line(0xdc)
    6153                    .dwattr $C$DW$387, DW_AT_decl_column(0x0e)
    6154            
    6155            $C$DW$388       .dwtag  DW_TAG_member
    6156                    .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$27)
    6157                    .dwattr $C$DW$388, DW_AT_name("timerPeriod")
    6158                    .dwattr $C$DW$388, DW_AT_TI_symbol_name("timerPeriod")
    6159                    .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6160                    .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6161                    .dwattr $C$DW$388, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6162                    .dwattr $C$DW$388, DW_AT_decl_line(0xde)
    6163                    .dwattr $C$DW$388, DW_AT_decl_column(0x0e)
    6164            
    6165            $C$DW$389       .dwtag  DW_TAG_member
    6166                    .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$27)
    6167                    .dwattr $C$DW$389, DW_AT_name("compareRegister")
    6168                    .dwattr $C$DW$389, DW_AT_TI_symbol_name("compareRegister")
    6169                    .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6170                    .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6171                    .dwattr $C$DW$389, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6172                    .dwattr $C$DW$389, DW_AT_decl_line(0xe9)
    6173                    .dwattr $C$DW$389, DW_AT_decl_column(0x0e)
    6174            
    6175            $C$DW$390       .dwtag  DW_TAG_member
    6176                    .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$27)
    6177                    .dwattr $C$DW$390, DW_AT_name("compareOutputMode")
    6178                    .dwattr $C$DW$390, DW_AT_TI_symbol_name("compareOutputMode")
    6179                    .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6180                    .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6181                    .dwattr $C$DW$390, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6182                    .dwattr $C$DW$390, DW_AT_decl_line(0xf4)
    6183                    .dwattr $C$DW$390, DW_AT_decl_column(0x0e)
    6184            
    6185            $C$DW$391       .dwtag  DW_TAG_member
    6186                    .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$27)
    6187                    .dwattr $C$DW$391, DW_AT_name("dutyCycle")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  131

    6188                    .dwattr $C$DW$391, DW_AT_TI_symbol_name("dutyCycle")
    6189                    .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6190                    .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6191                    .dwattr $C$DW$391, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6192                    .dwattr $C$DW$391, DW_AT_decl_line(0xf6)
    6193                    .dwattr $C$DW$391, DW_AT_decl_column(0x0e)
    6194            
    6195                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6196                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    6197                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    6198                    .dwendtag $C$DW$T$34
    6199            
    6200            $C$DW$T$68      .dwtag  DW_TAG_typedef
    6201                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    6202                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    6203                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    6204                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6205                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    6206                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    6207            
    6208            
    6209            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6210                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    6211                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    6212            $C$DW$392       .dwtag  DW_TAG_member
    6213                    .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$27)
    6214                    .dwattr $C$DW$392, DW_AT_name("captureRegister")
    6215                    .dwattr $C$DW$392, DW_AT_TI_symbol_name("captureRegister")
    6216                    .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6217                    .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6218                    .dwattr $C$DW$392, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6219                    .dwattr $C$DW$392, DW_AT_decl_line(0xa0)
    6220                    .dwattr $C$DW$392, DW_AT_decl_column(0x0e)
    6221            
    6222            $C$DW$393       .dwtag  DW_TAG_member
    6223                    .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$27)
    6224                    .dwattr $C$DW$393, DW_AT_name("captureMode")
    6225                    .dwattr $C$DW$393, DW_AT_TI_symbol_name("captureMode")
    6226                    .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6227                    .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6228                    .dwattr $C$DW$393, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6229                    .dwattr $C$DW$393, DW_AT_decl_line(0xa7)
    6230                    .dwattr $C$DW$393, DW_AT_decl_column(0x0e)
    6231            
    6232            $C$DW$394       .dwtag  DW_TAG_member
    6233                    .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$27)
    6234                    .dwattr $C$DW$394, DW_AT_name("captureInputSelect")
    6235                    .dwattr $C$DW$394, DW_AT_TI_symbol_name("captureInputSelect")
    6236                    .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6237                    .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6238                    .dwattr $C$DW$394, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6239                    .dwattr $C$DW$394, DW_AT_decl_line(0xae)
    6240                    .dwattr $C$DW$394, DW_AT_decl_column(0x0e)
    6241            
    6242            $C$DW$395       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  132

    6243                    .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$27)
    6244                    .dwattr $C$DW$395, DW_AT_name("synchronizeCaptureSource")
    6245                    .dwattr $C$DW$395, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    6246                    .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6247                    .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6248                    .dwattr $C$DW$395, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6249                    .dwattr $C$DW$395, DW_AT_decl_line(0xb3)
    6250                    .dwattr $C$DW$395, DW_AT_decl_column(0x0e)
    6251            
    6252            $C$DW$396       .dwtag  DW_TAG_member
    6253                    .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$27)
    6254                    .dwattr $C$DW$396, DW_AT_name("captureInterruptEnable")
    6255                    .dwattr $C$DW$396, DW_AT_TI_symbol_name("captureInterruptEnable")
    6256                    .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6257                    .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6258                    .dwattr $C$DW$396, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6259                    .dwattr $C$DW$396, DW_AT_decl_line(0xb8)
    6260                    .dwattr $C$DW$396, DW_AT_decl_column(0x0e)
    6261            
    6262            $C$DW$397       .dwtag  DW_TAG_member
    6263                    .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$27)
    6264                    .dwattr $C$DW$397, DW_AT_name("captureOutputMode")
    6265                    .dwattr $C$DW$397, DW_AT_TI_symbol_name("captureOutputMode")
    6266                    .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6267                    .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6268                    .dwattr $C$DW$397, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6269                    .dwattr $C$DW$397, DW_AT_decl_line(0xc3)
    6270                    .dwattr $C$DW$397, DW_AT_decl_column(0x0e)
    6271            
    6272                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6273                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    6274                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    6275                    .dwendtag $C$DW$T$35
    6276            
    6277            $C$DW$T$69      .dwtag  DW_TAG_typedef
    6278                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    6279                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    6280                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    6281                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6282                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    6283                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    6284            
    6285            
    6286            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6287                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    6288                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    6289            $C$DW$398       .dwtag  DW_TAG_member
    6290                    .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$27)
    6291                    .dwattr $C$DW$398, DW_AT_name("compareRegister")
    6292                    .dwattr $C$DW$398, DW_AT_TI_symbol_name("compareRegister")
    6293                    .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6294                    .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6295                    .dwattr $C$DW$398, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6296                    .dwattr $C$DW$398, DW_AT_decl_line(0x146)
    6297                    .dwattr $C$DW$398, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  133

    6298            
    6299            $C$DW$399       .dwtag  DW_TAG_member
    6300                    .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$27)
    6301                    .dwattr $C$DW$399, DW_AT_name("compareInterruptEnable")
    6302                    .dwattr $C$DW$399, DW_AT_TI_symbol_name("compareInterruptEnable")
    6303                    .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6304                    .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6305                    .dwattr $C$DW$399, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6306                    .dwattr $C$DW$399, DW_AT_decl_line(0x14b)
    6307                    .dwattr $C$DW$399, DW_AT_decl_column(0x0e)
    6308            
    6309            $C$DW$400       .dwtag  DW_TAG_member
    6310                    .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$27)
    6311                    .dwattr $C$DW$400, DW_AT_name("compareOutputMode")
    6312                    .dwattr $C$DW$400, DW_AT_TI_symbol_name("compareOutputMode")
    6313                    .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6314                    .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6315                    .dwattr $C$DW$400, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6316                    .dwattr $C$DW$400, DW_AT_decl_line(0x156)
    6317                    .dwattr $C$DW$400, DW_AT_decl_column(0x0e)
    6318            
    6319            $C$DW$401       .dwtag  DW_TAG_member
    6320                    .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$27)
    6321                    .dwattr $C$DW$401, DW_AT_name("compareValue")
    6322                    .dwattr $C$DW$401, DW_AT_TI_symbol_name("compareValue")
    6323                    .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6324                    .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6325                    .dwattr $C$DW$401, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6326                    .dwattr $C$DW$401, DW_AT_decl_line(0x158)
    6327                    .dwattr $C$DW$401, DW_AT_decl_column(0x0e)
    6328            
    6329                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6330                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    6331                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    6332                    .dwendtag $C$DW$T$36
    6333            
    6334            $C$DW$T$70      .dwtag  DW_TAG_typedef
    6335                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    6336                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    6337                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    6338                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6339                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    6340                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    6341            
    6342            
    6343            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6344                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    6345                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    6346            $C$DW$402       .dwtag  DW_TAG_member
    6347                    .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$27)
    6348                    .dwattr $C$DW$402, DW_AT_name("clockSource")
    6349                    .dwattr $C$DW$402, DW_AT_TI_symbol_name("clockSource")
    6350                    .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6351                    .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6352                    .dwattr $C$DW$402, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  134

    6353                    .dwattr $C$DW$402, DW_AT_decl_line(0xd3)
    6354                    .dwattr $C$DW$402, DW_AT_decl_column(0x0e)
    6355            
    6356            $C$DW$403       .dwtag  DW_TAG_member
    6357                    .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$27)
    6358                    .dwattr $C$DW$403, DW_AT_name("clockSourceDivider")
    6359                    .dwattr $C$DW$403, DW_AT_TI_symbol_name("clockSourceDivider")
    6360                    .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6361                    .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6362                    .dwattr $C$DW$403, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6363                    .dwattr $C$DW$403, DW_AT_decl_line(0xea)
    6364                    .dwattr $C$DW$403, DW_AT_decl_column(0x0e)
    6365            
    6366            $C$DW$404       .dwtag  DW_TAG_member
    6367                    .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$27)
    6368                    .dwattr $C$DW$404, DW_AT_name("timerInterruptEnable_TBIE")
    6369                    .dwattr $C$DW$404, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    6370                    .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6371                    .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6372                    .dwattr $C$DW$404, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6373                    .dwattr $C$DW$404, DW_AT_decl_line(0xef)
    6374                    .dwattr $C$DW$404, DW_AT_decl_column(0x0e)
    6375            
    6376            $C$DW$405       .dwtag  DW_TAG_member
    6377                    .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$27)
    6378                    .dwattr $C$DW$405, DW_AT_name("timerClear")
    6379                    .dwattr $C$DW$405, DW_AT_TI_symbol_name("timerClear")
    6380                    .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6381                    .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6382                    .dwattr $C$DW$405, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6383                    .dwattr $C$DW$405, DW_AT_decl_line(0xf5)
    6384                    .dwattr $C$DW$405, DW_AT_decl_column(0x0e)
    6385            
    6386            $C$DW$406       .dwtag  DW_TAG_member
    6387                    .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$30)
    6388                    .dwattr $C$DW$406, DW_AT_name("startTimer")
    6389                    .dwattr $C$DW$406, DW_AT_TI_symbol_name("startTimer")
    6390                    .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6391                    .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6392                    .dwattr $C$DW$406, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6393                    .dwattr $C$DW$406, DW_AT_decl_line(0xf7)
    6394                    .dwattr $C$DW$406, DW_AT_decl_column(0x0a)
    6395            
    6396                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6397                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    6398                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    6399                    .dwendtag $C$DW$T$37
    6400            
    6401            $C$DW$T$71      .dwtag  DW_TAG_typedef
    6402                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    6403                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    6404                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    6405                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6406                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    6407                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  135

    6408            
    6409            
    6410            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6411                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    6412                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    6413            $C$DW$407       .dwtag  DW_TAG_member
    6414                    .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$27)
    6415                    .dwattr $C$DW$407, DW_AT_name("clockSource")
    6416                    .dwattr $C$DW$407, DW_AT_TI_symbol_name("clockSource")
    6417                    .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6418                    .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6419                    .dwattr $C$DW$407, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6420                    .dwattr $C$DW$407, DW_AT_decl_line(0x107)
    6421                    .dwattr $C$DW$407, DW_AT_decl_column(0x0e)
    6422            
    6423            $C$DW$408       .dwtag  DW_TAG_member
    6424                    .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$27)
    6425                    .dwattr $C$DW$408, DW_AT_name("clockSourceDivider")
    6426                    .dwattr $C$DW$408, DW_AT_TI_symbol_name("clockSourceDivider")
    6427                    .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6428                    .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6429                    .dwattr $C$DW$408, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6430                    .dwattr $C$DW$408, DW_AT_decl_line(0x11e)
    6431                    .dwattr $C$DW$408, DW_AT_decl_column(0x0e)
    6432            
    6433            $C$DW$409       .dwtag  DW_TAG_member
    6434                    .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$27)
    6435                    .dwattr $C$DW$409, DW_AT_name("timerPeriod")
    6436                    .dwattr $C$DW$409, DW_AT_TI_symbol_name("timerPeriod")
    6437                    .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6438                    .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6439                    .dwattr $C$DW$409, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6440                    .dwattr $C$DW$409, DW_AT_decl_line(0x120)
    6441                    .dwattr $C$DW$409, DW_AT_decl_column(0x0e)
    6442            
    6443            $C$DW$410       .dwtag  DW_TAG_member
    6444                    .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$27)
    6445                    .dwattr $C$DW$410, DW_AT_name("timerInterruptEnable_TBIE")
    6446                    .dwattr $C$DW$410, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    6447                    .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6448                    .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6449                    .dwattr $C$DW$410, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6450                    .dwattr $C$DW$410, DW_AT_decl_line(0x125)
    6451                    .dwattr $C$DW$410, DW_AT_decl_column(0x0e)
    6452            
    6453            $C$DW$411       .dwtag  DW_TAG_member
    6454                    .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$27)
    6455                    .dwattr $C$DW$411, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6456                    .dwattr $C$DW$411, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6457                    .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6458                    .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6459                    .dwattr $C$DW$411, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6460                    .dwattr $C$DW$411, DW_AT_decl_line(0x12a)
    6461                    .dwattr $C$DW$411, DW_AT_decl_column(0x0e)
    6462            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  136

    6463            $C$DW$412       .dwtag  DW_TAG_member
    6464                    .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$27)
    6465                    .dwattr $C$DW$412, DW_AT_name("timerClear")
    6466                    .dwattr $C$DW$412, DW_AT_TI_symbol_name("timerClear")
    6467                    .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6468                    .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6469                    .dwattr $C$DW$412, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6470                    .dwattr $C$DW$412, DW_AT_decl_line(0x130)
    6471                    .dwattr $C$DW$412, DW_AT_decl_column(0x0e)
    6472            
    6473            $C$DW$413       .dwtag  DW_TAG_member
    6474                    .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$30)
    6475                    .dwattr $C$DW$413, DW_AT_name("startTimer")
    6476                    .dwattr $C$DW$413, DW_AT_TI_symbol_name("startTimer")
    6477                    .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6478                    .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6479                    .dwattr $C$DW$413, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6480                    .dwattr $C$DW$413, DW_AT_decl_line(0x132)
    6481                    .dwattr $C$DW$413, DW_AT_decl_column(0x0a)
    6482            
    6483                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6484                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    6485                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    6486                    .dwendtag $C$DW$T$38
    6487            
    6488            $C$DW$T$72      .dwtag  DW_TAG_typedef
    6489                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    6490                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    6491                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6492                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6493                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    6494                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    6495            
    6496            
    6497            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6498                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    6499                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    6500            $C$DW$414       .dwtag  DW_TAG_member
    6501                    .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$27)
    6502                    .dwattr $C$DW$414, DW_AT_name("clockSource")
    6503                    .dwattr $C$DW$414, DW_AT_TI_symbol_name("clockSource")
    6504                    .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6505                    .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6506                    .dwattr $C$DW$414, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6507                    .dwattr $C$DW$414, DW_AT_decl_line(0x60)
    6508                    .dwattr $C$DW$414, DW_AT_decl_column(0x0e)
    6509            
    6510            $C$DW$415       .dwtag  DW_TAG_member
    6511                    .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$27)
    6512                    .dwattr $C$DW$415, DW_AT_name("clockSourceDivider")
    6513                    .dwattr $C$DW$415, DW_AT_TI_symbol_name("clockSourceDivider")
    6514                    .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6515                    .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6516                    .dwattr $C$DW$415, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6517                    .dwattr $C$DW$415, DW_AT_decl_line(0x77)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  137

    6518                    .dwattr $C$DW$415, DW_AT_decl_column(0x0e)
    6519            
    6520            $C$DW$416       .dwtag  DW_TAG_member
    6521                    .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$27)
    6522                    .dwattr $C$DW$416, DW_AT_name("timerPeriod")
    6523                    .dwattr $C$DW$416, DW_AT_TI_symbol_name("timerPeriod")
    6524                    .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6525                    .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6526                    .dwattr $C$DW$416, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6527                    .dwattr $C$DW$416, DW_AT_decl_line(0x7a)
    6528                    .dwattr $C$DW$416, DW_AT_decl_column(0x0e)
    6529            
    6530            $C$DW$417       .dwtag  DW_TAG_member
    6531                    .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$27)
    6532                    .dwattr $C$DW$417, DW_AT_name("timerInterruptEnable_TBIE")
    6533                    .dwattr $C$DW$417, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    6534                    .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6535                    .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6536                    .dwattr $C$DW$417, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6537                    .dwattr $C$DW$417, DW_AT_decl_line(0x7f)
    6538                    .dwattr $C$DW$417, DW_AT_decl_column(0x0e)
    6539            
    6540            $C$DW$418       .dwtag  DW_TAG_member
    6541                    .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$27)
    6542                    .dwattr $C$DW$418, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6543                    .dwattr $C$DW$418, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6544                    .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6545                    .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6546                    .dwattr $C$DW$418, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6547                    .dwattr $C$DW$418, DW_AT_decl_line(0x84)
    6548                    .dwattr $C$DW$418, DW_AT_decl_column(0x0e)
    6549            
    6550            $C$DW$419       .dwtag  DW_TAG_member
    6551                    .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$27)
    6552                    .dwattr $C$DW$419, DW_AT_name("timerClear")
    6553                    .dwattr $C$DW$419, DW_AT_TI_symbol_name("timerClear")
    6554                    .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6555                    .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6556                    .dwattr $C$DW$419, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6557                    .dwattr $C$DW$419, DW_AT_decl_line(0x8a)
    6558                    .dwattr $C$DW$419, DW_AT_decl_column(0x0e)
    6559            
    6560            $C$DW$420       .dwtag  DW_TAG_member
    6561                    .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$30)
    6562                    .dwattr $C$DW$420, DW_AT_name("startTimer")
    6563                    .dwattr $C$DW$420, DW_AT_TI_symbol_name("startTimer")
    6564                    .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6565                    .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6566                    .dwattr $C$DW$420, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6567                    .dwattr $C$DW$420, DW_AT_decl_line(0x8c)
    6568                    .dwattr $C$DW$420, DW_AT_decl_column(0x0a)
    6569            
    6570                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6571                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    6572                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  138

    6573                    .dwendtag $C$DW$T$39
    6574            
    6575            $C$DW$T$73      .dwtag  DW_TAG_typedef
    6576                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    6577                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    6578                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6579                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6580                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    6581                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    6582            
    6583            
    6584            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6585                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    6586                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    6587            $C$DW$421       .dwtag  DW_TAG_member
    6588                    .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$27)
    6589                    .dwattr $C$DW$421, DW_AT_name("clockSource")
    6590                    .dwattr $C$DW$421, DW_AT_TI_symbol_name("clockSource")
    6591                    .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6592                    .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6593                    .dwattr $C$DW$421, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6594                    .dwattr $C$DW$421, DW_AT_decl_line(0x20)
    6595                    .dwattr $C$DW$421, DW_AT_decl_column(0x0e)
    6596            
    6597            $C$DW$422       .dwtag  DW_TAG_member
    6598                    .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$27)
    6599                    .dwattr $C$DW$422, DW_AT_name("clockSourceDivider")
    6600                    .dwattr $C$DW$422, DW_AT_TI_symbol_name("clockSourceDivider")
    6601                    .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6602                    .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6603                    .dwattr $C$DW$422, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6604                    .dwattr $C$DW$422, DW_AT_decl_line(0x37)
    6605                    .dwattr $C$DW$422, DW_AT_decl_column(0x0e)
    6606            
    6607            $C$DW$423       .dwtag  DW_TAG_member
    6608                    .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$27)
    6609                    .dwattr $C$DW$423, DW_AT_name("timerPeriod")
    6610                    .dwattr $C$DW$423, DW_AT_TI_symbol_name("timerPeriod")
    6611                    .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6612                    .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6613                    .dwattr $C$DW$423, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6614                    .dwattr $C$DW$423, DW_AT_decl_line(0x39)
    6615                    .dwattr $C$DW$423, DW_AT_decl_column(0x0e)
    6616            
    6617            $C$DW$424       .dwtag  DW_TAG_member
    6618                    .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$27)
    6619                    .dwattr $C$DW$424, DW_AT_name("compareRegister")
    6620                    .dwattr $C$DW$424, DW_AT_TI_symbol_name("compareRegister")
    6621                    .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6622                    .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6623                    .dwattr $C$DW$424, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6624                    .dwattr $C$DW$424, DW_AT_decl_line(0x44)
    6625                    .dwattr $C$DW$424, DW_AT_decl_column(0x0e)
    6626            
    6627            $C$DW$425       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  139

    6628                    .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$27)
    6629                    .dwattr $C$DW$425, DW_AT_name("compareOutputMode")
    6630                    .dwattr $C$DW$425, DW_AT_TI_symbol_name("compareOutputMode")
    6631                    .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6632                    .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6633                    .dwattr $C$DW$425, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6634                    .dwattr $C$DW$425, DW_AT_decl_line(0x4f)
    6635                    .dwattr $C$DW$425, DW_AT_decl_column(0x0e)
    6636            
    6637            $C$DW$426       .dwtag  DW_TAG_member
    6638                    .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$27)
    6639                    .dwattr $C$DW$426, DW_AT_name("dutyCycle")
    6640                    .dwattr $C$DW$426, DW_AT_TI_symbol_name("dutyCycle")
    6641                    .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6642                    .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6643                    .dwattr $C$DW$426, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6644                    .dwattr $C$DW$426, DW_AT_decl_line(0x51)
    6645                    .dwattr $C$DW$426, DW_AT_decl_column(0x0e)
    6646            
    6647                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6648                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    6649                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    6650                    .dwendtag $C$DW$T$40
    6651            
    6652            $C$DW$T$74      .dwtag  DW_TAG_typedef
    6653                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    6654                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    6655                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    6656                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6657                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    6658                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    6659            
    6660            
    6661            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6662                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    6663                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    6664            $C$DW$427       .dwtag  DW_TAG_member
    6665                    .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
    6666                    .dwattr $C$DW$427, DW_AT_name("selectClockSource")
    6667                    .dwattr $C$DW$427, DW_AT_TI_symbol_name("selectClockSource")
    6668                    .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6669                    .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6670                    .dwattr $C$DW$427, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6671                    .dwattr $C$DW$427, DW_AT_decl_line(0x1c)
    6672                    .dwattr $C$DW$427, DW_AT_decl_column(0x0d)
    6673            
    6674            $C$DW$428       .dwtag  DW_TAG_member
    6675                    .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$27)
    6676                    .dwattr $C$DW$428, DW_AT_name("clockPrescalar")
    6677                    .dwattr $C$DW$428, DW_AT_TI_symbol_name("clockPrescalar")
    6678                    .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6679                    .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6680                    .dwattr $C$DW$428, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6681                    .dwattr $C$DW$428, DW_AT_decl_line(0x1e)
    6682                    .dwattr $C$DW$428, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  140

    6683            
    6684            $C$DW$429       .dwtag  DW_TAG_member
    6685                    .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    6686                    .dwattr $C$DW$429, DW_AT_name("firstModReg")
    6687                    .dwattr $C$DW$429, DW_AT_TI_symbol_name("firstModReg")
    6688                    .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6689                    .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6690                    .dwattr $C$DW$429, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6691                    .dwattr $C$DW$429, DW_AT_decl_line(0x22)
    6692                    .dwattr $C$DW$429, DW_AT_decl_column(0x0d)
    6693            
    6694            $C$DW$430       .dwtag  DW_TAG_member
    6695                    .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$24)
    6696                    .dwattr $C$DW$430, DW_AT_name("secondModReg")
    6697                    .dwattr $C$DW$430, DW_AT_TI_symbol_name("secondModReg")
    6698                    .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6699                    .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6700                    .dwattr $C$DW$430, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6701                    .dwattr $C$DW$430, DW_AT_decl_line(0x26)
    6702                    .dwattr $C$DW$430, DW_AT_decl_column(0x0d)
    6703            
    6704            $C$DW$431       .dwtag  DW_TAG_member
    6705                    .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
    6706                    .dwattr $C$DW$431, DW_AT_name("parity")
    6707                    .dwattr $C$DW$431, DW_AT_TI_symbol_name("parity")
    6708                    .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6709                    .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6710                    .dwattr $C$DW$431, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6711                    .dwattr $C$DW$431, DW_AT_decl_line(0x2c)
    6712                    .dwattr $C$DW$431, DW_AT_decl_column(0x0d)
    6713            
    6714            $C$DW$432       .dwtag  DW_TAG_member
    6715                    .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
    6716                    .dwattr $C$DW$432, DW_AT_name("msborLsbFirst")
    6717                    .dwattr $C$DW$432, DW_AT_TI_symbol_name("msborLsbFirst")
    6718                    .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6719                    .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6720                    .dwattr $C$DW$432, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6721                    .dwattr $C$DW$432, DW_AT_decl_line(0x31)
    6722                    .dwattr $C$DW$432, DW_AT_decl_column(0x0d)
    6723            
    6724            $C$DW$433       .dwtag  DW_TAG_member
    6725                    .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$24)
    6726                    .dwattr $C$DW$433, DW_AT_name("numberofStopBits")
    6727                    .dwattr $C$DW$433, DW_AT_TI_symbol_name("numberofStopBits")
    6728                    .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6729                    .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6730                    .dwattr $C$DW$433, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6731                    .dwattr $C$DW$433, DW_AT_decl_line(0x36)
    6732                    .dwattr $C$DW$433, DW_AT_decl_column(0x0d)
    6733            
    6734            $C$DW$434       .dwtag  DW_TAG_member
    6735                    .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$24)
    6736                    .dwattr $C$DW$434, DW_AT_name("uartMode")
    6737                    .dwattr $C$DW$434, DW_AT_TI_symbol_name("uartMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  141

    6738                    .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6739                    .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6740                    .dwattr $C$DW$434, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6741                    .dwattr $C$DW$434, DW_AT_decl_line(0x3d)
    6742                    .dwattr $C$DW$434, DW_AT_decl_column(0x0d)
    6743            
    6744            $C$DW$435       .dwtag  DW_TAG_member
    6745                    .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$24)
    6746                    .dwattr $C$DW$435, DW_AT_name("overSampling")
    6747                    .dwattr $C$DW$435, DW_AT_TI_symbol_name("overSampling")
    6748                    .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6749                    .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6750                    .dwattr $C$DW$435, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6751                    .dwattr $C$DW$435, DW_AT_decl_line(0x42)
    6752                    .dwattr $C$DW$435, DW_AT_decl_column(0x0d)
    6753            
    6754                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6755                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    6756                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6757                    .dwendtag $C$DW$T$41
    6758            
    6759            $C$DW$T$75      .dwtag  DW_TAG_typedef
    6760                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    6761                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    6762                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    6763                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6764                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    6765                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    6766            
    6767            
    6768            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6769                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    6770                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    6771            $C$DW$436       .dwtag  DW_TAG_member
    6772                    .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$43)
    6773                    .dwattr $C$DW$436, DW_AT_name("clockSourceFrequency")
    6774                    .dwattr $C$DW$436, DW_AT_TI_symbol_name("clockSourceFrequency")
    6775                    .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6776                    .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6777                    .dwattr $C$DW$436, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6778                    .dwattr $C$DW$436, DW_AT_decl_line(0x31)
    6779                    .dwattr $C$DW$436, DW_AT_decl_column(0x0e)
    6780            
    6781            $C$DW$437       .dwtag  DW_TAG_member
    6782                    .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$43)
    6783                    .dwattr $C$DW$437, DW_AT_name("desiredSpiClock")
    6784                    .dwattr $C$DW$437, DW_AT_TI_symbol_name("desiredSpiClock")
    6785                    .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6786                    .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6787                    .dwattr $C$DW$437, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6788                    .dwattr $C$DW$437, DW_AT_decl_line(0x33)
    6789                    .dwattr $C$DW$437, DW_AT_decl_column(0x0e)
    6790            
    6791                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6792                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
loadfollow.asm                                                       PAGE  142

    6793                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    6794                    .dwendtag $C$DW$T$44
    6795            
    6796            $C$DW$T$76      .dwtag  DW_TAG_typedef
    6797                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    6798                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    6799                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6800                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6801                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    6802                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    6803            
    6804            
    6805            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6806                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    6807                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    6808            $C$DW$438       .dwtag  DW_TAG_member
    6809                    .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    6810                    .dwattr $C$DW$438, DW_AT_name("selectClockSource")
    6811                    .dwattr $C$DW$438, DW_AT_TI_symbol_name("selectClockSource")
    6812                    .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6813                    .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6814                    .dwattr $C$DW$438, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6815                    .dwattr $C$DW$438, DW_AT_decl_line(0x14)
    6816                    .dwattr $C$DW$438, DW_AT_decl_column(0x0d)
    6817            
    6818            $C$DW$439       .dwtag  DW_TAG_member
    6819                    .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$43)
    6820                    .dwattr $C$DW$439, DW_AT_name("clockSourceFrequency")
    6821                    .dwattr $C$DW$439, DW_AT_TI_symbol_name("clockSourceFrequency")
    6822                    .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6823                    .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6824                    .dwattr $C$DW$439, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6825                    .dwattr $C$DW$439, DW_AT_decl_line(0x16)
    6826                    .dwattr $C$DW$439, DW_AT_decl_column(0x0e)
    6827            
    6828            $C$DW$440       .dwtag  DW_TAG_member
    6829                    .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$43)
    6830                    .dwattr $C$DW$440, DW_AT_name("desiredSpiClock")
    6831                    .dwattr $C$DW$440, DW_AT_TI_symbol_name("desiredSpiClock")
    6832                    .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6833                    .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6834                    .dwattr $C$DW$440, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6835                    .dwattr $C$DW$440, DW_AT_decl_line(0x18)
    6836                    .dwattr $C$DW$440, DW_AT_decl_column(0x0e)
    6837            
    6838            $C$DW$441       .dwtag  DW_TAG_member
    6839                    .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    6840                    .dwattr $C$DW$441, DW_AT_name("msbFirst")
    6841                    .dwattr $C$DW$441, DW_AT_TI_symbol_name("msbFirst")
    6842                    .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6843                    .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6844                    .dwattr $C$DW$441, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6845                    .dwattr $C$DW$441, DW_AT_decl_line(0x1d)
    6846                    .dwattr $C$DW$441, DW_AT_decl_column(0x0d)
    6847            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
