MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 14:11:49 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Main.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("WDTCTL")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("WDTCTL")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$116)

Main.asm                                                             PAGE   76

    4039                    .dwattr $C$DW$240, DW_AT_name("crc2")
    4040                    .dwattr $C$DW$240, DW_AT_const_value(0x06)
    4041                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4042                    .dwattr $C$DW$240, DW_AT_decl_line(0x76)
    4043                    .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    4044            
    4045            $C$DW$241       .dwtag  DW_TAG_enumerator
    4046                    .dwattr $C$DW$241, DW_AT_name("ack")
    4047                    .dwattr $C$DW$241, DW_AT_const_value(0x07)
    4048                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4049                    .dwattr $C$DW$241, DW_AT_decl_line(0x77)
    4050                    .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    4051            
    4052            $C$DW$242       .dwtag  DW_TAG_enumerator
    4053                    .dwattr $C$DW$242, DW_AT_name("var")
    4054                    .dwattr $C$DW$242, DW_AT_const_value(0x08)
    4055                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4056                    .dwattr $C$DW$242, DW_AT_decl_line(0x78)
    4057                    .dwattr $C$DW$242, DW_AT_decl_column(0x05)
    4058            
    4059            $C$DW$243       .dwtag  DW_TAG_enumerator
    4060                    .dwattr $C$DW$243, DW_AT_name("UGmsg")
    4061                    .dwattr $C$DW$243, DW_AT_const_value(0x09)
    4062                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4063                    .dwattr $C$DW$243, DW_AT_decl_line(0x79)
    4064                    .dwattr $C$DW$243, DW_AT_decl_column(0x05)
    4065            
    4066                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4067                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    4068                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    4069                    .dwendtag $C$DW$T$57
    4070            
    4071            $C$DW$T$58      .dwtag  DW_TAG_typedef
    4072                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    4073                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4074                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4075                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4076                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    4077                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4078            
    4079            
    4080            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    4081                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    4082            $C$DW$244       .dwtag  DW_TAG_enumerator
    4083                    .dwattr $C$DW$244, DW_AT_name("init")
    4084                    .dwattr $C$DW$244, DW_AT_const_value(0x00)
    4085                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4086                    .dwattr $C$DW$244, DW_AT_decl_line(0x80)
    4087                    .dwattr $C$DW$244, DW_AT_decl_column(0x05)
    4088            
    4089            $C$DW$245       .dwtag  DW_TAG_enumerator
    4090                    .dwattr $C$DW$245, DW_AT_name("running")
    4091                    .dwattr $C$DW$245, DW_AT_const_value(0x01)
    4092                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4093                    .dwattr $C$DW$245, DW_AT_decl_line(0x80)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   77

    4094                    .dwattr $C$DW$245, DW_AT_decl_column(0x0b)
    4095            
    4096            $C$DW$246       .dwtag  DW_TAG_enumerator
    4097                    .dwattr $C$DW$246, DW_AT_name("wait")
    4098                    .dwattr $C$DW$246, DW_AT_const_value(0x02)
    4099                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4100                    .dwattr $C$DW$246, DW_AT_decl_line(0x80)
    4101                    .dwattr $C$DW$246, DW_AT_decl_column(0x14)
    4102            
    4103                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4104                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    4105                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4106                    .dwendtag $C$DW$T$59
    4107            
    4108            $C$DW$T$60      .dwtag  DW_TAG_typedef
    4109                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    4110                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4111                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4112                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4113                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    4114                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    4115            
    4116            
    4117            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4118                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4119            $C$DW$247       .dwtag  DW_TAG_member
    4120                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$14)
    4121                    .dwattr $C$DW$247, DW_AT_name("__max_align1")
    4122                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("__max_align1")
    4123                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4124                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4125                    .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4126                    .dwattr $C$DW$247, DW_AT_decl_line(0x7b)
    4127                    .dwattr $C$DW$247, DW_AT_decl_column(0x0c)
    4128            
    4129            $C$DW$248       .dwtag  DW_TAG_member
    4130                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$18)
    4131                    .dwattr $C$DW$248, DW_AT_name("__max_align2")
    4132                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("__max_align2")
    4133                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4134                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4135                    .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4136                    .dwattr $C$DW$248, DW_AT_decl_line(0x7c)
    4137                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4138            
    4139                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4140                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    4141                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4142                    .dwendtag $C$DW$T$22
    4143            
    4144            $C$DW$T$61      .dwtag  DW_TAG_typedef
    4145                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    4146                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    4147                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4148                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   78

    4149                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    4150                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    4151            
    4152            
    4153            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4154                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    4155                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    4156            $C$DW$249       .dwtag  DW_TAG_member
    4157                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$24)
    4158                    .dwattr $C$DW$249, DW_AT_name("memoryBufferControlIndex")
    4159                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    4160                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4161                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4162                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4163                    .dwattr $C$DW$249, DW_AT_decl_line(0x27)
    4164                    .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    4165            
    4166            $C$DW$250       .dwtag  DW_TAG_member
    4167                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$24)
    4168                    .dwattr $C$DW$250, DW_AT_name("inputSourceSelect")
    4169                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("inputSourceSelect")
    4170                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4171                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4172                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4173                    .dwattr $C$DW$250, DW_AT_decl_line(0x3b)
    4174                    .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    4175            
    4176            $C$DW$251       .dwtag  DW_TAG_member
    4177                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    4178                    .dwattr $C$DW$251, DW_AT_name("positiveRefVoltageSourceSelect")
    4179                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    4180                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4181                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4182                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4183                    .dwattr $C$DW$251, DW_AT_decl_line(0x42)
    4184                    .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
    4185            
    4186            $C$DW$252       .dwtag  DW_TAG_member
    4187                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    4188                    .dwattr $C$DW$252, DW_AT_name("negativeRefVoltageSourceSelect")
    4189                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    4190                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4191                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4192                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4193                    .dwattr $C$DW$252, DW_AT_decl_line(0x48)
    4194                    .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
    4195            
    4196            $C$DW$253       .dwtag  DW_TAG_member
    4197                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    4198                    .dwattr $C$DW$253, DW_AT_name("endOfSequence")
    4199                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("endOfSequence")
    4200                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4201                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4202                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4203                    .dwattr $C$DW$253, DW_AT_decl_line(0x51)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   79

    4204                    .dwattr $C$DW$253, DW_AT_decl_column(0x0d)
    4205            
    4206                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4207                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    4208                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4209                    .dwendtag $C$DW$T$25
    4210            
    4211            $C$DW$T$62      .dwtag  DW_TAG_typedef
    4212                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    4213                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    4214                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4215                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4216                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    4217                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    4218            
    4219            
    4220            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4221                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    4222                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    4223            $C$DW$254       .dwtag  DW_TAG_member
    4224                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4225                    .dwattr $C$DW$254, DW_AT_name("captureRegister")
    4226                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("captureRegister")
    4227                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4228                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4229                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4230                    .dwattr $C$DW$254, DW_AT_decl_line(0x58)
    4231                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4232            
    4233            $C$DW$255       .dwtag  DW_TAG_member
    4234                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4235                    .dwattr $C$DW$255, DW_AT_name("captureMode")
    4236                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("captureMode")
    4237                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4238                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4239                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4240                    .dwattr $C$DW$255, DW_AT_decl_line(0x5f)
    4241                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4242            
    4243            $C$DW$256       .dwtag  DW_TAG_member
    4244                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4245                    .dwattr $C$DW$256, DW_AT_name("captureInputSelect")
    4246                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("captureInputSelect")
    4247                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4248                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4249                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4250                    .dwattr $C$DW$256, DW_AT_decl_line(0x66)
    4251                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4252            
    4253            $C$DW$257       .dwtag  DW_TAG_member
    4254                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4255                    .dwattr $C$DW$257, DW_AT_name("synchronizeCaptureSource")
    4256                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4257                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4258                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   80

    4259                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4260                    .dwattr $C$DW$257, DW_AT_decl_line(0x6b)
    4261                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4262            
    4263            $C$DW$258       .dwtag  DW_TAG_member
    4264                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    4265                    .dwattr $C$DW$258, DW_AT_name("captureInterruptEnable")
    4266                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("captureInterruptEnable")
    4267                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4268                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4269                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4270                    .dwattr $C$DW$258, DW_AT_decl_line(0x70)
    4271                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    4272            
    4273            $C$DW$259       .dwtag  DW_TAG_member
    4274                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    4275                    .dwattr $C$DW$259, DW_AT_name("captureOutputMode")
    4276                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("captureOutputMode")
    4277                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4278                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4279                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4280                    .dwattr $C$DW$259, DW_AT_decl_line(0x7b)
    4281                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4282            
    4283                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4284                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    4285                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4286                    .dwendtag $C$DW$T$28
    4287            
    4288            $C$DW$T$63      .dwtag  DW_TAG_typedef
    4289                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    4290                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    4291                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4292                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4293                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    4294                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    4295            
    4296            
    4297            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4298                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    4299                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4300            $C$DW$260       .dwtag  DW_TAG_member
    4301                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    4302                    .dwattr $C$DW$260, DW_AT_name("compareRegister")
    4303                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("compareRegister")
    4304                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4305                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4306                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4307                    .dwattr $C$DW$260, DW_AT_decl_line(0x145)
    4308                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    4309            
    4310            $C$DW$261       .dwtag  DW_TAG_member
    4311                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    4312                    .dwattr $C$DW$261, DW_AT_name("compareInterruptEnable")
    4313                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("compareInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   81

    4314                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4315                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4316                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4317                    .dwattr $C$DW$261, DW_AT_decl_line(0x14a)
    4318                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    4319            
    4320            $C$DW$262       .dwtag  DW_TAG_member
    4321                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    4322                    .dwattr $C$DW$262, DW_AT_name("compareOutputMode")
    4323                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("compareOutputMode")
    4324                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4325                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4326                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4327                    .dwattr $C$DW$262, DW_AT_decl_line(0x155)
    4328                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    4329            
    4330            $C$DW$263       .dwtag  DW_TAG_member
    4331                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    4332                    .dwattr $C$DW$263, DW_AT_name("compareValue")
    4333                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("compareValue")
    4334                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4335                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4336                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4337                    .dwattr $C$DW$263, DW_AT_decl_line(0x157)
    4338                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    4339            
    4340                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4341                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4342                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4343                    .dwendtag $C$DW$T$29
    4344            
    4345            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4346                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4347                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4348                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4349                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4350                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4351                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    4352            
    4353            
    4354            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4355                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    4356                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4357            $C$DW$264       .dwtag  DW_TAG_member
    4358                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    4359                    .dwattr $C$DW$264, DW_AT_name("clockSource")
    4360                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("clockSource")
    4361                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4362                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4363                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4364                    .dwattr $C$DW$264, DW_AT_decl_line(0x20)
    4365                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    4366            
    4367            $C$DW$265       .dwtag  DW_TAG_member
    4368                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   82

    4369                    .dwattr $C$DW$265, DW_AT_name("clockSourceDivider")
    4370                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("clockSourceDivider")
    4371                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4372                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4373                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4374                    .dwattr $C$DW$265, DW_AT_decl_line(0x37)
    4375                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    4376            
    4377            $C$DW$266       .dwtag  DW_TAG_member
    4378                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    4379                    .dwattr $C$DW$266, DW_AT_name("timerInterruptEnable_TAIE")
    4380                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4381                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4382                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4383                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4384                    .dwattr $C$DW$266, DW_AT_decl_line(0x3c)
    4385                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    4386            
    4387            $C$DW$267       .dwtag  DW_TAG_member
    4388                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    4389                    .dwattr $C$DW$267, DW_AT_name("timerClear")
    4390                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("timerClear")
    4391                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4392                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4393                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4394                    .dwattr $C$DW$267, DW_AT_decl_line(0x42)
    4395                    .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    4396            
    4397            $C$DW$268       .dwtag  DW_TAG_member
    4398                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$30)
    4399                    .dwattr $C$DW$268, DW_AT_name("startTimer")
    4400                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("startTimer")
    4401                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4402                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4403                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4404                    .dwattr $C$DW$268, DW_AT_decl_line(0x44)
    4405                    .dwattr $C$DW$268, DW_AT_decl_column(0x0a)
    4406            
    4407                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4408                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    4409                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4410                    .dwendtag $C$DW$T$31
    4411            
    4412            $C$DW$T$65      .dwtag  DW_TAG_typedef
    4413                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    4414                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    4415                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4416                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4417                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    4418                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4419            
    4420            
    4421            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4422                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    4423                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   83

    4424            $C$DW$269       .dwtag  DW_TAG_member
    4425                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    4426                    .dwattr $C$DW$269, DW_AT_name("clockSource")
    4427                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("clockSource")
    4428                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4429                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4430                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4431                    .dwattr $C$DW$269, DW_AT_decl_line(0x8b)
    4432                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    4433            
    4434            $C$DW$270       .dwtag  DW_TAG_member
    4435                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    4436                    .dwattr $C$DW$270, DW_AT_name("clockSourceDivider")
    4437                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("clockSourceDivider")
    4438                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4439                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4440                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4441                    .dwattr $C$DW$270, DW_AT_decl_line(0xa2)
    4442                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
    4443            
    4444            $C$DW$271       .dwtag  DW_TAG_member
    4445                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    4446                    .dwattr $C$DW$271, DW_AT_name("timerPeriod")
    4447                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("timerPeriod")
    4448                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4449                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4450                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4451                    .dwattr $C$DW$271, DW_AT_decl_line(0xa4)
    4452                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    4453            
    4454            $C$DW$272       .dwtag  DW_TAG_member
    4455                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    4456                    .dwattr $C$DW$272, DW_AT_name("timerInterruptEnable_TAIE")
    4457                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4458                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4459                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4460                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4461                    .dwattr $C$DW$272, DW_AT_decl_line(0xa9)
    4462                    .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
    4463            
    4464            $C$DW$273       .dwtag  DW_TAG_member
    4465                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    4466                    .dwattr $C$DW$273, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4467                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4468                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4469                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4470                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4471                    .dwattr $C$DW$273, DW_AT_decl_line(0xae)
    4472                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    4473            
    4474            $C$DW$274       .dwtag  DW_TAG_member
    4475                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    4476                    .dwattr $C$DW$274, DW_AT_name("timerClear")
    4477                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("timerClear")
    4478                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   84

    4479                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4480                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4481                    .dwattr $C$DW$274, DW_AT_decl_line(0xb4)
    4482                    .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    4483            
    4484            $C$DW$275       .dwtag  DW_TAG_member
    4485                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$30)
    4486                    .dwattr $C$DW$275, DW_AT_name("startTimer")
    4487                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("startTimer")
    4488                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4489                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4490                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4491                    .dwattr $C$DW$275, DW_AT_decl_line(0xb6)
    4492                    .dwattr $C$DW$275, DW_AT_decl_column(0x0a)
    4493            
    4494                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4495                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    4496                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4497                    .dwendtag $C$DW$T$32
    4498            
    4499            $C$DW$T$66      .dwtag  DW_TAG_typedef
    4500                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    4501                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    4502                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4503                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4504                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    4505                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    4506            
    4507            
    4508            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4509                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    4510                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    4511            $C$DW$276       .dwtag  DW_TAG_member
    4512                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    4513                    .dwattr $C$DW$276, DW_AT_name("clockSource")
    4514                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("clockSource")
    4515                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4516                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4517                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4518                    .dwattr $C$DW$276, DW_AT_decl_line(0x105)
    4519                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    4520            
    4521            $C$DW$277       .dwtag  DW_TAG_member
    4522                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    4523                    .dwattr $C$DW$277, DW_AT_name("clockSourceDivider")
    4524                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("clockSourceDivider")
    4525                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4526                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4527                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4528                    .dwattr $C$DW$277, DW_AT_decl_line(0x11c)
    4529                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    4530            
    4531            $C$DW$278       .dwtag  DW_TAG_member
    4532                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    4533                    .dwattr $C$DW$278, DW_AT_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   85

    4534                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("timerPeriod")
    4535                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4536                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4537                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4538                    .dwattr $C$DW$278, DW_AT_decl_line(0x11f)
    4539                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    4540            
    4541            $C$DW$279       .dwtag  DW_TAG_member
    4542                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    4543                    .dwattr $C$DW$279, DW_AT_name("timerInterruptEnable_TAIE")
    4544                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4545                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4546                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4547                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4548                    .dwattr $C$DW$279, DW_AT_decl_line(0x124)
    4549                    .dwattr $C$DW$279, DW_AT_decl_column(0x0e)
    4550            
    4551            $C$DW$280       .dwtag  DW_TAG_member
    4552                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    4553                    .dwattr $C$DW$280, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4554                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4555                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4556                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4557                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4558                    .dwattr $C$DW$280, DW_AT_decl_line(0x129)
    4559                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    4560            
    4561            $C$DW$281       .dwtag  DW_TAG_member
    4562                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    4563                    .dwattr $C$DW$281, DW_AT_name("timerClear")
    4564                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("timerClear")
    4565                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4566                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4567                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4568                    .dwattr $C$DW$281, DW_AT_decl_line(0x12f)
    4569                    .dwattr $C$DW$281, DW_AT_decl_column(0x0e)
    4570            
    4571            $C$DW$282       .dwtag  DW_TAG_member
    4572                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$30)
    4573                    .dwattr $C$DW$282, DW_AT_name("startTimer")
    4574                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("startTimer")
    4575                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4576                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4577                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4578                    .dwattr $C$DW$282, DW_AT_decl_line(0x131)
    4579                    .dwattr $C$DW$282, DW_AT_decl_column(0x0a)
    4580            
    4581                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4582                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    4583                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4584                    .dwendtag $C$DW$T$33
    4585            
    4586            $C$DW$T$67      .dwtag  DW_TAG_typedef
    4587                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    4588                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   86

    4589                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4590                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4591                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    4592                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    4593            
    4594            
    4595            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4596                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    4597                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    4598            $C$DW$283       .dwtag  DW_TAG_member
    4599                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    4600                    .dwattr $C$DW$283, DW_AT_name("clockSource")
    4601                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("clockSource")
    4602                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4603                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4604                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4605                    .dwattr $C$DW$283, DW_AT_decl_line(0xc5)
    4606                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    4607            
    4608            $C$DW$284       .dwtag  DW_TAG_member
    4609                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    4610                    .dwattr $C$DW$284, DW_AT_name("clockSourceDivider")
    4611                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("clockSourceDivider")
    4612                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4613                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4614                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4615                    .dwattr $C$DW$284, DW_AT_decl_line(0xdc)
    4616                    .dwattr $C$DW$284, DW_AT_decl_column(0x0e)
    4617            
    4618            $C$DW$285       .dwtag  DW_TAG_member
    4619                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    4620                    .dwattr $C$DW$285, DW_AT_name("timerPeriod")
    4621                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("timerPeriod")
    4622                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4623                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4624                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4625                    .dwattr $C$DW$285, DW_AT_decl_line(0xde)
    4626                    .dwattr $C$DW$285, DW_AT_decl_column(0x0e)
    4627            
    4628            $C$DW$286       .dwtag  DW_TAG_member
    4629                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    4630                    .dwattr $C$DW$286, DW_AT_name("compareRegister")
    4631                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("compareRegister")
    4632                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4633                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4634                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4635                    .dwattr $C$DW$286, DW_AT_decl_line(0xe9)
    4636                    .dwattr $C$DW$286, DW_AT_decl_column(0x0e)
    4637            
    4638            $C$DW$287       .dwtag  DW_TAG_member
    4639                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    4640                    .dwattr $C$DW$287, DW_AT_name("compareOutputMode")
    4641                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("compareOutputMode")
    4642                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4643                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   87

    4644                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4645                    .dwattr $C$DW$287, DW_AT_decl_line(0xf4)
    4646                    .dwattr $C$DW$287, DW_AT_decl_column(0x0e)
    4647            
    4648            $C$DW$288       .dwtag  DW_TAG_member
    4649                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
    4650                    .dwattr $C$DW$288, DW_AT_name("dutyCycle")
    4651                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("dutyCycle")
    4652                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4653                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4654                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4655                    .dwattr $C$DW$288, DW_AT_decl_line(0xf6)
    4656                    .dwattr $C$DW$288, DW_AT_decl_column(0x0e)
    4657            
    4658                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4659                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    4660                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4661                    .dwendtag $C$DW$T$34
    4662            
    4663            $C$DW$T$68      .dwtag  DW_TAG_typedef
    4664                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    4665                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    4666                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4667                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4668                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    4669                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    4670            
    4671            
    4672            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4673                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    4674                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    4675            $C$DW$289       .dwtag  DW_TAG_member
    4676                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    4677                    .dwattr $C$DW$289, DW_AT_name("captureRegister")
    4678                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("captureRegister")
    4679                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4680                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4681                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4682                    .dwattr $C$DW$289, DW_AT_decl_line(0xa0)
    4683                    .dwattr $C$DW$289, DW_AT_decl_column(0x0e)
    4684            
    4685            $C$DW$290       .dwtag  DW_TAG_member
    4686                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$27)
    4687                    .dwattr $C$DW$290, DW_AT_name("captureMode")
    4688                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("captureMode")
    4689                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4690                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4691                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4692                    .dwattr $C$DW$290, DW_AT_decl_line(0xa7)
    4693                    .dwattr $C$DW$290, DW_AT_decl_column(0x0e)
    4694            
    4695            $C$DW$291       .dwtag  DW_TAG_member
    4696                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$27)
    4697                    .dwattr $C$DW$291, DW_AT_name("captureInputSelect")
    4698                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("captureInputSelect")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   88

    4699                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4700                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4701                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4702                    .dwattr $C$DW$291, DW_AT_decl_line(0xae)
    4703                    .dwattr $C$DW$291, DW_AT_decl_column(0x0e)
    4704            
    4705            $C$DW$292       .dwtag  DW_TAG_member
    4706                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
    4707                    .dwattr $C$DW$292, DW_AT_name("synchronizeCaptureSource")
    4708                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4709                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4710                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4711                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4712                    .dwattr $C$DW$292, DW_AT_decl_line(0xb3)
    4713                    .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    4714            
    4715            $C$DW$293       .dwtag  DW_TAG_member
    4716                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$27)
    4717                    .dwattr $C$DW$293, DW_AT_name("captureInterruptEnable")
    4718                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("captureInterruptEnable")
    4719                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4720                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4721                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4722                    .dwattr $C$DW$293, DW_AT_decl_line(0xb8)
    4723                    .dwattr $C$DW$293, DW_AT_decl_column(0x0e)
    4724            
    4725            $C$DW$294       .dwtag  DW_TAG_member
    4726                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$27)
    4727                    .dwattr $C$DW$294, DW_AT_name("captureOutputMode")
    4728                    .dwattr $C$DW$294, DW_AT_TI_symbol_name("captureOutputMode")
    4729                    .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4730                    .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4731                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4732                    .dwattr $C$DW$294, DW_AT_decl_line(0xc3)
    4733                    .dwattr $C$DW$294, DW_AT_decl_column(0x0e)
    4734            
    4735                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4736                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    4737                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4738                    .dwendtag $C$DW$T$35
    4739            
    4740            $C$DW$T$69      .dwtag  DW_TAG_typedef
    4741                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4742                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4743                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4744                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4745                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4746                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4747            
    4748            
    4749            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4750                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4751                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4752            $C$DW$295       .dwtag  DW_TAG_member
    4753                    .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   89

    4754                    .dwattr $C$DW$295, DW_AT_name("compareRegister")
    4755                    .dwattr $C$DW$295, DW_AT_TI_symbol_name("compareRegister")
    4756                    .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4757                    .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4758                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4759                    .dwattr $C$DW$295, DW_AT_decl_line(0x146)
    4760                    .dwattr $C$DW$295, DW_AT_decl_column(0x0e)
    4761            
    4762            $C$DW$296       .dwtag  DW_TAG_member
    4763                    .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$27)
    4764                    .dwattr $C$DW$296, DW_AT_name("compareInterruptEnable")
    4765                    .dwattr $C$DW$296, DW_AT_TI_symbol_name("compareInterruptEnable")
    4766                    .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4767                    .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4768                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4769                    .dwattr $C$DW$296, DW_AT_decl_line(0x14b)
    4770                    .dwattr $C$DW$296, DW_AT_decl_column(0x0e)
    4771            
    4772            $C$DW$297       .dwtag  DW_TAG_member
    4773                    .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$27)
    4774                    .dwattr $C$DW$297, DW_AT_name("compareOutputMode")
    4775                    .dwattr $C$DW$297, DW_AT_TI_symbol_name("compareOutputMode")
    4776                    .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4777                    .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4778                    .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4779                    .dwattr $C$DW$297, DW_AT_decl_line(0x156)
    4780                    .dwattr $C$DW$297, DW_AT_decl_column(0x0e)
    4781            
    4782            $C$DW$298       .dwtag  DW_TAG_member
    4783                    .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$27)
    4784                    .dwattr $C$DW$298, DW_AT_name("compareValue")
    4785                    .dwattr $C$DW$298, DW_AT_TI_symbol_name("compareValue")
    4786                    .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4787                    .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4788                    .dwattr $C$DW$298, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4789                    .dwattr $C$DW$298, DW_AT_decl_line(0x158)
    4790                    .dwattr $C$DW$298, DW_AT_decl_column(0x0e)
    4791            
    4792                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4793                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4794                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4795                    .dwendtag $C$DW$T$36
    4796            
    4797            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4798                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4799                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    4800                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4801                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4802                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4803                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4804            
    4805            
    4806            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4807                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4808                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   90

    4809            $C$DW$299       .dwtag  DW_TAG_member
    4810                    .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$27)
    4811                    .dwattr $C$DW$299, DW_AT_name("clockSource")
    4812                    .dwattr $C$DW$299, DW_AT_TI_symbol_name("clockSource")
    4813                    .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4814                    .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4815                    .dwattr $C$DW$299, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4816                    .dwattr $C$DW$299, DW_AT_decl_line(0xd3)
    4817                    .dwattr $C$DW$299, DW_AT_decl_column(0x0e)
    4818            
    4819            $C$DW$300       .dwtag  DW_TAG_member
    4820                    .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$27)
    4821                    .dwattr $C$DW$300, DW_AT_name("clockSourceDivider")
    4822                    .dwattr $C$DW$300, DW_AT_TI_symbol_name("clockSourceDivider")
    4823                    .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4824                    .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4825                    .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4826                    .dwattr $C$DW$300, DW_AT_decl_line(0xea)
    4827                    .dwattr $C$DW$300, DW_AT_decl_column(0x0e)
    4828            
    4829            $C$DW$301       .dwtag  DW_TAG_member
    4830                    .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$27)
    4831                    .dwattr $C$DW$301, DW_AT_name("timerInterruptEnable_TBIE")
    4832                    .dwattr $C$DW$301, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4833                    .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4834                    .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4835                    .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4836                    .dwattr $C$DW$301, DW_AT_decl_line(0xef)
    4837                    .dwattr $C$DW$301, DW_AT_decl_column(0x0e)
    4838            
    4839            $C$DW$302       .dwtag  DW_TAG_member
    4840                    .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$27)
    4841                    .dwattr $C$DW$302, DW_AT_name("timerClear")
    4842                    .dwattr $C$DW$302, DW_AT_TI_symbol_name("timerClear")
    4843                    .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4844                    .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4845                    .dwattr $C$DW$302, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4846                    .dwattr $C$DW$302, DW_AT_decl_line(0xf5)
    4847                    .dwattr $C$DW$302, DW_AT_decl_column(0x0e)
    4848            
    4849            $C$DW$303       .dwtag  DW_TAG_member
    4850                    .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$30)
    4851                    .dwattr $C$DW$303, DW_AT_name("startTimer")
    4852                    .dwattr $C$DW$303, DW_AT_TI_symbol_name("startTimer")
    4853                    .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4854                    .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4855                    .dwattr $C$DW$303, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4856                    .dwattr $C$DW$303, DW_AT_decl_line(0xf7)
    4857                    .dwattr $C$DW$303, DW_AT_decl_column(0x0a)
    4858            
    4859                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4860                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4861                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4862                    .dwendtag $C$DW$T$37
    4863            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   91

    4864            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4865                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4866                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4867                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4868                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4869                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4870                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4871            
    4872            
    4873            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4874                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4875                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4876            $C$DW$304       .dwtag  DW_TAG_member
    4877                    .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$27)
    4878                    .dwattr $C$DW$304, DW_AT_name("clockSource")
    4879                    .dwattr $C$DW$304, DW_AT_TI_symbol_name("clockSource")
    4880                    .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4881                    .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4882                    .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4883                    .dwattr $C$DW$304, DW_AT_decl_line(0x107)
    4884                    .dwattr $C$DW$304, DW_AT_decl_column(0x0e)
    4885            
    4886            $C$DW$305       .dwtag  DW_TAG_member
    4887                    .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$27)
    4888                    .dwattr $C$DW$305, DW_AT_name("clockSourceDivider")
    4889                    .dwattr $C$DW$305, DW_AT_TI_symbol_name("clockSourceDivider")
    4890                    .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4891                    .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4892                    .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4893                    .dwattr $C$DW$305, DW_AT_decl_line(0x11e)
    4894                    .dwattr $C$DW$305, DW_AT_decl_column(0x0e)
    4895            
    4896            $C$DW$306       .dwtag  DW_TAG_member
    4897                    .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$27)
    4898                    .dwattr $C$DW$306, DW_AT_name("timerPeriod")
    4899                    .dwattr $C$DW$306, DW_AT_TI_symbol_name("timerPeriod")
    4900                    .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4901                    .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4902                    .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4903                    .dwattr $C$DW$306, DW_AT_decl_line(0x120)
    4904                    .dwattr $C$DW$306, DW_AT_decl_column(0x0e)
    4905            
    4906            $C$DW$307       .dwtag  DW_TAG_member
    4907                    .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$27)
    4908                    .dwattr $C$DW$307, DW_AT_name("timerInterruptEnable_TBIE")
    4909                    .dwattr $C$DW$307, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4910                    .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4911                    .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4912                    .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4913                    .dwattr $C$DW$307, DW_AT_decl_line(0x125)
    4914                    .dwattr $C$DW$307, DW_AT_decl_column(0x0e)
    4915            
    4916            $C$DW$308       .dwtag  DW_TAG_member
    4917                    .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$27)
    4918                    .dwattr $C$DW$308, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   92

    4919                    .dwattr $C$DW$308, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4920                    .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4921                    .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4922                    .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4923                    .dwattr $C$DW$308, DW_AT_decl_line(0x12a)
    4924                    .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    4925            
    4926            $C$DW$309       .dwtag  DW_TAG_member
    4927                    .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$27)
    4928                    .dwattr $C$DW$309, DW_AT_name("timerClear")
    4929                    .dwattr $C$DW$309, DW_AT_TI_symbol_name("timerClear")
    4930                    .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4931                    .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4932                    .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4933                    .dwattr $C$DW$309, DW_AT_decl_line(0x130)
    4934                    .dwattr $C$DW$309, DW_AT_decl_column(0x0e)
    4935            
    4936            $C$DW$310       .dwtag  DW_TAG_member
    4937                    .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$30)
    4938                    .dwattr $C$DW$310, DW_AT_name("startTimer")
    4939                    .dwattr $C$DW$310, DW_AT_TI_symbol_name("startTimer")
    4940                    .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4941                    .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4942                    .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4943                    .dwattr $C$DW$310, DW_AT_decl_line(0x132)
    4944                    .dwattr $C$DW$310, DW_AT_decl_column(0x0a)
    4945            
    4946                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4947                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4948                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4949                    .dwendtag $C$DW$T$38
    4950            
    4951            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4952                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4953                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4954                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4955                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4956                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4957                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4958            
    4959            
    4960            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4961                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4962                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4963            $C$DW$311       .dwtag  DW_TAG_member
    4964                    .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$27)
    4965                    .dwattr $C$DW$311, DW_AT_name("clockSource")
    4966                    .dwattr $C$DW$311, DW_AT_TI_symbol_name("clockSource")
    4967                    .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4968                    .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4969                    .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4970                    .dwattr $C$DW$311, DW_AT_decl_line(0x60)
    4971                    .dwattr $C$DW$311, DW_AT_decl_column(0x0e)
    4972            
    4973            $C$DW$312       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   93

    4974                    .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    4975                    .dwattr $C$DW$312, DW_AT_name("clockSourceDivider")
    4976                    .dwattr $C$DW$312, DW_AT_TI_symbol_name("clockSourceDivider")
    4977                    .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4978                    .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4979                    .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4980                    .dwattr $C$DW$312, DW_AT_decl_line(0x77)
    4981                    .dwattr $C$DW$312, DW_AT_decl_column(0x0e)
    4982            
    4983            $C$DW$313       .dwtag  DW_TAG_member
    4984                    .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$27)
    4985                    .dwattr $C$DW$313, DW_AT_name("timerPeriod")
    4986                    .dwattr $C$DW$313, DW_AT_TI_symbol_name("timerPeriod")
    4987                    .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4988                    .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4989                    .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4990                    .dwattr $C$DW$313, DW_AT_decl_line(0x7a)
    4991                    .dwattr $C$DW$313, DW_AT_decl_column(0x0e)
    4992            
    4993            $C$DW$314       .dwtag  DW_TAG_member
    4994                    .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$27)
    4995                    .dwattr $C$DW$314, DW_AT_name("timerInterruptEnable_TBIE")
    4996                    .dwattr $C$DW$314, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4997                    .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4998                    .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4999                    .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5000                    .dwattr $C$DW$314, DW_AT_decl_line(0x7f)
    5001                    .dwattr $C$DW$314, DW_AT_decl_column(0x0e)
    5002            
    5003            $C$DW$315       .dwtag  DW_TAG_member
    5004                    .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$27)
    5005                    .dwattr $C$DW$315, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5006                    .dwattr $C$DW$315, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5007                    .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5008                    .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5009                    .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5010                    .dwattr $C$DW$315, DW_AT_decl_line(0x84)
    5011                    .dwattr $C$DW$315, DW_AT_decl_column(0x0e)
    5012            
    5013            $C$DW$316       .dwtag  DW_TAG_member
    5014                    .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$27)
    5015                    .dwattr $C$DW$316, DW_AT_name("timerClear")
    5016                    .dwattr $C$DW$316, DW_AT_TI_symbol_name("timerClear")
    5017                    .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5018                    .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5019                    .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5020                    .dwattr $C$DW$316, DW_AT_decl_line(0x8a)
    5021                    .dwattr $C$DW$316, DW_AT_decl_column(0x0e)
    5022            
    5023            $C$DW$317       .dwtag  DW_TAG_member
    5024                    .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$30)
    5025                    .dwattr $C$DW$317, DW_AT_name("startTimer")
    5026                    .dwattr $C$DW$317, DW_AT_TI_symbol_name("startTimer")
    5027                    .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5028                    .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   94

    5029                    .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5030                    .dwattr $C$DW$317, DW_AT_decl_line(0x8c)
    5031                    .dwattr $C$DW$317, DW_AT_decl_column(0x0a)
    5032            
    5033                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5034                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    5035                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    5036                    .dwendtag $C$DW$T$39
    5037            
    5038            $C$DW$T$73      .dwtag  DW_TAG_typedef
    5039                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    5040                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    5041                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5042                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5043                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    5044                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    5045            
    5046            
    5047            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5048                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    5049                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    5050            $C$DW$318       .dwtag  DW_TAG_member
    5051                    .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$27)
    5052                    .dwattr $C$DW$318, DW_AT_name("clockSource")
    5053                    .dwattr $C$DW$318, DW_AT_TI_symbol_name("clockSource")
    5054                    .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5055                    .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5056                    .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5057                    .dwattr $C$DW$318, DW_AT_decl_line(0x20)
    5058                    .dwattr $C$DW$318, DW_AT_decl_column(0x0e)
    5059            
    5060            $C$DW$319       .dwtag  DW_TAG_member
    5061                    .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$27)
    5062                    .dwattr $C$DW$319, DW_AT_name("clockSourceDivider")
    5063                    .dwattr $C$DW$319, DW_AT_TI_symbol_name("clockSourceDivider")
    5064                    .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5065                    .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5066                    .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5067                    .dwattr $C$DW$319, DW_AT_decl_line(0x37)
    5068                    .dwattr $C$DW$319, DW_AT_decl_column(0x0e)
    5069            
    5070            $C$DW$320       .dwtag  DW_TAG_member
    5071                    .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$27)
    5072                    .dwattr $C$DW$320, DW_AT_name("timerPeriod")
    5073                    .dwattr $C$DW$320, DW_AT_TI_symbol_name("timerPeriod")
    5074                    .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5075                    .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5076                    .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5077                    .dwattr $C$DW$320, DW_AT_decl_line(0x39)
    5078                    .dwattr $C$DW$320, DW_AT_decl_column(0x0e)
    5079            
    5080            $C$DW$321       .dwtag  DW_TAG_member
    5081                    .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$27)
    5082                    .dwattr $C$DW$321, DW_AT_name("compareRegister")
    5083                    .dwattr $C$DW$321, DW_AT_TI_symbol_name("compareRegister")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   95

    5084                    .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5085                    .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5086                    .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5087                    .dwattr $C$DW$321, DW_AT_decl_line(0x44)
    5088                    .dwattr $C$DW$321, DW_AT_decl_column(0x0e)
    5089            
    5090            $C$DW$322       .dwtag  DW_TAG_member
    5091                    .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    5092                    .dwattr $C$DW$322, DW_AT_name("compareOutputMode")
    5093                    .dwattr $C$DW$322, DW_AT_TI_symbol_name("compareOutputMode")
    5094                    .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5095                    .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5096                    .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5097                    .dwattr $C$DW$322, DW_AT_decl_line(0x4f)
    5098                    .dwattr $C$DW$322, DW_AT_decl_column(0x0e)
    5099            
    5100            $C$DW$323       .dwtag  DW_TAG_member
    5101                    .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    5102                    .dwattr $C$DW$323, DW_AT_name("dutyCycle")
    5103                    .dwattr $C$DW$323, DW_AT_TI_symbol_name("dutyCycle")
    5104                    .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5105                    .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5106                    .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5107                    .dwattr $C$DW$323, DW_AT_decl_line(0x51)
    5108                    .dwattr $C$DW$323, DW_AT_decl_column(0x0e)
    5109            
    5110                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5111                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    5112                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    5113                    .dwendtag $C$DW$T$40
    5114            
    5115            $C$DW$T$74      .dwtag  DW_TAG_typedef
    5116                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    5117                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    5118                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5119                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5120                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    5121                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    5122            
    5123            
    5124            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5125                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    5126                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    5127            $C$DW$324       .dwtag  DW_TAG_member
    5128                    .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$24)
    5129                    .dwattr $C$DW$324, DW_AT_name("selectClockSource")
    5130                    .dwattr $C$DW$324, DW_AT_TI_symbol_name("selectClockSource")
    5131                    .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5132                    .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5133                    .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5134                    .dwattr $C$DW$324, DW_AT_decl_line(0x1c)
    5135                    .dwattr $C$DW$324, DW_AT_decl_column(0x0d)
    5136            
    5137            $C$DW$325       .dwtag  DW_TAG_member
    5138                    .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   96

    5139                    .dwattr $C$DW$325, DW_AT_name("clockPrescalar")
    5140                    .dwattr $C$DW$325, DW_AT_TI_symbol_name("clockPrescalar")
    5141                    .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5142                    .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5143                    .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5144                    .dwattr $C$DW$325, DW_AT_decl_line(0x1e)
    5145                    .dwattr $C$DW$325, DW_AT_decl_column(0x0e)
    5146            
    5147            $C$DW$326       .dwtag  DW_TAG_member
    5148                    .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$24)
    5149                    .dwattr $C$DW$326, DW_AT_name("firstModReg")
    5150                    .dwattr $C$DW$326, DW_AT_TI_symbol_name("firstModReg")
    5151                    .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5152                    .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5153                    .dwattr $C$DW$326, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5154                    .dwattr $C$DW$326, DW_AT_decl_line(0x22)
    5155                    .dwattr $C$DW$326, DW_AT_decl_column(0x0d)
    5156            
    5157            $C$DW$327       .dwtag  DW_TAG_member
    5158                    .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$24)
    5159                    .dwattr $C$DW$327, DW_AT_name("secondModReg")
    5160                    .dwattr $C$DW$327, DW_AT_TI_symbol_name("secondModReg")
    5161                    .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5162                    .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5163                    .dwattr $C$DW$327, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5164                    .dwattr $C$DW$327, DW_AT_decl_line(0x26)
    5165                    .dwattr $C$DW$327, DW_AT_decl_column(0x0d)
    5166            
    5167            $C$DW$328       .dwtag  DW_TAG_member
    5168                    .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$24)
    5169                    .dwattr $C$DW$328, DW_AT_name("parity")
    5170                    .dwattr $C$DW$328, DW_AT_TI_symbol_name("parity")
    5171                    .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5172                    .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5173                    .dwattr $C$DW$328, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5174                    .dwattr $C$DW$328, DW_AT_decl_line(0x2c)
    5175                    .dwattr $C$DW$328, DW_AT_decl_column(0x0d)
    5176            
    5177            $C$DW$329       .dwtag  DW_TAG_member
    5178                    .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$24)
    5179                    .dwattr $C$DW$329, DW_AT_name("msborLsbFirst")
    5180                    .dwattr $C$DW$329, DW_AT_TI_symbol_name("msborLsbFirst")
    5181                    .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5182                    .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5183                    .dwattr $C$DW$329, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5184                    .dwattr $C$DW$329, DW_AT_decl_line(0x31)
    5185                    .dwattr $C$DW$329, DW_AT_decl_column(0x0d)
    5186            
    5187            $C$DW$330       .dwtag  DW_TAG_member
    5188                    .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$24)
    5189                    .dwattr $C$DW$330, DW_AT_name("numberofStopBits")
    5190                    .dwattr $C$DW$330, DW_AT_TI_symbol_name("numberofStopBits")
    5191                    .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5192                    .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5193                    .dwattr $C$DW$330, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   97

    5194                    .dwattr $C$DW$330, DW_AT_decl_line(0x36)
    5195                    .dwattr $C$DW$330, DW_AT_decl_column(0x0d)
    5196            
    5197            $C$DW$331       .dwtag  DW_TAG_member
    5198                    .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$24)
    5199                    .dwattr $C$DW$331, DW_AT_name("uartMode")
    5200                    .dwattr $C$DW$331, DW_AT_TI_symbol_name("uartMode")
    5201                    .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5202                    .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5203                    .dwattr $C$DW$331, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5204                    .dwattr $C$DW$331, DW_AT_decl_line(0x3d)
    5205                    .dwattr $C$DW$331, DW_AT_decl_column(0x0d)
    5206            
    5207            $C$DW$332       .dwtag  DW_TAG_member
    5208                    .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$24)
    5209                    .dwattr $C$DW$332, DW_AT_name("overSampling")
    5210                    .dwattr $C$DW$332, DW_AT_TI_symbol_name("overSampling")
    5211                    .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5212                    .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5213                    .dwattr $C$DW$332, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5214                    .dwattr $C$DW$332, DW_AT_decl_line(0x42)
    5215                    .dwattr $C$DW$332, DW_AT_decl_column(0x0d)
    5216            
    5217                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5218                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    5219                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5220                    .dwendtag $C$DW$T$41
    5221            
    5222            $C$DW$T$75      .dwtag  DW_TAG_typedef
    5223                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    5224                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    5225                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5226                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5227                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    5228                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    5229            
    5230            
    5231            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5232                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5233                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    5234            $C$DW$333       .dwtag  DW_TAG_member
    5235                    .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$43)
    5236                    .dwattr $C$DW$333, DW_AT_name("clockSourceFrequency")
    5237                    .dwattr $C$DW$333, DW_AT_TI_symbol_name("clockSourceFrequency")
    5238                    .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5239                    .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5240                    .dwattr $C$DW$333, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5241                    .dwattr $C$DW$333, DW_AT_decl_line(0x31)
    5242                    .dwattr $C$DW$333, DW_AT_decl_column(0x0e)
    5243            
    5244            $C$DW$334       .dwtag  DW_TAG_member
    5245                    .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$43)
    5246                    .dwattr $C$DW$334, DW_AT_name("desiredSpiClock")
    5247                    .dwattr $C$DW$334, DW_AT_TI_symbol_name("desiredSpiClock")
    5248                    .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   98

    5249                    .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5250                    .dwattr $C$DW$334, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5251                    .dwattr $C$DW$334, DW_AT_decl_line(0x33)
    5252                    .dwattr $C$DW$334, DW_AT_decl_column(0x0e)
    5253            
    5254                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5255                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    5256                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    5257                    .dwendtag $C$DW$T$44
    5258            
    5259            $C$DW$T$76      .dwtag  DW_TAG_typedef
    5260                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5261                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    5262                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5263                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5264                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    5265                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    5266            
    5267            
    5268            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5269                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    5270                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    5271            $C$DW$335       .dwtag  DW_TAG_member
    5272                    .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$24)
    5273                    .dwattr $C$DW$335, DW_AT_name("selectClockSource")
    5274                    .dwattr $C$DW$335, DW_AT_TI_symbol_name("selectClockSource")
    5275                    .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5276                    .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5277                    .dwattr $C$DW$335, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5278                    .dwattr $C$DW$335, DW_AT_decl_line(0x14)
    5279                    .dwattr $C$DW$335, DW_AT_decl_column(0x0d)
    5280            
    5281            $C$DW$336       .dwtag  DW_TAG_member
    5282                    .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$43)
    5283                    .dwattr $C$DW$336, DW_AT_name("clockSourceFrequency")
    5284                    .dwattr $C$DW$336, DW_AT_TI_symbol_name("clockSourceFrequency")
    5285                    .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5286                    .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5287                    .dwattr $C$DW$336, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5288                    .dwattr $C$DW$336, DW_AT_decl_line(0x16)
    5289                    .dwattr $C$DW$336, DW_AT_decl_column(0x0e)
    5290            
    5291            $C$DW$337       .dwtag  DW_TAG_member
    5292                    .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$43)
    5293                    .dwattr $C$DW$337, DW_AT_name("desiredSpiClock")
    5294                    .dwattr $C$DW$337, DW_AT_TI_symbol_name("desiredSpiClock")
    5295                    .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5296                    .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5297                    .dwattr $C$DW$337, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5298                    .dwattr $C$DW$337, DW_AT_decl_line(0x18)
    5299                    .dwattr $C$DW$337, DW_AT_decl_column(0x0e)
    5300            
    5301            $C$DW$338       .dwtag  DW_TAG_member
    5302                    .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$24)
    5303                    .dwattr $C$DW$338, DW_AT_name("msbFirst")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:11:49 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Main.asm                                                             PAGE   99

    5304                    .dwattr $C$DW$338, DW_AT_TI_symbol_name("msbFirst")
    5305                    .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5306                    .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5307                    .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5308                    .dwattr $C$DW$338, DW_AT_decl_line(0x1d)
    5309                    .dwattr $C$DW$338, DW_AT_decl_column(0x0d)
