MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:59:32 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Momentary_Switch.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PAIN_L")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PAIN_L")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$87)

    5111            $C$DW$237       .dwtag  DW_TAG_enumerator
    5112                    .dwattr $C$DW$237, DW_AT_name("crc2")
    5113                    .dwattr $C$DW$237, DW_AT_const_value(0x06)
    5114                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5115                    .dwattr $C$DW$237, DW_AT_decl_line(0x76)
    5116                    .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    5117            
    5118            $C$DW$238       .dwtag  DW_TAG_enumerator
    5119                    .dwattr $C$DW$238, DW_AT_name("ack")
    5120                    .dwattr $C$DW$238, DW_AT_const_value(0x07)
    5121                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5122                    .dwattr $C$DW$238, DW_AT_decl_line(0x77)
    5123                    .dwattr $C$DW$238, DW_AT_decl_column(0x05)
    5124            
    5125            $C$DW$239       .dwtag  DW_TAG_enumerator
    5126                    .dwattr $C$DW$239, DW_AT_name("var")
    5127                    .dwattr $C$DW$239, DW_AT_const_value(0x08)
    5128                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5129                    .dwattr $C$DW$239, DW_AT_decl_line(0x78)
    5130                    .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    5131            
    5132            $C$DW$240       .dwtag  DW_TAG_enumerator
    5133                    .dwattr $C$DW$240, DW_AT_name("UGmsg")
    5134                    .dwattr $C$DW$240, DW_AT_const_value(0x09)
    5135                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5136                    .dwattr $C$DW$240, DW_AT_decl_line(0x79)
    5137                    .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    5138            
    5139                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5140                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    5141                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    5142                    .dwendtag $C$DW$T$57
    5143            
    5144            $C$DW$T$58      .dwtag  DW_TAG_typedef
    5145                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    5146                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    5147                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5148                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5149                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    5150                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    5151            
    5152            
    5153            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    5154                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    5155            $C$DW$241       .dwtag  DW_TAG_enumerator
    5156                    .dwattr $C$DW$241, DW_AT_name("init")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  108

    5157                    .dwattr $C$DW$241, DW_AT_const_value(0x00)
    5158                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5159                    .dwattr $C$DW$241, DW_AT_decl_line(0x80)
    5160                    .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    5161            
    5162            $C$DW$242       .dwtag  DW_TAG_enumerator
    5163                    .dwattr $C$DW$242, DW_AT_name("running")
    5164                    .dwattr $C$DW$242, DW_AT_const_value(0x01)
    5165                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5166                    .dwattr $C$DW$242, DW_AT_decl_line(0x80)
    5167                    .dwattr $C$DW$242, DW_AT_decl_column(0x0b)
    5168            
    5169            $C$DW$243       .dwtag  DW_TAG_enumerator
    5170                    .dwattr $C$DW$243, DW_AT_name("wait")
    5171                    .dwattr $C$DW$243, DW_AT_const_value(0x02)
    5172                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    5173                    .dwattr $C$DW$243, DW_AT_decl_line(0x80)
    5174                    .dwattr $C$DW$243, DW_AT_decl_column(0x14)
    5175            
    5176                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5177                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    5178                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    5179                    .dwendtag $C$DW$T$59
    5180            
    5181            $C$DW$T$60      .dwtag  DW_TAG_typedef
    5182                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    5183                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    5184                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    5185                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    5186                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    5187                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    5188            
    5189            
    5190            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5191                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    5192            $C$DW$244       .dwtag  DW_TAG_member
    5193                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$14)
    5194                    .dwattr $C$DW$244, DW_AT_name("__max_align1")
    5195                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("__max_align1")
    5196                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5197                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5198                    .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    5199                    .dwattr $C$DW$244, DW_AT_decl_line(0x7b)
    5200                    .dwattr $C$DW$244, DW_AT_decl_column(0x0c)
    5201            
    5202            $C$DW$245       .dwtag  DW_TAG_member
    5203                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$18)
    5204                    .dwattr $C$DW$245, DW_AT_name("__max_align2")
    5205                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("__max_align2")
    5206                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5207                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5208                    .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    5209                    .dwattr $C$DW$245, DW_AT_decl_line(0x7c)
    5210                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    5211            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  109

    5212                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    5213                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    5214                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    5215                    .dwendtag $C$DW$T$22
    5216            
    5217            $C$DW$T$61      .dwtag  DW_TAG_typedef
    5218                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    5219                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    5220                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    5221                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    5222                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    5223                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    5224            
    5225            
    5226            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5227                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    5228                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    5229            $C$DW$246       .dwtag  DW_TAG_member
    5230                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$24)
    5231                    .dwattr $C$DW$246, DW_AT_name("memoryBufferControlIndex")
    5232                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    5233                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5234                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5235                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5236                    .dwattr $C$DW$246, DW_AT_decl_line(0x27)
    5237                    .dwattr $C$DW$246, DW_AT_decl_column(0x0d)
    5238            
    5239            $C$DW$247       .dwtag  DW_TAG_member
    5240                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$24)
    5241                    .dwattr $C$DW$247, DW_AT_name("inputSourceSelect")
    5242                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("inputSourceSelect")
    5243                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5244                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5245                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5246                    .dwattr $C$DW$247, DW_AT_decl_line(0x3b)
    5247                    .dwattr $C$DW$247, DW_AT_decl_column(0x0d)
    5248            
    5249            $C$DW$248       .dwtag  DW_TAG_member
    5250                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$24)
    5251                    .dwattr $C$DW$248, DW_AT_name("positiveRefVoltageSourceSelect")
    5252                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    5253                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5254                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5255                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5256                    .dwattr $C$DW$248, DW_AT_decl_line(0x42)
    5257                    .dwattr $C$DW$248, DW_AT_decl_column(0x0d)
    5258            
    5259            $C$DW$249       .dwtag  DW_TAG_member
    5260                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$24)
    5261                    .dwattr $C$DW$249, DW_AT_name("negativeRefVoltageSourceSelect")
    5262                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    5263                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5264                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5265                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5266                    .dwattr $C$DW$249, DW_AT_decl_line(0x48)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  110

    5267                    .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    5268            
    5269            $C$DW$250       .dwtag  DW_TAG_member
    5270                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$24)
    5271                    .dwattr $C$DW$250, DW_AT_name("endOfSequence")
    5272                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("endOfSequence")
    5273                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5274                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5275                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    5276                    .dwattr $C$DW$250, DW_AT_decl_line(0x51)
    5277                    .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    5278            
    5279                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    5280                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    5281                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5282                    .dwendtag $C$DW$T$25
    5283            
    5284            $C$DW$T$62      .dwtag  DW_TAG_typedef
    5285                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    5286                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    5287                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    5288                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    5289                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    5290                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    5291            
    5292            
    5293            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5294                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    5295                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    5296            $C$DW$251       .dwtag  DW_TAG_member
    5297                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    5298                    .dwattr $C$DW$251, DW_AT_name("captureRegister")
    5299                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("captureRegister")
    5300                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5301                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5302                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5303                    .dwattr $C$DW$251, DW_AT_decl_line(0x58)
    5304                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    5305            
    5306            $C$DW$252       .dwtag  DW_TAG_member
    5307                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    5308                    .dwattr $C$DW$252, DW_AT_name("captureMode")
    5309                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("captureMode")
    5310                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5311                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5312                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5313                    .dwattr $C$DW$252, DW_AT_decl_line(0x5f)
    5314                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    5315            
    5316            $C$DW$253       .dwtag  DW_TAG_member
    5317                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    5318                    .dwattr $C$DW$253, DW_AT_name("captureInputSelect")
    5319                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("captureInputSelect")
    5320                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5321                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  111

    5322                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5323                    .dwattr $C$DW$253, DW_AT_decl_line(0x66)
    5324                    .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    5325            
    5326            $C$DW$254       .dwtag  DW_TAG_member
    5327                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    5328                    .dwattr $C$DW$254, DW_AT_name("synchronizeCaptureSource")
    5329                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    5330                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5331                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5332                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5333                    .dwattr $C$DW$254, DW_AT_decl_line(0x6b)
    5334                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    5335            
    5336            $C$DW$255       .dwtag  DW_TAG_member
    5337                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    5338                    .dwattr $C$DW$255, DW_AT_name("captureInterruptEnable")
    5339                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("captureInterruptEnable")
    5340                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5341                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5342                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5343                    .dwattr $C$DW$255, DW_AT_decl_line(0x70)
    5344                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    5345            
    5346            $C$DW$256       .dwtag  DW_TAG_member
    5347                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    5348                    .dwattr $C$DW$256, DW_AT_name("captureOutputMode")
    5349                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("captureOutputMode")
    5350                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5351                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5352                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5353                    .dwattr $C$DW$256, DW_AT_decl_line(0x7b)
    5354                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    5355            
    5356                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5357                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    5358                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5359                    .dwendtag $C$DW$T$28
    5360            
    5361            $C$DW$T$63      .dwtag  DW_TAG_typedef
    5362                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    5363                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    5364                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5365                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5366                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    5367                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    5368            
    5369            
    5370            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5371                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    5372                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    5373            $C$DW$257       .dwtag  DW_TAG_member
    5374                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    5375                    .dwattr $C$DW$257, DW_AT_name("compareRegister")
    5376                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("compareRegister")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  112

    5377                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5378                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5379                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5380                    .dwattr $C$DW$257, DW_AT_decl_line(0x145)
    5381                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    5382            
    5383            $C$DW$258       .dwtag  DW_TAG_member
    5384                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    5385                    .dwattr $C$DW$258, DW_AT_name("compareInterruptEnable")
    5386                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("compareInterruptEnable")
    5387                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5388                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5389                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5390                    .dwattr $C$DW$258, DW_AT_decl_line(0x14a)
    5391                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    5392            
    5393            $C$DW$259       .dwtag  DW_TAG_member
    5394                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    5395                    .dwattr $C$DW$259, DW_AT_name("compareOutputMode")
    5396                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("compareOutputMode")
    5397                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5398                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5399                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5400                    .dwattr $C$DW$259, DW_AT_decl_line(0x155)
    5401                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    5402            
    5403            $C$DW$260       .dwtag  DW_TAG_member
    5404                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    5405                    .dwattr $C$DW$260, DW_AT_name("compareValue")
    5406                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("compareValue")
    5407                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5408                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5409                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5410                    .dwattr $C$DW$260, DW_AT_decl_line(0x157)
    5411                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    5412            
    5413                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5414                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    5415                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5416                    .dwendtag $C$DW$T$29
    5417            
    5418            $C$DW$T$64      .dwtag  DW_TAG_typedef
    5419                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    5420                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    5421                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    5422                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5423                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    5424                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    5425            
    5426            
    5427            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5428                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    5429                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    5430            $C$DW$261       .dwtag  DW_TAG_member
    5431                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  113

    5432                    .dwattr $C$DW$261, DW_AT_name("clockSource")
    5433                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("clockSource")
    5434                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5435                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5436                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5437                    .dwattr $C$DW$261, DW_AT_decl_line(0x20)
    5438                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    5439            
    5440            $C$DW$262       .dwtag  DW_TAG_member
    5441                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    5442                    .dwattr $C$DW$262, DW_AT_name("clockSourceDivider")
    5443                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("clockSourceDivider")
    5444                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5445                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5446                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5447                    .dwattr $C$DW$262, DW_AT_decl_line(0x37)
    5448                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    5449            
    5450            $C$DW$263       .dwtag  DW_TAG_member
    5451                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    5452                    .dwattr $C$DW$263, DW_AT_name("timerInterruptEnable_TAIE")
    5453                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5454                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5455                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5456                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5457                    .dwattr $C$DW$263, DW_AT_decl_line(0x3c)
    5458                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    5459            
    5460            $C$DW$264       .dwtag  DW_TAG_member
    5461                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    5462                    .dwattr $C$DW$264, DW_AT_name("timerClear")
    5463                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("timerClear")
    5464                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5465                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5466                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5467                    .dwattr $C$DW$264, DW_AT_decl_line(0x42)
    5468                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    5469            
    5470            $C$DW$265       .dwtag  DW_TAG_member
    5471                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$30)
    5472                    .dwattr $C$DW$265, DW_AT_name("startTimer")
    5473                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("startTimer")
    5474                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5475                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5476                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5477                    .dwattr $C$DW$265, DW_AT_decl_line(0x44)
    5478                    .dwattr $C$DW$265, DW_AT_decl_column(0x0a)
    5479            
    5480                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5481                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    5482                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5483                    .dwendtag $C$DW$T$31
    5484            
    5485            $C$DW$T$65      .dwtag  DW_TAG_typedef
    5486                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  114

    5487                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    5488                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5489                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5490                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    5491                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    5492            
    5493            
    5494            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5495                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    5496                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    5497            $C$DW$266       .dwtag  DW_TAG_member
    5498                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    5499                    .dwattr $C$DW$266, DW_AT_name("clockSource")
    5500                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("clockSource")
    5501                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5502                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5503                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5504                    .dwattr $C$DW$266, DW_AT_decl_line(0x8b)
    5505                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    5506            
    5507            $C$DW$267       .dwtag  DW_TAG_member
    5508                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    5509                    .dwattr $C$DW$267, DW_AT_name("clockSourceDivider")
    5510                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("clockSourceDivider")
    5511                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5512                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5513                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5514                    .dwattr $C$DW$267, DW_AT_decl_line(0xa2)
    5515                    .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    5516            
    5517            $C$DW$268       .dwtag  DW_TAG_member
    5518                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    5519                    .dwattr $C$DW$268, DW_AT_name("timerPeriod")
    5520                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("timerPeriod")
    5521                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5522                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5523                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5524                    .dwattr $C$DW$268, DW_AT_decl_line(0xa4)
    5525                    .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    5526            
    5527            $C$DW$269       .dwtag  DW_TAG_member
    5528                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    5529                    .dwattr $C$DW$269, DW_AT_name("timerInterruptEnable_TAIE")
    5530                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5531                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5532                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5533                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5534                    .dwattr $C$DW$269, DW_AT_decl_line(0xa9)
    5535                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    5536            
    5537            $C$DW$270       .dwtag  DW_TAG_member
    5538                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    5539                    .dwattr $C$DW$270, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5540                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5541                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  115

    5542                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5543                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5544                    .dwattr $C$DW$270, DW_AT_decl_line(0xae)
    5545                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
    5546            
    5547            $C$DW$271       .dwtag  DW_TAG_member
    5548                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    5549                    .dwattr $C$DW$271, DW_AT_name("timerClear")
    5550                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("timerClear")
    5551                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5552                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5553                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5554                    .dwattr $C$DW$271, DW_AT_decl_line(0xb4)
    5555                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    5556            
    5557            $C$DW$272       .dwtag  DW_TAG_member
    5558                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$30)
    5559                    .dwattr $C$DW$272, DW_AT_name("startTimer")
    5560                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("startTimer")
    5561                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5562                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5563                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5564                    .dwattr $C$DW$272, DW_AT_decl_line(0xb6)
    5565                    .dwattr $C$DW$272, DW_AT_decl_column(0x0a)
    5566            
    5567                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5568                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    5569                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    5570                    .dwendtag $C$DW$T$32
    5571            
    5572            $C$DW$T$66      .dwtag  DW_TAG_typedef
    5573                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    5574                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    5575                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    5576                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5577                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    5578                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    5579            
    5580            
    5581            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5582                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    5583                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    5584            $C$DW$273       .dwtag  DW_TAG_member
    5585                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    5586                    .dwattr $C$DW$273, DW_AT_name("clockSource")
    5587                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("clockSource")
    5588                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5589                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5590                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5591                    .dwattr $C$DW$273, DW_AT_decl_line(0x105)
    5592                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    5593            
    5594            $C$DW$274       .dwtag  DW_TAG_member
    5595                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    5596                    .dwattr $C$DW$274, DW_AT_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  116

    5597                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("clockSourceDivider")
    5598                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5599                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5600                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5601                    .dwattr $C$DW$274, DW_AT_decl_line(0x11c)
    5602                    .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    5603            
    5604            $C$DW$275       .dwtag  DW_TAG_member
    5605                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$27)
    5606                    .dwattr $C$DW$275, DW_AT_name("timerPeriod")
    5607                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("timerPeriod")
    5608                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5609                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5610                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5611                    .dwattr $C$DW$275, DW_AT_decl_line(0x11f)
    5612                    .dwattr $C$DW$275, DW_AT_decl_column(0x0e)
    5613            
    5614            $C$DW$276       .dwtag  DW_TAG_member
    5615                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    5616                    .dwattr $C$DW$276, DW_AT_name("timerInterruptEnable_TAIE")
    5617                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5618                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5619                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5620                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5621                    .dwattr $C$DW$276, DW_AT_decl_line(0x124)
    5622                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    5623            
    5624            $C$DW$277       .dwtag  DW_TAG_member
    5625                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    5626                    .dwattr $C$DW$277, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5627                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5628                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5629                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5630                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5631                    .dwattr $C$DW$277, DW_AT_decl_line(0x129)
    5632                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    5633            
    5634            $C$DW$278       .dwtag  DW_TAG_member
    5635                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    5636                    .dwattr $C$DW$278, DW_AT_name("timerClear")
    5637                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("timerClear")
    5638                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5639                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5640                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5641                    .dwattr $C$DW$278, DW_AT_decl_line(0x12f)
    5642                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    5643            
    5644            $C$DW$279       .dwtag  DW_TAG_member
    5645                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$30)
    5646                    .dwattr $C$DW$279, DW_AT_name("startTimer")
    5647                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("startTimer")
    5648                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5649                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5650                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5651                    .dwattr $C$DW$279, DW_AT_decl_line(0x131)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  117

    5652                    .dwattr $C$DW$279, DW_AT_decl_column(0x0a)
    5653            
    5654                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5655                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    5656                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    5657                    .dwendtag $C$DW$T$33
    5658            
    5659            $C$DW$T$67      .dwtag  DW_TAG_typedef
    5660                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    5661                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    5662                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    5663                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5664                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    5665                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    5666            
    5667            
    5668            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5669                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    5670                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    5671            $C$DW$280       .dwtag  DW_TAG_member
    5672                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    5673                    .dwattr $C$DW$280, DW_AT_name("clockSource")
    5674                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("clockSource")
    5675                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5676                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5677                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5678                    .dwattr $C$DW$280, DW_AT_decl_line(0xc5)
    5679                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    5680            
    5681            $C$DW$281       .dwtag  DW_TAG_member
    5682                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    5683                    .dwattr $C$DW$281, DW_AT_name("clockSourceDivider")
    5684                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("clockSourceDivider")
    5685                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5686                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5687                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5688                    .dwattr $C$DW$281, DW_AT_decl_line(0xdc)
    5689                    .dwattr $C$DW$281, DW_AT_decl_column(0x0e)
    5690            
    5691            $C$DW$282       .dwtag  DW_TAG_member
    5692                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$27)
    5693                    .dwattr $C$DW$282, DW_AT_name("timerPeriod")
    5694                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("timerPeriod")
    5695                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5696                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5697                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5698                    .dwattr $C$DW$282, DW_AT_decl_line(0xde)
    5699                    .dwattr $C$DW$282, DW_AT_decl_column(0x0e)
    5700            
    5701            $C$DW$283       .dwtag  DW_TAG_member
    5702                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    5703                    .dwattr $C$DW$283, DW_AT_name("compareRegister")
    5704                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("compareRegister")
    5705                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5706                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  118

    5707                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5708                    .dwattr $C$DW$283, DW_AT_decl_line(0xe9)
    5709                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    5710            
    5711            $C$DW$284       .dwtag  DW_TAG_member
    5712                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    5713                    .dwattr $C$DW$284, DW_AT_name("compareOutputMode")
    5714                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("compareOutputMode")
    5715                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5716                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5717                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5718                    .dwattr $C$DW$284, DW_AT_decl_line(0xf4)
    5719                    .dwattr $C$DW$284, DW_AT_decl_column(0x0e)
    5720            
    5721            $C$DW$285       .dwtag  DW_TAG_member
    5722                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    5723                    .dwattr $C$DW$285, DW_AT_name("dutyCycle")
    5724                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("dutyCycle")
    5725                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5726                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5727                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5728                    .dwattr $C$DW$285, DW_AT_decl_line(0xf6)
    5729                    .dwattr $C$DW$285, DW_AT_decl_column(0x0e)
    5730            
    5731                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5732                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    5733                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    5734                    .dwendtag $C$DW$T$34
    5735            
    5736            $C$DW$T$68      .dwtag  DW_TAG_typedef
    5737                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    5738                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    5739                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    5740                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5741                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    5742                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    5743            
    5744            
    5745            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5746                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    5747                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    5748            $C$DW$286       .dwtag  DW_TAG_member
    5749                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    5750                    .dwattr $C$DW$286, DW_AT_name("captureRegister")
    5751                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("captureRegister")
    5752                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5753                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5754                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5755                    .dwattr $C$DW$286, DW_AT_decl_line(0xa0)
    5756                    .dwattr $C$DW$286, DW_AT_decl_column(0x0e)
    5757            
    5758            $C$DW$287       .dwtag  DW_TAG_member
    5759                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    5760                    .dwattr $C$DW$287, DW_AT_name("captureMode")
    5761                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("captureMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  119

    5762                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5763                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5764                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5765                    .dwattr $C$DW$287, DW_AT_decl_line(0xa7)
    5766                    .dwattr $C$DW$287, DW_AT_decl_column(0x0e)
    5767            
    5768            $C$DW$288       .dwtag  DW_TAG_member
    5769                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
    5770                    .dwattr $C$DW$288, DW_AT_name("captureInputSelect")
    5771                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("captureInputSelect")
    5772                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5773                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5774                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5775                    .dwattr $C$DW$288, DW_AT_decl_line(0xae)
    5776                    .dwattr $C$DW$288, DW_AT_decl_column(0x0e)
    5777            
    5778            $C$DW$289       .dwtag  DW_TAG_member
    5779                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    5780                    .dwattr $C$DW$289, DW_AT_name("synchronizeCaptureSource")
    5781                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    5782                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5783                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5784                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5785                    .dwattr $C$DW$289, DW_AT_decl_line(0xb3)
    5786                    .dwattr $C$DW$289, DW_AT_decl_column(0x0e)
    5787            
    5788            $C$DW$290       .dwtag  DW_TAG_member
    5789                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$27)
    5790                    .dwattr $C$DW$290, DW_AT_name("captureInterruptEnable")
    5791                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("captureInterruptEnable")
    5792                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5793                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5794                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5795                    .dwattr $C$DW$290, DW_AT_decl_line(0xb8)
    5796                    .dwattr $C$DW$290, DW_AT_decl_column(0x0e)
    5797            
    5798            $C$DW$291       .dwtag  DW_TAG_member
    5799                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$27)
    5800                    .dwattr $C$DW$291, DW_AT_name("captureOutputMode")
    5801                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("captureOutputMode")
    5802                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5803                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5804                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5805                    .dwattr $C$DW$291, DW_AT_decl_line(0xc3)
    5806                    .dwattr $C$DW$291, DW_AT_decl_column(0x0e)
    5807            
    5808                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5809                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    5810                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    5811                    .dwendtag $C$DW$T$35
    5812            
    5813            $C$DW$T$69      .dwtag  DW_TAG_typedef
    5814                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    5815                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    5816                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  120

    5817                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5818                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    5819                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    5820            
    5821            
    5822            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5823                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    5824                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    5825            $C$DW$292       .dwtag  DW_TAG_member
    5826                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
    5827                    .dwattr $C$DW$292, DW_AT_name("compareRegister")
    5828                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("compareRegister")
    5829                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5830                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5831                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5832                    .dwattr $C$DW$292, DW_AT_decl_line(0x146)
    5833                    .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    5834            
    5835            $C$DW$293       .dwtag  DW_TAG_member
    5836                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$27)
    5837                    .dwattr $C$DW$293, DW_AT_name("compareInterruptEnable")
    5838                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("compareInterruptEnable")
    5839                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5840                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5841                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5842                    .dwattr $C$DW$293, DW_AT_decl_line(0x14b)
    5843                    .dwattr $C$DW$293, DW_AT_decl_column(0x0e)
    5844            
    5845            $C$DW$294       .dwtag  DW_TAG_member
    5846                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$27)
    5847                    .dwattr $C$DW$294, DW_AT_name("compareOutputMode")
    5848                    .dwattr $C$DW$294, DW_AT_TI_symbol_name("compareOutputMode")
    5849                    .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5850                    .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5851                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5852                    .dwattr $C$DW$294, DW_AT_decl_line(0x156)
    5853                    .dwattr $C$DW$294, DW_AT_decl_column(0x0e)
    5854            
    5855            $C$DW$295       .dwtag  DW_TAG_member
    5856                    .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$27)
    5857                    .dwattr $C$DW$295, DW_AT_name("compareValue")
    5858                    .dwattr $C$DW$295, DW_AT_TI_symbol_name("compareValue")
    5859                    .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5860                    .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5861                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5862                    .dwattr $C$DW$295, DW_AT_decl_line(0x158)
    5863                    .dwattr $C$DW$295, DW_AT_decl_column(0x0e)
    5864            
    5865                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5866                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    5867                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    5868                    .dwendtag $C$DW$T$36
    5869            
    5870            $C$DW$T$70      .dwtag  DW_TAG_typedef
    5871                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  121

    5872                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    5873                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    5874                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5875                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    5876                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    5877            
    5878            
    5879            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5880                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    5881                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    5882            $C$DW$296       .dwtag  DW_TAG_member
    5883                    .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$27)
    5884                    .dwattr $C$DW$296, DW_AT_name("clockSource")
    5885                    .dwattr $C$DW$296, DW_AT_TI_symbol_name("clockSource")
    5886                    .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5887                    .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5888                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5889                    .dwattr $C$DW$296, DW_AT_decl_line(0xd3)
    5890                    .dwattr $C$DW$296, DW_AT_decl_column(0x0e)
    5891            
    5892            $C$DW$297       .dwtag  DW_TAG_member
    5893                    .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$27)
    5894                    .dwattr $C$DW$297, DW_AT_name("clockSourceDivider")
    5895                    .dwattr $C$DW$297, DW_AT_TI_symbol_name("clockSourceDivider")
    5896                    .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5897                    .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5898                    .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5899                    .dwattr $C$DW$297, DW_AT_decl_line(0xea)
    5900                    .dwattr $C$DW$297, DW_AT_decl_column(0x0e)
    5901            
    5902            $C$DW$298       .dwtag  DW_TAG_member
    5903                    .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$27)
    5904                    .dwattr $C$DW$298, DW_AT_name("timerInterruptEnable_TBIE")
    5905                    .dwattr $C$DW$298, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5906                    .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5907                    .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5908                    .dwattr $C$DW$298, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5909                    .dwattr $C$DW$298, DW_AT_decl_line(0xef)
    5910                    .dwattr $C$DW$298, DW_AT_decl_column(0x0e)
    5911            
    5912            $C$DW$299       .dwtag  DW_TAG_member
    5913                    .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$27)
    5914                    .dwattr $C$DW$299, DW_AT_name("timerClear")
    5915                    .dwattr $C$DW$299, DW_AT_TI_symbol_name("timerClear")
    5916                    .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5917                    .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5918                    .dwattr $C$DW$299, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5919                    .dwattr $C$DW$299, DW_AT_decl_line(0xf5)
    5920                    .dwattr $C$DW$299, DW_AT_decl_column(0x0e)
    5921            
    5922            $C$DW$300       .dwtag  DW_TAG_member
    5923                    .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$30)
    5924                    .dwattr $C$DW$300, DW_AT_name("startTimer")
    5925                    .dwattr $C$DW$300, DW_AT_TI_symbol_name("startTimer")
    5926                    .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  122

    5927                    .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5928                    .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5929                    .dwattr $C$DW$300, DW_AT_decl_line(0xf7)
    5930                    .dwattr $C$DW$300, DW_AT_decl_column(0x0a)
    5931            
    5932                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5933                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    5934                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5935                    .dwendtag $C$DW$T$37
    5936            
    5937            $C$DW$T$71      .dwtag  DW_TAG_typedef
    5938                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    5939                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    5940                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    5941                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5942                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    5943                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    5944            
    5945            
    5946            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5947                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    5948                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    5949            $C$DW$301       .dwtag  DW_TAG_member
    5950                    .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$27)
    5951                    .dwattr $C$DW$301, DW_AT_name("clockSource")
    5952                    .dwattr $C$DW$301, DW_AT_TI_symbol_name("clockSource")
    5953                    .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5954                    .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5955                    .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5956                    .dwattr $C$DW$301, DW_AT_decl_line(0x107)
    5957                    .dwattr $C$DW$301, DW_AT_decl_column(0x0e)
    5958            
    5959            $C$DW$302       .dwtag  DW_TAG_member
    5960                    .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$27)
    5961                    .dwattr $C$DW$302, DW_AT_name("clockSourceDivider")
    5962                    .dwattr $C$DW$302, DW_AT_TI_symbol_name("clockSourceDivider")
    5963                    .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5964                    .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5965                    .dwattr $C$DW$302, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5966                    .dwattr $C$DW$302, DW_AT_decl_line(0x11e)
    5967                    .dwattr $C$DW$302, DW_AT_decl_column(0x0e)
    5968            
    5969            $C$DW$303       .dwtag  DW_TAG_member
    5970                    .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$27)
    5971                    .dwattr $C$DW$303, DW_AT_name("timerPeriod")
    5972                    .dwattr $C$DW$303, DW_AT_TI_symbol_name("timerPeriod")
    5973                    .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5974                    .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5975                    .dwattr $C$DW$303, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5976                    .dwattr $C$DW$303, DW_AT_decl_line(0x120)
    5977                    .dwattr $C$DW$303, DW_AT_decl_column(0x0e)
    5978            
    5979            $C$DW$304       .dwtag  DW_TAG_member
    5980                    .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$27)
    5981                    .dwattr $C$DW$304, DW_AT_name("timerInterruptEnable_TBIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  123

    5982                    .dwattr $C$DW$304, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5983                    .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5984                    .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5985                    .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5986                    .dwattr $C$DW$304, DW_AT_decl_line(0x125)
    5987                    .dwattr $C$DW$304, DW_AT_decl_column(0x0e)
    5988            
    5989            $C$DW$305       .dwtag  DW_TAG_member
    5990                    .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$27)
    5991                    .dwattr $C$DW$305, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5992                    .dwattr $C$DW$305, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5993                    .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5994                    .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5995                    .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5996                    .dwattr $C$DW$305, DW_AT_decl_line(0x12a)
    5997                    .dwattr $C$DW$305, DW_AT_decl_column(0x0e)
    5998            
    5999            $C$DW$306       .dwtag  DW_TAG_member
    6000                    .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$27)
    6001                    .dwattr $C$DW$306, DW_AT_name("timerClear")
    6002                    .dwattr $C$DW$306, DW_AT_TI_symbol_name("timerClear")
    6003                    .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6004                    .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6005                    .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6006                    .dwattr $C$DW$306, DW_AT_decl_line(0x130)
    6007                    .dwattr $C$DW$306, DW_AT_decl_column(0x0e)
    6008            
    6009            $C$DW$307       .dwtag  DW_TAG_member
    6010                    .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$30)
    6011                    .dwattr $C$DW$307, DW_AT_name("startTimer")
    6012                    .dwattr $C$DW$307, DW_AT_TI_symbol_name("startTimer")
    6013                    .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6014                    .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6015                    .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6016                    .dwattr $C$DW$307, DW_AT_decl_line(0x132)
    6017                    .dwattr $C$DW$307, DW_AT_decl_column(0x0a)
    6018            
    6019                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6020                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    6021                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    6022                    .dwendtag $C$DW$T$38
    6023            
    6024            $C$DW$T$72      .dwtag  DW_TAG_typedef
    6025                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    6026                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    6027                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6028                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6029                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    6030                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    6031            
    6032            
    6033            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6034                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    6035                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    6036            $C$DW$308       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  124

    6037                    .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$27)
    6038                    .dwattr $C$DW$308, DW_AT_name("clockSource")
    6039                    .dwattr $C$DW$308, DW_AT_TI_symbol_name("clockSource")
    6040                    .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6041                    .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6042                    .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6043                    .dwattr $C$DW$308, DW_AT_decl_line(0x60)
    6044                    .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    6045            
    6046            $C$DW$309       .dwtag  DW_TAG_member
    6047                    .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$27)
    6048                    .dwattr $C$DW$309, DW_AT_name("clockSourceDivider")
    6049                    .dwattr $C$DW$309, DW_AT_TI_symbol_name("clockSourceDivider")
    6050                    .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6051                    .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6052                    .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6053                    .dwattr $C$DW$309, DW_AT_decl_line(0x77)
    6054                    .dwattr $C$DW$309, DW_AT_decl_column(0x0e)
    6055            
    6056            $C$DW$310       .dwtag  DW_TAG_member
    6057                    .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$27)
    6058                    .dwattr $C$DW$310, DW_AT_name("timerPeriod")
    6059                    .dwattr $C$DW$310, DW_AT_TI_symbol_name("timerPeriod")
    6060                    .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6061                    .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    6062                    .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6063                    .dwattr $C$DW$310, DW_AT_decl_line(0x7a)
    6064                    .dwattr $C$DW$310, DW_AT_decl_column(0x0e)
    6065            
    6066            $C$DW$311       .dwtag  DW_TAG_member
    6067                    .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$27)
    6068                    .dwattr $C$DW$311, DW_AT_name("timerInterruptEnable_TBIE")
    6069                    .dwattr $C$DW$311, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    6070                    .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6071                    .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    6072                    .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6073                    .dwattr $C$DW$311, DW_AT_decl_line(0x7f)
    6074                    .dwattr $C$DW$311, DW_AT_decl_column(0x0e)
    6075            
    6076            $C$DW$312       .dwtag  DW_TAG_member
    6077                    .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    6078                    .dwattr $C$DW$312, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    6079                    .dwattr $C$DW$312, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    6080                    .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6081                    .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    6082                    .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6083                    .dwattr $C$DW$312, DW_AT_decl_line(0x84)
    6084                    .dwattr $C$DW$312, DW_AT_decl_column(0x0e)
    6085            
    6086            $C$DW$313       .dwtag  DW_TAG_member
    6087                    .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$27)
    6088                    .dwattr $C$DW$313, DW_AT_name("timerClear")
    6089                    .dwattr $C$DW$313, DW_AT_TI_symbol_name("timerClear")
    6090                    .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6091                    .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  125

    6092                    .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6093                    .dwattr $C$DW$313, DW_AT_decl_line(0x8a)
    6094                    .dwattr $C$DW$313, DW_AT_decl_column(0x0e)
    6095            
    6096            $C$DW$314       .dwtag  DW_TAG_member
    6097                    .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$30)
    6098                    .dwattr $C$DW$314, DW_AT_name("startTimer")
    6099                    .dwattr $C$DW$314, DW_AT_TI_symbol_name("startTimer")
    6100                    .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6101                    .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6102                    .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6103                    .dwattr $C$DW$314, DW_AT_decl_line(0x8c)
    6104                    .dwattr $C$DW$314, DW_AT_decl_column(0x0a)
    6105            
    6106                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6107                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    6108                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    6109                    .dwendtag $C$DW$T$39
    6110            
    6111            $C$DW$T$73      .dwtag  DW_TAG_typedef
    6112                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    6113                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    6114                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6115                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6116                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    6117                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    6118            
    6119            
    6120            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6121                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    6122                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    6123            $C$DW$315       .dwtag  DW_TAG_member
    6124                    .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$27)
    6125                    .dwattr $C$DW$315, DW_AT_name("clockSource")
    6126                    .dwattr $C$DW$315, DW_AT_TI_symbol_name("clockSource")
    6127                    .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6128                    .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    6129                    .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6130                    .dwattr $C$DW$315, DW_AT_decl_line(0x20)
    6131                    .dwattr $C$DW$315, DW_AT_decl_column(0x0e)
    6132            
    6133            $C$DW$316       .dwtag  DW_TAG_member
    6134                    .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$27)
    6135                    .dwattr $C$DW$316, DW_AT_name("clockSourceDivider")
    6136                    .dwattr $C$DW$316, DW_AT_TI_symbol_name("clockSourceDivider")
    6137                    .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6138                    .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6139                    .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6140                    .dwattr $C$DW$316, DW_AT_decl_line(0x37)
    6141                    .dwattr $C$DW$316, DW_AT_decl_column(0x0e)
    6142            
    6143            $C$DW$317       .dwtag  DW_TAG_member
    6144                    .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$27)
    6145                    .dwattr $C$DW$317, DW_AT_name("timerPeriod")
    6146                    .dwattr $C$DW$317, DW_AT_TI_symbol_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  126

    6147                    .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6148                    .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6149                    .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6150                    .dwattr $C$DW$317, DW_AT_decl_line(0x39)
    6151                    .dwattr $C$DW$317, DW_AT_decl_column(0x0e)
    6152            
    6153            $C$DW$318       .dwtag  DW_TAG_member
    6154                    .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$27)
    6155                    .dwattr $C$DW$318, DW_AT_name("compareRegister")
    6156                    .dwattr $C$DW$318, DW_AT_TI_symbol_name("compareRegister")
    6157                    .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6158                    .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6159                    .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6160                    .dwattr $C$DW$318, DW_AT_decl_line(0x44)
    6161                    .dwattr $C$DW$318, DW_AT_decl_column(0x0e)
    6162            
    6163            $C$DW$319       .dwtag  DW_TAG_member
    6164                    .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$27)
    6165                    .dwattr $C$DW$319, DW_AT_name("compareOutputMode")
    6166                    .dwattr $C$DW$319, DW_AT_TI_symbol_name("compareOutputMode")
    6167                    .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6168                    .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6169                    .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6170                    .dwattr $C$DW$319, DW_AT_decl_line(0x4f)
    6171                    .dwattr $C$DW$319, DW_AT_decl_column(0x0e)
    6172            
    6173            $C$DW$320       .dwtag  DW_TAG_member
    6174                    .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$27)
    6175                    .dwattr $C$DW$320, DW_AT_name("dutyCycle")
    6176                    .dwattr $C$DW$320, DW_AT_TI_symbol_name("dutyCycle")
    6177                    .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6178                    .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6179                    .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    6180                    .dwattr $C$DW$320, DW_AT_decl_line(0x51)
    6181                    .dwattr $C$DW$320, DW_AT_decl_column(0x0e)
    6182            
    6183                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6184                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    6185                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    6186                    .dwendtag $C$DW$T$40
    6187            
    6188            $C$DW$T$74      .dwtag  DW_TAG_typedef
    6189                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    6190                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    6191                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    6192                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    6193                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    6194                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    6195            
    6196            
    6197            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6198                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    6199                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    6200            $C$DW$321       .dwtag  DW_TAG_member
    6201                    .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$24)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  127

    6202                    .dwattr $C$DW$321, DW_AT_name("selectClockSource")
    6203                    .dwattr $C$DW$321, DW_AT_TI_symbol_name("selectClockSource")
    6204                    .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6205                    .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6206                    .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6207                    .dwattr $C$DW$321, DW_AT_decl_line(0x1c)
    6208                    .dwattr $C$DW$321, DW_AT_decl_column(0x0d)
    6209            
    6210            $C$DW$322       .dwtag  DW_TAG_member
    6211                    .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    6212                    .dwattr $C$DW$322, DW_AT_name("clockPrescalar")
    6213                    .dwattr $C$DW$322, DW_AT_TI_symbol_name("clockPrescalar")
    6214                    .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6215                    .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6216                    .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6217                    .dwattr $C$DW$322, DW_AT_decl_line(0x1e)
    6218                    .dwattr $C$DW$322, DW_AT_decl_column(0x0e)
    6219            
    6220            $C$DW$323       .dwtag  DW_TAG_member
    6221                    .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$24)
    6222                    .dwattr $C$DW$323, DW_AT_name("firstModReg")
    6223                    .dwattr $C$DW$323, DW_AT_TI_symbol_name("firstModReg")
    6224                    .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6225                    .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6226                    .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6227                    .dwattr $C$DW$323, DW_AT_decl_line(0x22)
    6228                    .dwattr $C$DW$323, DW_AT_decl_column(0x0d)
    6229            
    6230            $C$DW$324       .dwtag  DW_TAG_member
    6231                    .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$24)
    6232                    .dwattr $C$DW$324, DW_AT_name("secondModReg")
    6233                    .dwattr $C$DW$324, DW_AT_TI_symbol_name("secondModReg")
    6234                    .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6235                    .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6236                    .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6237                    .dwattr $C$DW$324, DW_AT_decl_line(0x26)
    6238                    .dwattr $C$DW$324, DW_AT_decl_column(0x0d)
    6239            
    6240            $C$DW$325       .dwtag  DW_TAG_member
    6241                    .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$24)
    6242                    .dwattr $C$DW$325, DW_AT_name("parity")
    6243                    .dwattr $C$DW$325, DW_AT_TI_symbol_name("parity")
    6244                    .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6245                    .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6246                    .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6247                    .dwattr $C$DW$325, DW_AT_decl_line(0x2c)
    6248                    .dwattr $C$DW$325, DW_AT_decl_column(0x0d)
    6249            
    6250            $C$DW$326       .dwtag  DW_TAG_member
    6251                    .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$24)
    6252                    .dwattr $C$DW$326, DW_AT_name("msborLsbFirst")
    6253                    .dwattr $C$DW$326, DW_AT_TI_symbol_name("msborLsbFirst")
    6254                    .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6255                    .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6256                    .dwattr $C$DW$326, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  128

    6257                    .dwattr $C$DW$326, DW_AT_decl_line(0x31)
    6258                    .dwattr $C$DW$326, DW_AT_decl_column(0x0d)
    6259            
    6260            $C$DW$327       .dwtag  DW_TAG_member
    6261                    .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$24)
    6262                    .dwattr $C$DW$327, DW_AT_name("numberofStopBits")
    6263                    .dwattr $C$DW$327, DW_AT_TI_symbol_name("numberofStopBits")
    6264                    .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6265                    .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6266                    .dwattr $C$DW$327, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6267                    .dwattr $C$DW$327, DW_AT_decl_line(0x36)
    6268                    .dwattr $C$DW$327, DW_AT_decl_column(0x0d)
    6269            
    6270            $C$DW$328       .dwtag  DW_TAG_member
    6271                    .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$24)
    6272                    .dwattr $C$DW$328, DW_AT_name("uartMode")
    6273                    .dwattr $C$DW$328, DW_AT_TI_symbol_name("uartMode")
    6274                    .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6275                    .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6276                    .dwattr $C$DW$328, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6277                    .dwattr $C$DW$328, DW_AT_decl_line(0x3d)
    6278                    .dwattr $C$DW$328, DW_AT_decl_column(0x0d)
    6279            
    6280            $C$DW$329       .dwtag  DW_TAG_member
    6281                    .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$24)
    6282                    .dwattr $C$DW$329, DW_AT_name("overSampling")
    6283                    .dwattr $C$DW$329, DW_AT_TI_symbol_name("overSampling")
    6284                    .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6285                    .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    6286                    .dwattr $C$DW$329, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6287                    .dwattr $C$DW$329, DW_AT_decl_line(0x42)
    6288                    .dwattr $C$DW$329, DW_AT_decl_column(0x0d)
    6289            
    6290                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6291                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    6292                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6293                    .dwendtag $C$DW$T$41
    6294            
    6295            $C$DW$T$75      .dwtag  DW_TAG_typedef
    6296                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    6297                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    6298                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    6299                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6300                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    6301                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    6302            
    6303            
    6304            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6305                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    6306                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    6307            $C$DW$330       .dwtag  DW_TAG_member
    6308                    .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$43)
    6309                    .dwattr $C$DW$330, DW_AT_name("clockSourceFrequency")
    6310                    .dwattr $C$DW$330, DW_AT_TI_symbol_name("clockSourceFrequency")
    6311                    .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  129

    6312                    .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6313                    .dwattr $C$DW$330, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6314                    .dwattr $C$DW$330, DW_AT_decl_line(0x31)
    6315                    .dwattr $C$DW$330, DW_AT_decl_column(0x0e)
    6316            
    6317            $C$DW$331       .dwtag  DW_TAG_member
    6318                    .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$43)
    6319                    .dwattr $C$DW$331, DW_AT_name("desiredSpiClock")
    6320                    .dwattr $C$DW$331, DW_AT_TI_symbol_name("desiredSpiClock")
    6321                    .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6322                    .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6323                    .dwattr $C$DW$331, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6324                    .dwattr $C$DW$331, DW_AT_decl_line(0x33)
    6325                    .dwattr $C$DW$331, DW_AT_decl_column(0x0e)
    6326            
    6327                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6328                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    6329                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    6330                    .dwendtag $C$DW$T$44
    6331            
    6332            $C$DW$T$76      .dwtag  DW_TAG_typedef
    6333                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    6334                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    6335                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6336                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    6337                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    6338                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    6339            
    6340            
    6341            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6342                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    6343                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    6344            $C$DW$332       .dwtag  DW_TAG_member
    6345                    .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$24)
    6346                    .dwattr $C$DW$332, DW_AT_name("selectClockSource")
    6347                    .dwattr $C$DW$332, DW_AT_TI_symbol_name("selectClockSource")
    6348                    .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6349                    .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6350                    .dwattr $C$DW$332, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6351                    .dwattr $C$DW$332, DW_AT_decl_line(0x14)
    6352                    .dwattr $C$DW$332, DW_AT_decl_column(0x0d)
    6353            
    6354            $C$DW$333       .dwtag  DW_TAG_member
    6355                    .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$43)
    6356                    .dwattr $C$DW$333, DW_AT_name("clockSourceFrequency")
    6357                    .dwattr $C$DW$333, DW_AT_TI_symbol_name("clockSourceFrequency")
    6358                    .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6359                    .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6360                    .dwattr $C$DW$333, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6361                    .dwattr $C$DW$333, DW_AT_decl_line(0x16)
    6362                    .dwattr $C$DW$333, DW_AT_decl_column(0x0e)
    6363            
    6364            $C$DW$334       .dwtag  DW_TAG_member
    6365                    .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$43)
    6366                    .dwattr $C$DW$334, DW_AT_name("desiredSpiClock")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:59:32 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Momentary_Switch.asm                                                 PAGE  130

    6367                    .dwattr $C$DW$334, DW_AT_TI_symbol_name("desiredSpiClock")
    6368                    .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6369                    .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6370                    .dwattr $C$DW$334, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6371                    .dwattr $C$DW$334, DW_AT_decl_line(0x18)
    6372                    .dwattr $C$DW$334, DW_AT_decl_column(0x0e)
    6373            
    6374            $C$DW$335       .dwtag  DW_TAG_member
    6375                    .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$24)
    6376                    .dwattr $C$DW$335, DW_AT_name("msbFirst")
    6377                    .dwattr $C$DW$335, DW_AT_TI_symbol_name("msbFirst")
    6378                    .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6379                    .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6380                    .dwattr $C$DW$335, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    6381                    .dwattr $C$DW$335, DW_AT_decl_line(0x1d)
    6382                    .dwattr $C$DW$335, DW_AT_decl_column(0x0d)
