MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:01 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Output_Voltage_Set.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("FCTL1")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("FCTL1")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$114)

    3215                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3216                    .dwattr $C$DW$163, DW_AT_decl_line(0x76)
    3217                    .dwattr $C$DW$163, DW_AT_decl_column(0x05)
    3218            
    3219            $C$DW$164       .dwtag  DW_TAG_enumerator
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   64

    3220                    .dwattr $C$DW$164, DW_AT_name("ack")
    3221                    .dwattr $C$DW$164, DW_AT_const_value(0x07)
    3222                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3223                    .dwattr $C$DW$164, DW_AT_decl_line(0x77)
    3224                    .dwattr $C$DW$164, DW_AT_decl_column(0x05)
    3225            
    3226            $C$DW$165       .dwtag  DW_TAG_enumerator
    3227                    .dwattr $C$DW$165, DW_AT_name("var")
    3228                    .dwattr $C$DW$165, DW_AT_const_value(0x08)
    3229                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3230                    .dwattr $C$DW$165, DW_AT_decl_line(0x78)
    3231                    .dwattr $C$DW$165, DW_AT_decl_column(0x05)
    3232            
    3233            $C$DW$166       .dwtag  DW_TAG_enumerator
    3234                    .dwattr $C$DW$166, DW_AT_name("UGmsg")
    3235                    .dwattr $C$DW$166, DW_AT_const_value(0x09)
    3236                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3237                    .dwattr $C$DW$166, DW_AT_decl_line(0x79)
    3238                    .dwattr $C$DW$166, DW_AT_decl_column(0x05)
    3239            
    3240                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3241                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    3242                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    3243                    .dwendtag $C$DW$T$57
    3244            
    3245            $C$DW$T$58      .dwtag  DW_TAG_typedef
    3246                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    3247                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3248                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3249                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3250                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    3251                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3252            
    3253            
    3254            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3255                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3256            $C$DW$167       .dwtag  DW_TAG_enumerator
    3257                    .dwattr $C$DW$167, DW_AT_name("init")
    3258                    .dwattr $C$DW$167, DW_AT_const_value(0x00)
    3259                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3260                    .dwattr $C$DW$167, DW_AT_decl_line(0x80)
    3261                    .dwattr $C$DW$167, DW_AT_decl_column(0x05)
    3262            
    3263            $C$DW$168       .dwtag  DW_TAG_enumerator
    3264                    .dwattr $C$DW$168, DW_AT_name("running")
    3265                    .dwattr $C$DW$168, DW_AT_const_value(0x01)
    3266                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3267                    .dwattr $C$DW$168, DW_AT_decl_line(0x80)
    3268                    .dwattr $C$DW$168, DW_AT_decl_column(0x0b)
    3269            
    3270            $C$DW$169       .dwtag  DW_TAG_enumerator
    3271                    .dwattr $C$DW$169, DW_AT_name("wait")
    3272                    .dwattr $C$DW$169, DW_AT_const_value(0x02)
    3273                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3274                    .dwattr $C$DW$169, DW_AT_decl_line(0x80)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   65

    3275                    .dwattr $C$DW$169, DW_AT_decl_column(0x14)
    3276            
    3277                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3278                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    3279                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3280                    .dwendtag $C$DW$T$59
    3281            
    3282            $C$DW$T$60      .dwtag  DW_TAG_typedef
    3283                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    3284                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3285                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3286                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3287                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    3288                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3289            
    3290            
    3291            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3292                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3293            $C$DW$170       .dwtag  DW_TAG_member
    3294                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$14)
    3295                    .dwattr $C$DW$170, DW_AT_name("__max_align1")
    3296                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("__max_align1")
    3297                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3298                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3299                    .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3300                    .dwattr $C$DW$170, DW_AT_decl_line(0x7b)
    3301                    .dwattr $C$DW$170, DW_AT_decl_column(0x0c)
    3302            
    3303            $C$DW$171       .dwtag  DW_TAG_member
    3304                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$18)
    3305                    .dwattr $C$DW$171, DW_AT_name("__max_align2")
    3306                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("__max_align2")
    3307                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3308                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3309                    .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3310                    .dwattr $C$DW$171, DW_AT_decl_line(0x7c)
    3311                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3312            
    3313                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3314                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3315                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3316                    .dwendtag $C$DW$T$22
    3317            
    3318            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3319                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3320                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3321                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3322                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3323                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3324                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3325            
    3326            
    3327            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3328                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3329                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   66

    3330            $C$DW$172       .dwtag  DW_TAG_member
    3331                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$24)
    3332                    .dwattr $C$DW$172, DW_AT_name("memoryBufferControlIndex")
    3333                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3334                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3335                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3336                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3337                    .dwattr $C$DW$172, DW_AT_decl_line(0x27)
    3338                    .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    3339            
    3340            $C$DW$173       .dwtag  DW_TAG_member
    3341                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$24)
    3342                    .dwattr $C$DW$173, DW_AT_name("inputSourceSelect")
    3343                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("inputSourceSelect")
    3344                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3345                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3346                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3347                    .dwattr $C$DW$173, DW_AT_decl_line(0x3b)
    3348                    .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    3349            
    3350            $C$DW$174       .dwtag  DW_TAG_member
    3351                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$24)
    3352                    .dwattr $C$DW$174, DW_AT_name("positiveRefVoltageSourceSelect")
    3353                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3354                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3355                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3356                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3357                    .dwattr $C$DW$174, DW_AT_decl_line(0x42)
    3358                    .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    3359            
    3360            $C$DW$175       .dwtag  DW_TAG_member
    3361                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$24)
    3362                    .dwattr $C$DW$175, DW_AT_name("negativeRefVoltageSourceSelect")
    3363                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3364                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3365                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3366                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3367                    .dwattr $C$DW$175, DW_AT_decl_line(0x48)
    3368                    .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    3369            
    3370            $C$DW$176       .dwtag  DW_TAG_member
    3371                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$24)
    3372                    .dwattr $C$DW$176, DW_AT_name("endOfSequence")
    3373                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("endOfSequence")
    3374                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3375                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3376                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3377                    .dwattr $C$DW$176, DW_AT_decl_line(0x51)
    3378                    .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    3379            
    3380                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3381                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3382                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3383                    .dwendtag $C$DW$T$25
    3384            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   67

    3385            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3386                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3387                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3388                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3389                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3390                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3391                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3392            
    3393            
    3394            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3395                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3396                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3397            $C$DW$177       .dwtag  DW_TAG_member
    3398                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3399                    .dwattr $C$DW$177, DW_AT_name("captureRegister")
    3400                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("captureRegister")
    3401                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3403                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3404                    .dwattr $C$DW$177, DW_AT_decl_line(0x58)
    3405                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3406            
    3407            $C$DW$178       .dwtag  DW_TAG_member
    3408                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3409                    .dwattr $C$DW$178, DW_AT_name("captureMode")
    3410                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("captureMode")
    3411                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3412                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3413                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3414                    .dwattr $C$DW$178, DW_AT_decl_line(0x5f)
    3415                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3416            
    3417            $C$DW$179       .dwtag  DW_TAG_member
    3418                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3419                    .dwattr $C$DW$179, DW_AT_name("captureInputSelect")
    3420                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("captureInputSelect")
    3421                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3422                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3423                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3424                    .dwattr $C$DW$179, DW_AT_decl_line(0x66)
    3425                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3426            
    3427            $C$DW$180       .dwtag  DW_TAG_member
    3428                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3429                    .dwattr $C$DW$180, DW_AT_name("synchronizeCaptureSource")
    3430                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3431                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3432                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3433                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3434                    .dwattr $C$DW$180, DW_AT_decl_line(0x6b)
    3435                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3436            
    3437            $C$DW$181       .dwtag  DW_TAG_member
    3438                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    3439                    .dwattr $C$DW$181, DW_AT_name("captureInterruptEnable")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   68

    3440                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("captureInterruptEnable")
    3441                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3442                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3443                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3444                    .dwattr $C$DW$181, DW_AT_decl_line(0x70)
    3445                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3446            
    3447            $C$DW$182       .dwtag  DW_TAG_member
    3448                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    3449                    .dwattr $C$DW$182, DW_AT_name("captureOutputMode")
    3450                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("captureOutputMode")
    3451                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3452                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3453                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3454                    .dwattr $C$DW$182, DW_AT_decl_line(0x7b)
    3455                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3456            
    3457                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3458                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3459                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3460                    .dwendtag $C$DW$T$28
    3461            
    3462            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3463                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3464                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3465                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3466                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3467                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3468                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3469            
    3470            
    3471            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3472                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3473                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3474            $C$DW$183       .dwtag  DW_TAG_member
    3475                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3476                    .dwattr $C$DW$183, DW_AT_name("compareRegister")
    3477                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("compareRegister")
    3478                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3479                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3480                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3481                    .dwattr $C$DW$183, DW_AT_decl_line(0x145)
    3482                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3483            
    3484            $C$DW$184       .dwtag  DW_TAG_member
    3485                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3486                    .dwattr $C$DW$184, DW_AT_name("compareInterruptEnable")
    3487                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("compareInterruptEnable")
    3488                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3489                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3490                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3491                    .dwattr $C$DW$184, DW_AT_decl_line(0x14a)
    3492                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3493            
    3494            $C$DW$185       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   69

    3495                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$27)
    3496                    .dwattr $C$DW$185, DW_AT_name("compareOutputMode")
    3497                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("compareOutputMode")
    3498                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3499                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3500                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3501                    .dwattr $C$DW$185, DW_AT_decl_line(0x155)
    3502                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    3503            
    3504            $C$DW$186       .dwtag  DW_TAG_member
    3505                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3506                    .dwattr $C$DW$186, DW_AT_name("compareValue")
    3507                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("compareValue")
    3508                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3509                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3510                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3511                    .dwattr $C$DW$186, DW_AT_decl_line(0x157)
    3512                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3513            
    3514                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3515                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3516                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3517                    .dwendtag $C$DW$T$29
    3518            
    3519            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3520                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3521                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3522                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3523                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3524                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3525                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3526            
    3527            
    3528            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3529                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3530                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3531            $C$DW$187       .dwtag  DW_TAG_member
    3532                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3533                    .dwattr $C$DW$187, DW_AT_name("clockSource")
    3534                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("clockSource")
    3535                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3536                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3537                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3538                    .dwattr $C$DW$187, DW_AT_decl_line(0x20)
    3539                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3540            
    3541            $C$DW$188       .dwtag  DW_TAG_member
    3542                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3543                    .dwattr $C$DW$188, DW_AT_name("clockSourceDivider")
    3544                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("clockSourceDivider")
    3545                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3546                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3547                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3548                    .dwattr $C$DW$188, DW_AT_decl_line(0x37)
    3549                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   70

    3550            
    3551            $C$DW$189       .dwtag  DW_TAG_member
    3552                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3553                    .dwattr $C$DW$189, DW_AT_name("timerInterruptEnable_TAIE")
    3554                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3555                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3556                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3557                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3558                    .dwattr $C$DW$189, DW_AT_decl_line(0x3c)
    3559                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3560            
    3561            $C$DW$190       .dwtag  DW_TAG_member
    3562                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3563                    .dwattr $C$DW$190, DW_AT_name("timerClear")
    3564                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("timerClear")
    3565                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3566                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3567                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3568                    .dwattr $C$DW$190, DW_AT_decl_line(0x42)
    3569                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    3570            
    3571            $C$DW$191       .dwtag  DW_TAG_member
    3572                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$30)
    3573                    .dwattr $C$DW$191, DW_AT_name("startTimer")
    3574                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("startTimer")
    3575                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3576                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3577                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3578                    .dwattr $C$DW$191, DW_AT_decl_line(0x44)
    3579                    .dwattr $C$DW$191, DW_AT_decl_column(0x0a)
    3580            
    3581                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3582                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3583                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3584                    .dwendtag $C$DW$T$31
    3585            
    3586            $C$DW$T$65      .dwtag  DW_TAG_typedef
    3587                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    3588                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    3589                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3590                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3591                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    3592                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3593            
    3594            
    3595            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3596                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    3597                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    3598            $C$DW$192       .dwtag  DW_TAG_member
    3599                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    3600                    .dwattr $C$DW$192, DW_AT_name("clockSource")
    3601                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("clockSource")
    3602                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3603                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3604                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   71

    3605                    .dwattr $C$DW$192, DW_AT_decl_line(0x8b)
    3606                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    3607            
    3608            $C$DW$193       .dwtag  DW_TAG_member
    3609                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3610                    .dwattr $C$DW$193, DW_AT_name("clockSourceDivider")
    3611                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("clockSourceDivider")
    3612                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3613                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3614                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3615                    .dwattr $C$DW$193, DW_AT_decl_line(0xa2)
    3616                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3617            
    3618            $C$DW$194       .dwtag  DW_TAG_member
    3619                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3620                    .dwattr $C$DW$194, DW_AT_name("timerPeriod")
    3621                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("timerPeriod")
    3622                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3623                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3624                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3625                    .dwattr $C$DW$194, DW_AT_decl_line(0xa4)
    3626                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3627            
    3628            $C$DW$195       .dwtag  DW_TAG_member
    3629                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3630                    .dwattr $C$DW$195, DW_AT_name("timerInterruptEnable_TAIE")
    3631                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3632                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3633                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3634                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3635                    .dwattr $C$DW$195, DW_AT_decl_line(0xa9)
    3636                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3637            
    3638            $C$DW$196       .dwtag  DW_TAG_member
    3639                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3640                    .dwattr $C$DW$196, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3641                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3642                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3643                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3644                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3645                    .dwattr $C$DW$196, DW_AT_decl_line(0xae)
    3646                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3647            
    3648            $C$DW$197       .dwtag  DW_TAG_member
    3649                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3650                    .dwattr $C$DW$197, DW_AT_name("timerClear")
    3651                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("timerClear")
    3652                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3653                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3654                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3655                    .dwattr $C$DW$197, DW_AT_decl_line(0xb4)
    3656                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3657            
    3658            $C$DW$198       .dwtag  DW_TAG_member
    3659                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   72

    3660                    .dwattr $C$DW$198, DW_AT_name("startTimer")
    3661                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("startTimer")
    3662                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3663                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3664                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3665                    .dwattr $C$DW$198, DW_AT_decl_line(0xb6)
    3666                    .dwattr $C$DW$198, DW_AT_decl_column(0x0a)
    3667            
    3668                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3669                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    3670                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3671                    .dwendtag $C$DW$T$32
    3672            
    3673            $C$DW$T$66      .dwtag  DW_TAG_typedef
    3674                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    3675                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    3676                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3677                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3678                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    3679                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3680            
    3681            
    3682            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3683                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    3684                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    3685            $C$DW$199       .dwtag  DW_TAG_member
    3686                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    3687                    .dwattr $C$DW$199, DW_AT_name("clockSource")
    3688                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("clockSource")
    3689                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3690                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3691                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3692                    .dwattr $C$DW$199, DW_AT_decl_line(0x105)
    3693                    .dwattr $C$DW$199, DW_AT_decl_column(0x0e)
    3694            
    3695            $C$DW$200       .dwtag  DW_TAG_member
    3696                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3697                    .dwattr $C$DW$200, DW_AT_name("clockSourceDivider")
    3698                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("clockSourceDivider")
    3699                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3700                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3701                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3702                    .dwattr $C$DW$200, DW_AT_decl_line(0x11c)
    3703                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3704            
    3705            $C$DW$201       .dwtag  DW_TAG_member
    3706                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3707                    .dwattr $C$DW$201, DW_AT_name("timerPeriod")
    3708                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("timerPeriod")
    3709                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3710                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3711                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3712                    .dwattr $C$DW$201, DW_AT_decl_line(0x11f)
    3713                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3714            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   73

    3715            $C$DW$202       .dwtag  DW_TAG_member
    3716                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3717                    .dwattr $C$DW$202, DW_AT_name("timerInterruptEnable_TAIE")
    3718                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3719                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3720                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3721                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3722                    .dwattr $C$DW$202, DW_AT_decl_line(0x124)
    3723                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3724            
    3725            $C$DW$203       .dwtag  DW_TAG_member
    3726                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3727                    .dwattr $C$DW$203, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3728                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3729                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3730                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3731                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3732                    .dwattr $C$DW$203, DW_AT_decl_line(0x129)
    3733                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3734            
    3735            $C$DW$204       .dwtag  DW_TAG_member
    3736                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3737                    .dwattr $C$DW$204, DW_AT_name("timerClear")
    3738                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("timerClear")
    3739                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3740                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3741                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3742                    .dwattr $C$DW$204, DW_AT_decl_line(0x12f)
    3743                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3744            
    3745            $C$DW$205       .dwtag  DW_TAG_member
    3746                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$30)
    3747                    .dwattr $C$DW$205, DW_AT_name("startTimer")
    3748                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("startTimer")
    3749                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3750                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3751                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3752                    .dwattr $C$DW$205, DW_AT_decl_line(0x131)
    3753                    .dwattr $C$DW$205, DW_AT_decl_column(0x0a)
    3754            
    3755                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3756                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3757                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3758                    .dwendtag $C$DW$T$33
    3759            
    3760            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3761                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3762                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3763                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3764                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3765                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3766                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3767            
    3768            
    3769            $C$DW$T$34      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   74

    3770                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3771                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3772            $C$DW$206       .dwtag  DW_TAG_member
    3773                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3774                    .dwattr $C$DW$206, DW_AT_name("clockSource")
    3775                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("clockSource")
    3776                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3777                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3778                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3779                    .dwattr $C$DW$206, DW_AT_decl_line(0xc5)
    3780                    .dwattr $C$DW$206, DW_AT_decl_column(0x0e)
    3781            
    3782            $C$DW$207       .dwtag  DW_TAG_member
    3783                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3784                    .dwattr $C$DW$207, DW_AT_name("clockSourceDivider")
    3785                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("clockSourceDivider")
    3786                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3787                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3788                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3789                    .dwattr $C$DW$207, DW_AT_decl_line(0xdc)
    3790                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3791            
    3792            $C$DW$208       .dwtag  DW_TAG_member
    3793                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3794                    .dwattr $C$DW$208, DW_AT_name("timerPeriod")
    3795                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("timerPeriod")
    3796                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3797                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3798                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3799                    .dwattr $C$DW$208, DW_AT_decl_line(0xde)
    3800                    .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    3801            
    3802            $C$DW$209       .dwtag  DW_TAG_member
    3803                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    3804                    .dwattr $C$DW$209, DW_AT_name("compareRegister")
    3805                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("compareRegister")
    3806                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3807                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3808                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3809                    .dwattr $C$DW$209, DW_AT_decl_line(0xe9)
    3810                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    3811            
    3812            $C$DW$210       .dwtag  DW_TAG_member
    3813                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3814                    .dwattr $C$DW$210, DW_AT_name("compareOutputMode")
    3815                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("compareOutputMode")
    3816                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3817                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3818                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3819                    .dwattr $C$DW$210, DW_AT_decl_line(0xf4)
    3820                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    3821            
    3822            $C$DW$211       .dwtag  DW_TAG_member
    3823                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3824                    .dwattr $C$DW$211, DW_AT_name("dutyCycle")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   75

    3825                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("dutyCycle")
    3826                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3827                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3828                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3829                    .dwattr $C$DW$211, DW_AT_decl_line(0xf6)
    3830                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    3831            
    3832                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3833                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3834                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3835                    .dwendtag $C$DW$T$34
    3836            
    3837            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3838                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3839                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3840                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3841                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3842                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3843                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3844            
    3845            
    3846            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3847                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3848                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3849            $C$DW$212       .dwtag  DW_TAG_member
    3850                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    3851                    .dwattr $C$DW$212, DW_AT_name("captureRegister")
    3852                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("captureRegister")
    3853                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3854                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3855                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3856                    .dwattr $C$DW$212, DW_AT_decl_line(0xa0)
    3857                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3858            
    3859            $C$DW$213       .dwtag  DW_TAG_member
    3860                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    3861                    .dwattr $C$DW$213, DW_AT_name("captureMode")
    3862                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("captureMode")
    3863                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3864                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3865                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3866                    .dwattr $C$DW$213, DW_AT_decl_line(0xa7)
    3867                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    3868            
    3869            $C$DW$214       .dwtag  DW_TAG_member
    3870                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    3871                    .dwattr $C$DW$214, DW_AT_name("captureInputSelect")
    3872                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("captureInputSelect")
    3873                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3874                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3875                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3876                    .dwattr $C$DW$214, DW_AT_decl_line(0xae)
    3877                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    3878            
    3879            $C$DW$215       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   76

    3880                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    3881                    .dwattr $C$DW$215, DW_AT_name("synchronizeCaptureSource")
    3882                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3883                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3884                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3885                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3886                    .dwattr $C$DW$215, DW_AT_decl_line(0xb3)
    3887                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3888            
    3889            $C$DW$216       .dwtag  DW_TAG_member
    3890                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    3891                    .dwattr $C$DW$216, DW_AT_name("captureInterruptEnable")
    3892                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("captureInterruptEnable")
    3893                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3894                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3895                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3896                    .dwattr $C$DW$216, DW_AT_decl_line(0xb8)
    3897                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    3898            
    3899            $C$DW$217       .dwtag  DW_TAG_member
    3900                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    3901                    .dwattr $C$DW$217, DW_AT_name("captureOutputMode")
    3902                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("captureOutputMode")
    3903                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3904                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3905                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3906                    .dwattr $C$DW$217, DW_AT_decl_line(0xc3)
    3907                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    3908            
    3909                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3910                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3911                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3912                    .dwendtag $C$DW$T$35
    3913            
    3914            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3915                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3916                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    3917                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3918                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3919                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3920                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3921            
    3922            
    3923            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3924                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3925                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3926            $C$DW$218       .dwtag  DW_TAG_member
    3927                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    3928                    .dwattr $C$DW$218, DW_AT_name("compareRegister")
    3929                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("compareRegister")
    3930                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3931                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3932                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3933                    .dwattr $C$DW$218, DW_AT_decl_line(0x146)
    3934                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   77

    3935            
    3936            $C$DW$219       .dwtag  DW_TAG_member
    3937                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    3938                    .dwattr $C$DW$219, DW_AT_name("compareInterruptEnable")
    3939                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("compareInterruptEnable")
    3940                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3941                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3942                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3943                    .dwattr $C$DW$219, DW_AT_decl_line(0x14b)
    3944                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3945            
    3946            $C$DW$220       .dwtag  DW_TAG_member
    3947                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    3948                    .dwattr $C$DW$220, DW_AT_name("compareOutputMode")
    3949                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("compareOutputMode")
    3950                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3951                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3952                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3953                    .dwattr $C$DW$220, DW_AT_decl_line(0x156)
    3954                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    3955            
    3956            $C$DW$221       .dwtag  DW_TAG_member
    3957                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    3958                    .dwattr $C$DW$221, DW_AT_name("compareValue")
    3959                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("compareValue")
    3960                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3961                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3962                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3963                    .dwattr $C$DW$221, DW_AT_decl_line(0x158)
    3964                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    3965            
    3966                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3967                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3968                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3969                    .dwendtag $C$DW$T$36
    3970            
    3971            $C$DW$T$70      .dwtag  DW_TAG_typedef
    3972                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    3973                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    3974                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3975                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3976                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    3977                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3978            
    3979            
    3980            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3981                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    3982                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    3983            $C$DW$222       .dwtag  DW_TAG_member
    3984                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    3985                    .dwattr $C$DW$222, DW_AT_name("clockSource")
    3986                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("clockSource")
    3987                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3988                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3989                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   78

    3990                    .dwattr $C$DW$222, DW_AT_decl_line(0xd3)
    3991                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    3992            
    3993            $C$DW$223       .dwtag  DW_TAG_member
    3994                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    3995                    .dwattr $C$DW$223, DW_AT_name("clockSourceDivider")
    3996                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("clockSourceDivider")
    3997                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3998                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3999                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4000                    .dwattr $C$DW$223, DW_AT_decl_line(0xea)
    4001                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    4002            
    4003            $C$DW$224       .dwtag  DW_TAG_member
    4004                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    4005                    .dwattr $C$DW$224, DW_AT_name("timerInterruptEnable_TBIE")
    4006                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4007                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4008                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4009                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4010                    .dwattr $C$DW$224, DW_AT_decl_line(0xef)
    4011                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    4012            
    4013            $C$DW$225       .dwtag  DW_TAG_member
    4014                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    4015                    .dwattr $C$DW$225, DW_AT_name("timerClear")
    4016                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("timerClear")
    4017                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4018                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4019                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4020                    .dwattr $C$DW$225, DW_AT_decl_line(0xf5)
    4021                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    4022            
    4023            $C$DW$226       .dwtag  DW_TAG_member
    4024                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$30)
    4025                    .dwattr $C$DW$226, DW_AT_name("startTimer")
    4026                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("startTimer")
    4027                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4028                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4029                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4030                    .dwattr $C$DW$226, DW_AT_decl_line(0xf7)
    4031                    .dwattr $C$DW$226, DW_AT_decl_column(0x0a)
    4032            
    4033                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4034                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4035                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4036                    .dwendtag $C$DW$T$37
    4037            
    4038            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4039                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4040                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4041                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4042                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4043                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4044                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   79

    4045            
    4046            
    4047            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4048                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4049                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4050            $C$DW$227       .dwtag  DW_TAG_member
    4051                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4052                    .dwattr $C$DW$227, DW_AT_name("clockSource")
    4053                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("clockSource")
    4054                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4055                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4056                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4057                    .dwattr $C$DW$227, DW_AT_decl_line(0x107)
    4058                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4059            
    4060            $C$DW$228       .dwtag  DW_TAG_member
    4061                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4062                    .dwattr $C$DW$228, DW_AT_name("clockSourceDivider")
    4063                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("clockSourceDivider")
    4064                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4065                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4066                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4067                    .dwattr $C$DW$228, DW_AT_decl_line(0x11e)
    4068                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4069            
    4070            $C$DW$229       .dwtag  DW_TAG_member
    4071                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4072                    .dwattr $C$DW$229, DW_AT_name("timerPeriod")
    4073                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("timerPeriod")
    4074                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4075                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4076                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4077                    .dwattr $C$DW$229, DW_AT_decl_line(0x120)
    4078                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4079            
    4080            $C$DW$230       .dwtag  DW_TAG_member
    4081                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    4082                    .dwattr $C$DW$230, DW_AT_name("timerInterruptEnable_TBIE")
    4083                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4084                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4085                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4086                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4087                    .dwattr $C$DW$230, DW_AT_decl_line(0x125)
    4088                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4089            
    4090            $C$DW$231       .dwtag  DW_TAG_member
    4091                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    4092                    .dwattr $C$DW$231, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4093                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4094                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4095                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4096                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4097                    .dwattr $C$DW$231, DW_AT_decl_line(0x12a)
    4098                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4099            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   80

    4100            $C$DW$232       .dwtag  DW_TAG_member
    4101                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    4102                    .dwattr $C$DW$232, DW_AT_name("timerClear")
    4103                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("timerClear")
    4104                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4105                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4106                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4107                    .dwattr $C$DW$232, DW_AT_decl_line(0x130)
    4108                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    4109            
    4110            $C$DW$233       .dwtag  DW_TAG_member
    4111                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$30)
    4112                    .dwattr $C$DW$233, DW_AT_name("startTimer")
    4113                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("startTimer")
    4114                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4115                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4116                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4117                    .dwattr $C$DW$233, DW_AT_decl_line(0x132)
    4118                    .dwattr $C$DW$233, DW_AT_decl_column(0x0a)
    4119            
    4120                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4121                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4122                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4123                    .dwendtag $C$DW$T$38
    4124            
    4125            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4126                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4127                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4128                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4129                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4130                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4131                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4132            
    4133            
    4134            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4135                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4136                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4137            $C$DW$234       .dwtag  DW_TAG_member
    4138                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4139                    .dwattr $C$DW$234, DW_AT_name("clockSource")
    4140                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("clockSource")
    4141                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4142                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4143                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4144                    .dwattr $C$DW$234, DW_AT_decl_line(0x60)
    4145                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4146            
    4147            $C$DW$235       .dwtag  DW_TAG_member
    4148                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    4149                    .dwattr $C$DW$235, DW_AT_name("clockSourceDivider")
    4150                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("clockSourceDivider")
    4151                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4152                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4153                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4154                    .dwattr $C$DW$235, DW_AT_decl_line(0x77)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   81

    4155                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    4156            
    4157            $C$DW$236       .dwtag  DW_TAG_member
    4158                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4159                    .dwattr $C$DW$236, DW_AT_name("timerPeriod")
    4160                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("timerPeriod")
    4161                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4162                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4163                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4164                    .dwattr $C$DW$236, DW_AT_decl_line(0x7a)
    4165                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4166            
    4167            $C$DW$237       .dwtag  DW_TAG_member
    4168                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    4169                    .dwattr $C$DW$237, DW_AT_name("timerInterruptEnable_TBIE")
    4170                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4171                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4172                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4173                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4174                    .dwattr $C$DW$237, DW_AT_decl_line(0x7f)
    4175                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    4176            
    4177            $C$DW$238       .dwtag  DW_TAG_member
    4178                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    4179                    .dwattr $C$DW$238, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4180                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4181                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4182                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4183                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4184                    .dwattr $C$DW$238, DW_AT_decl_line(0x84)
    4185                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    4186            
    4187            $C$DW$239       .dwtag  DW_TAG_member
    4188                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4189                    .dwattr $C$DW$239, DW_AT_name("timerClear")
    4190                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("timerClear")
    4191                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4192                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4193                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4194                    .dwattr $C$DW$239, DW_AT_decl_line(0x8a)
    4195                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    4196            
    4197            $C$DW$240       .dwtag  DW_TAG_member
    4198                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$30)
    4199                    .dwattr $C$DW$240, DW_AT_name("startTimer")
    4200                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("startTimer")
    4201                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4202                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4203                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4204                    .dwattr $C$DW$240, DW_AT_decl_line(0x8c)
    4205                    .dwattr $C$DW$240, DW_AT_decl_column(0x0a)
    4206            
    4207                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4208                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4209                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   82

    4210                    .dwendtag $C$DW$T$39
    4211            
    4212            $C$DW$T$73      .dwtag  DW_TAG_typedef
    4213                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    4214                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    4215                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4216                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4217                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    4218                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4219            
    4220            
    4221            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4222                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    4223                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4224            $C$DW$241       .dwtag  DW_TAG_member
    4225                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    4226                    .dwattr $C$DW$241, DW_AT_name("clockSource")
    4227                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("clockSource")
    4228                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4229                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4230                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4231                    .dwattr $C$DW$241, DW_AT_decl_line(0x20)
    4232                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4233            
    4234            $C$DW$242       .dwtag  DW_TAG_member
    4235                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$27)
    4236                    .dwattr $C$DW$242, DW_AT_name("clockSourceDivider")
    4237                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("clockSourceDivider")
    4238                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4239                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4240                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4241                    .dwattr $C$DW$242, DW_AT_decl_line(0x37)
    4242                    .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
    4243            
    4244            $C$DW$243       .dwtag  DW_TAG_member
    4245                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    4246                    .dwattr $C$DW$243, DW_AT_name("timerPeriod")
    4247                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("timerPeriod")
    4248                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4249                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4250                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4251                    .dwattr $C$DW$243, DW_AT_decl_line(0x39)
    4252                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    4253            
    4254            $C$DW$244       .dwtag  DW_TAG_member
    4255                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    4256                    .dwattr $C$DW$244, DW_AT_name("compareRegister")
    4257                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("compareRegister")
    4258                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4259                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4260                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4261                    .dwattr $C$DW$244, DW_AT_decl_line(0x44)
    4262                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    4263            
    4264            $C$DW$245       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   83

    4265                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    4266                    .dwattr $C$DW$245, DW_AT_name("compareOutputMode")
    4267                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("compareOutputMode")
    4268                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4269                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4270                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4271                    .dwattr $C$DW$245, DW_AT_decl_line(0x4f)
    4272                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    4273            
    4274            $C$DW$246       .dwtag  DW_TAG_member
    4275                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    4276                    .dwattr $C$DW$246, DW_AT_name("dutyCycle")
    4277                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("dutyCycle")
    4278                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4279                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4280                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4281                    .dwattr $C$DW$246, DW_AT_decl_line(0x51)
    4282                    .dwattr $C$DW$246, DW_AT_decl_column(0x0e)
    4283            
    4284                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4285                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    4286                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4287                    .dwendtag $C$DW$T$40
    4288            
    4289            $C$DW$T$74      .dwtag  DW_TAG_typedef
    4290                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    4291                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    4292                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4293                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4294                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    4295                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4296            
    4297            
    4298            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4299                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4300                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4301            $C$DW$247       .dwtag  DW_TAG_member
    4302                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$24)
    4303                    .dwattr $C$DW$247, DW_AT_name("selectClockSource")
    4304                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("selectClockSource")
    4305                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4306                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4307                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4308                    .dwattr $C$DW$247, DW_AT_decl_line(0x1c)
    4309                    .dwattr $C$DW$247, DW_AT_decl_column(0x0d)
    4310            
    4311            $C$DW$248       .dwtag  DW_TAG_member
    4312                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4313                    .dwattr $C$DW$248, DW_AT_name("clockPrescalar")
    4314                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("clockPrescalar")
    4315                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4316                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4317                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4318                    .dwattr $C$DW$248, DW_AT_decl_line(0x1e)
    4319                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   84

    4320            
    4321            $C$DW$249       .dwtag  DW_TAG_member
    4322                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$24)
    4323                    .dwattr $C$DW$249, DW_AT_name("firstModReg")
    4324                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("firstModReg")
    4325                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4326                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4327                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4328                    .dwattr $C$DW$249, DW_AT_decl_line(0x22)
    4329                    .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    4330            
    4331            $C$DW$250       .dwtag  DW_TAG_member
    4332                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$24)
    4333                    .dwattr $C$DW$250, DW_AT_name("secondModReg")
    4334                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("secondModReg")
    4335                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4336                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4337                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4338                    .dwattr $C$DW$250, DW_AT_decl_line(0x26)
    4339                    .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    4340            
    4341            $C$DW$251       .dwtag  DW_TAG_member
    4342                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    4343                    .dwattr $C$DW$251, DW_AT_name("parity")
    4344                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("parity")
    4345                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4346                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4347                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4348                    .dwattr $C$DW$251, DW_AT_decl_line(0x2c)
    4349                    .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
    4350            
    4351            $C$DW$252       .dwtag  DW_TAG_member
    4352                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    4353                    .dwattr $C$DW$252, DW_AT_name("msborLsbFirst")
    4354                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("msborLsbFirst")
    4355                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4356                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4357                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4358                    .dwattr $C$DW$252, DW_AT_decl_line(0x31)
    4359                    .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
    4360            
    4361            $C$DW$253       .dwtag  DW_TAG_member
    4362                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    4363                    .dwattr $C$DW$253, DW_AT_name("numberofStopBits")
    4364                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("numberofStopBits")
    4365                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4366                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4367                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4368                    .dwattr $C$DW$253, DW_AT_decl_line(0x36)
    4369                    .dwattr $C$DW$253, DW_AT_decl_column(0x0d)
    4370            
    4371            $C$DW$254       .dwtag  DW_TAG_member
    4372                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$24)
    4373                    .dwattr $C$DW$254, DW_AT_name("uartMode")
    4374                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("uartMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   85

    4375                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4376                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4377                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4378                    .dwattr $C$DW$254, DW_AT_decl_line(0x3d)
    4379                    .dwattr $C$DW$254, DW_AT_decl_column(0x0d)
    4380            
    4381            $C$DW$255       .dwtag  DW_TAG_member
    4382                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$24)
    4383                    .dwattr $C$DW$255, DW_AT_name("overSampling")
    4384                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("overSampling")
    4385                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4386                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4387                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4388                    .dwattr $C$DW$255, DW_AT_decl_line(0x42)
    4389                    .dwattr $C$DW$255, DW_AT_decl_column(0x0d)
    4390            
    4391                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4392                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4393                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4394                    .dwendtag $C$DW$T$41
    4395            
    4396            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4397                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4398                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4399                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4400                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4401                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4402                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4403            
    4404            
    4405            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4406                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4407                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4408            $C$DW$256       .dwtag  DW_TAG_member
    4409                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$43)
    4410                    .dwattr $C$DW$256, DW_AT_name("clockSourceFrequency")
    4411                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("clockSourceFrequency")
    4412                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4413                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4414                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4415                    .dwattr $C$DW$256, DW_AT_decl_line(0x31)
    4416                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4417            
    4418            $C$DW$257       .dwtag  DW_TAG_member
    4419                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$43)
    4420                    .dwattr $C$DW$257, DW_AT_name("desiredSpiClock")
    4421                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("desiredSpiClock")
    4422                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4423                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4424                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4425                    .dwattr $C$DW$257, DW_AT_decl_line(0x33)
    4426                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4427            
    4428                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4429                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   86

    4430                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4431                    .dwendtag $C$DW$T$44
    4432            
    4433            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4434                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4435                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4436                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4437                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4438                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4439                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4440            
    4441            
    4442            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4443                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4444                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4445            $C$DW$258       .dwtag  DW_TAG_member
    4446                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    4447                    .dwattr $C$DW$258, DW_AT_name("selectClockSource")
    4448                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("selectClockSource")
    4449                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4450                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4451                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4452                    .dwattr $C$DW$258, DW_AT_decl_line(0x14)
    4453                    .dwattr $C$DW$258, DW_AT_decl_column(0x0d)
    4454            
    4455            $C$DW$259       .dwtag  DW_TAG_member
    4456                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$43)
    4457                    .dwattr $C$DW$259, DW_AT_name("clockSourceFrequency")
    4458                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("clockSourceFrequency")
    4459                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4460                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4461                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4462                    .dwattr $C$DW$259, DW_AT_decl_line(0x16)
    4463                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4464            
    4465            $C$DW$260       .dwtag  DW_TAG_member
    4466                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$43)
    4467                    .dwattr $C$DW$260, DW_AT_name("desiredSpiClock")
    4468                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("desiredSpiClock")
    4469                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4470                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4471                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4472                    .dwattr $C$DW$260, DW_AT_decl_line(0x18)
    4473                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    4474            
    4475            $C$DW$261       .dwtag  DW_TAG_member
    4476                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$24)
    4477                    .dwattr $C$DW$261, DW_AT_name("msbFirst")
    4478                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("msbFirst")
    4479                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4480                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4481                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4482                    .dwattr $C$DW$261, DW_AT_decl_line(0x1d)
    4483                    .dwattr $C$DW$261, DW_AT_decl_column(0x0d)
    4484            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Output_Voltage_Set.asm                                               PAGE   87

