MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:01 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Power_Limit.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("TB0CCR6")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("TB0CCR6")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$111)

    3628            $C$DW$204       .dwtag  DW_TAG_enumerator
    3629                    .dwattr $C$DW$204, DW_AT_name("crc2")
    3630                    .dwattr $C$DW$204, DW_AT_const_value(0x06)
    3631                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3632                    .dwattr $C$DW$204, DW_AT_decl_line(0x76)
    3633                    .dwattr $C$DW$204, DW_AT_decl_column(0x05)
    3634            
    3635            $C$DW$205       .dwtag  DW_TAG_enumerator
    3636                    .dwattr $C$DW$205, DW_AT_name("ack")
    3637                    .dwattr $C$DW$205, DW_AT_const_value(0x07)
    3638                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3639                    .dwattr $C$DW$205, DW_AT_decl_line(0x77)
    3640                    .dwattr $C$DW$205, DW_AT_decl_column(0x05)
    3641            
    3642            $C$DW$206       .dwtag  DW_TAG_enumerator
    3643                    .dwattr $C$DW$206, DW_AT_name("var")
    3644                    .dwattr $C$DW$206, DW_AT_const_value(0x08)
    3645                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3646                    .dwattr $C$DW$206, DW_AT_decl_line(0x78)
    3647                    .dwattr $C$DW$206, DW_AT_decl_column(0x05)
    3648            
    3649            $C$DW$207       .dwtag  DW_TAG_enumerator
    3650                    .dwattr $C$DW$207, DW_AT_name("UGmsg")
    3651                    .dwattr $C$DW$207, DW_AT_const_value(0x09)
    3652                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3653                    .dwattr $C$DW$207, DW_AT_decl_line(0x79)
    3654                    .dwattr $C$DW$207, DW_AT_decl_column(0x05)
    3655            
    3656                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3657                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    3658                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   75

    3659                    .dwendtag $C$DW$T$57
    3660            
    3661            $C$DW$T$58      .dwtag  DW_TAG_typedef
    3662                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    3663                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3664                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3665                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3666                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    3667                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3668            
    3669            
    3670            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3671                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3672            $C$DW$208       .dwtag  DW_TAG_enumerator
    3673                    .dwattr $C$DW$208, DW_AT_name("init")
    3674                    .dwattr $C$DW$208, DW_AT_const_value(0x00)
    3675                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3676                    .dwattr $C$DW$208, DW_AT_decl_line(0x80)
    3677                    .dwattr $C$DW$208, DW_AT_decl_column(0x05)
    3678            
    3679            $C$DW$209       .dwtag  DW_TAG_enumerator
    3680                    .dwattr $C$DW$209, DW_AT_name("running")
    3681                    .dwattr $C$DW$209, DW_AT_const_value(0x01)
    3682                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3683                    .dwattr $C$DW$209, DW_AT_decl_line(0x80)
    3684                    .dwattr $C$DW$209, DW_AT_decl_column(0x0b)
    3685            
    3686            $C$DW$210       .dwtag  DW_TAG_enumerator
    3687                    .dwattr $C$DW$210, DW_AT_name("wait")
    3688                    .dwattr $C$DW$210, DW_AT_const_value(0x02)
    3689                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3690                    .dwattr $C$DW$210, DW_AT_decl_line(0x80)
    3691                    .dwattr $C$DW$210, DW_AT_decl_column(0x14)
    3692            
    3693                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3694                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    3695                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3696                    .dwendtag $C$DW$T$59
    3697            
    3698            $C$DW$T$60      .dwtag  DW_TAG_typedef
    3699                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    3700                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3701                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3702                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3703                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    3704                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3705            
    3706            
    3707            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3708                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3709            $C$DW$211       .dwtag  DW_TAG_member
    3710                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$14)
    3711                    .dwattr $C$DW$211, DW_AT_name("__max_align1")
    3712                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("__max_align1")
    3713                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   76

    3714                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3715                    .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3716                    .dwattr $C$DW$211, DW_AT_decl_line(0x7b)
    3717                    .dwattr $C$DW$211, DW_AT_decl_column(0x0c)
    3718            
    3719            $C$DW$212       .dwtag  DW_TAG_member
    3720                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$18)
    3721                    .dwattr $C$DW$212, DW_AT_name("__max_align2")
    3722                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("__max_align2")
    3723                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3724                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3725                    .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3726                    .dwattr $C$DW$212, DW_AT_decl_line(0x7c)
    3727                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    3728            
    3729                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3730                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3731                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3732                    .dwendtag $C$DW$T$22
    3733            
    3734            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3735                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3736                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3737                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3738                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3739                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3740                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3741            
    3742            
    3743            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3744                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3745                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    3746            $C$DW$213       .dwtag  DW_TAG_member
    3747                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$24)
    3748                    .dwattr $C$DW$213, DW_AT_name("memoryBufferControlIndex")
    3749                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3750                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3751                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3752                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3753                    .dwattr $C$DW$213, DW_AT_decl_line(0x27)
    3754                    .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    3755            
    3756            $C$DW$214       .dwtag  DW_TAG_member
    3757                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$24)
    3758                    .dwattr $C$DW$214, DW_AT_name("inputSourceSelect")
    3759                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("inputSourceSelect")
    3760                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3761                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3762                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3763                    .dwattr $C$DW$214, DW_AT_decl_line(0x3b)
    3764                    .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    3765            
    3766            $C$DW$215       .dwtag  DW_TAG_member
    3767                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$24)
    3768                    .dwattr $C$DW$215, DW_AT_name("positiveRefVoltageSourceSelect")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   77

    3769                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3770                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3771                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3772                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3773                    .dwattr $C$DW$215, DW_AT_decl_line(0x42)
    3774                    .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    3775            
    3776            $C$DW$216       .dwtag  DW_TAG_member
    3777                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$24)
    3778                    .dwattr $C$DW$216, DW_AT_name("negativeRefVoltageSourceSelect")
    3779                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3780                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3781                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3782                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3783                    .dwattr $C$DW$216, DW_AT_decl_line(0x48)
    3784                    .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    3785            
    3786            $C$DW$217       .dwtag  DW_TAG_member
    3787                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$24)
    3788                    .dwattr $C$DW$217, DW_AT_name("endOfSequence")
    3789                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("endOfSequence")
    3790                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3791                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3792                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3793                    .dwattr $C$DW$217, DW_AT_decl_line(0x51)
    3794                    .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    3795            
    3796                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3797                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3798                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3799                    .dwendtag $C$DW$T$25
    3800            
    3801            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3802                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3803                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3804                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3805                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3806                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3807                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3808            
    3809            
    3810            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3811                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3812                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3813            $C$DW$218       .dwtag  DW_TAG_member
    3814                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    3815                    .dwattr $C$DW$218, DW_AT_name("captureRegister")
    3816                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("captureRegister")
    3817                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3818                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3819                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3820                    .dwattr $C$DW$218, DW_AT_decl_line(0x58)
    3821                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    3822            
    3823            $C$DW$219       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   78

    3824                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    3825                    .dwattr $C$DW$219, DW_AT_name("captureMode")
    3826                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("captureMode")
    3827                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3828                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3829                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3830                    .dwattr $C$DW$219, DW_AT_decl_line(0x5f)
    3831                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3832            
    3833            $C$DW$220       .dwtag  DW_TAG_member
    3834                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    3835                    .dwattr $C$DW$220, DW_AT_name("captureInputSelect")
    3836                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("captureInputSelect")
    3837                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3838                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3839                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3840                    .dwattr $C$DW$220, DW_AT_decl_line(0x66)
    3841                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    3842            
    3843            $C$DW$221       .dwtag  DW_TAG_member
    3844                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    3845                    .dwattr $C$DW$221, DW_AT_name("synchronizeCaptureSource")
    3846                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3847                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3848                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3849                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3850                    .dwattr $C$DW$221, DW_AT_decl_line(0x6b)
    3851                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    3852            
    3853            $C$DW$222       .dwtag  DW_TAG_member
    3854                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    3855                    .dwattr $C$DW$222, DW_AT_name("captureInterruptEnable")
    3856                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("captureInterruptEnable")
    3857                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3858                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3859                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3860                    .dwattr $C$DW$222, DW_AT_decl_line(0x70)
    3861                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    3862            
    3863            $C$DW$223       .dwtag  DW_TAG_member
    3864                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    3865                    .dwattr $C$DW$223, DW_AT_name("captureOutputMode")
    3866                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("captureOutputMode")
    3867                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3868                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3869                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3870                    .dwattr $C$DW$223, DW_AT_decl_line(0x7b)
    3871                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    3872            
    3873                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3874                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3875                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3876                    .dwendtag $C$DW$T$28
    3877            
    3878            $C$DW$T$63      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   79

    3879                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3880                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3881                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3882                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3883                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3884                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3885            
    3886            
    3887            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3888                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    3889                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3890            $C$DW$224       .dwtag  DW_TAG_member
    3891                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    3892                    .dwattr $C$DW$224, DW_AT_name("compareRegister")
    3893                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("compareRegister")
    3894                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3895                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3896                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3897                    .dwattr $C$DW$224, DW_AT_decl_line(0x145)
    3898                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    3899            
    3900            $C$DW$225       .dwtag  DW_TAG_member
    3901                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    3902                    .dwattr $C$DW$225, DW_AT_name("compareInterruptEnable")
    3903                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("compareInterruptEnable")
    3904                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3905                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3906                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3907                    .dwattr $C$DW$225, DW_AT_decl_line(0x14a)
    3908                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    3909            
    3910            $C$DW$226       .dwtag  DW_TAG_member
    3911                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    3912                    .dwattr $C$DW$226, DW_AT_name("compareOutputMode")
    3913                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("compareOutputMode")
    3914                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3915                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3916                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3917                    .dwattr $C$DW$226, DW_AT_decl_line(0x155)
    3918                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    3919            
    3920            $C$DW$227       .dwtag  DW_TAG_member
    3921                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    3922                    .dwattr $C$DW$227, DW_AT_name("compareValue")
    3923                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("compareValue")
    3924                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3925                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3926                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3927                    .dwattr $C$DW$227, DW_AT_decl_line(0x157)
    3928                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    3929            
    3930                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3931                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    3932                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3933                    .dwendtag $C$DW$T$29
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   80

    3934            
    3935            $C$DW$T$64      .dwtag  DW_TAG_typedef
    3936                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    3937                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    3938                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3939                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3940                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    3941                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3942            
    3943            
    3944            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3945                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    3946                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3947            $C$DW$228       .dwtag  DW_TAG_member
    3948                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    3949                    .dwattr $C$DW$228, DW_AT_name("clockSource")
    3950                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("clockSource")
    3951                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3952                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3953                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3954                    .dwattr $C$DW$228, DW_AT_decl_line(0x20)
    3955                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    3956            
    3957            $C$DW$229       .dwtag  DW_TAG_member
    3958                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    3959                    .dwattr $C$DW$229, DW_AT_name("clockSourceDivider")
    3960                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("clockSourceDivider")
    3961                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3962                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3963                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3964                    .dwattr $C$DW$229, DW_AT_decl_line(0x37)
    3965                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    3966            
    3967            $C$DW$230       .dwtag  DW_TAG_member
    3968                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    3969                    .dwattr $C$DW$230, DW_AT_name("timerInterruptEnable_TAIE")
    3970                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3971                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3972                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3973                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3974                    .dwattr $C$DW$230, DW_AT_decl_line(0x3c)
    3975                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    3976            
    3977            $C$DW$231       .dwtag  DW_TAG_member
    3978                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    3979                    .dwattr $C$DW$231, DW_AT_name("timerClear")
    3980                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("timerClear")
    3981                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3982                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3983                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3984                    .dwattr $C$DW$231, DW_AT_decl_line(0x42)
    3985                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    3986            
    3987            $C$DW$232       .dwtag  DW_TAG_member
    3988                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   81

    3989                    .dwattr $C$DW$232, DW_AT_name("startTimer")
    3990                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("startTimer")
    3991                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3992                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3993                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3994                    .dwattr $C$DW$232, DW_AT_decl_line(0x44)
    3995                    .dwattr $C$DW$232, DW_AT_decl_column(0x0a)
    3996            
    3997                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3998                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    3999                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4000                    .dwendtag $C$DW$T$31
    4001            
    4002            $C$DW$T$65      .dwtag  DW_TAG_typedef
    4003                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    4004                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    4005                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4006                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4007                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    4008                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4009            
    4010            
    4011            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4012                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    4013                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    4014            $C$DW$233       .dwtag  DW_TAG_member
    4015                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    4016                    .dwattr $C$DW$233, DW_AT_name("clockSource")
    4017                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("clockSource")
    4018                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4019                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4020                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4021                    .dwattr $C$DW$233, DW_AT_decl_line(0x8b)
    4022                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4023            
    4024            $C$DW$234       .dwtag  DW_TAG_member
    4025                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4026                    .dwattr $C$DW$234, DW_AT_name("clockSourceDivider")
    4027                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("clockSourceDivider")
    4028                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4029                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4030                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4031                    .dwattr $C$DW$234, DW_AT_decl_line(0xa2)
    4032                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4033            
    4034            $C$DW$235       .dwtag  DW_TAG_member
    4035                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    4036                    .dwattr $C$DW$235, DW_AT_name("timerPeriod")
    4037                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("timerPeriod")
    4038                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4039                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4040                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4041                    .dwattr $C$DW$235, DW_AT_decl_line(0xa4)
    4042                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    4043            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   82

    4044            $C$DW$236       .dwtag  DW_TAG_member
    4045                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4046                    .dwattr $C$DW$236, DW_AT_name("timerInterruptEnable_TAIE")
    4047                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4048                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4049                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4050                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4051                    .dwattr $C$DW$236, DW_AT_decl_line(0xa9)
    4052                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4053            
    4054            $C$DW$237       .dwtag  DW_TAG_member
    4055                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    4056                    .dwattr $C$DW$237, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4057                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4058                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4059                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4060                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4061                    .dwattr $C$DW$237, DW_AT_decl_line(0xae)
    4062                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    4063            
    4064            $C$DW$238       .dwtag  DW_TAG_member
    4065                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    4066                    .dwattr $C$DW$238, DW_AT_name("timerClear")
    4067                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("timerClear")
    4068                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4069                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4070                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4071                    .dwattr $C$DW$238, DW_AT_decl_line(0xb4)
    4072                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    4073            
    4074            $C$DW$239       .dwtag  DW_TAG_member
    4075                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$30)
    4076                    .dwattr $C$DW$239, DW_AT_name("startTimer")
    4077                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("startTimer")
    4078                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4079                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4080                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4081                    .dwattr $C$DW$239, DW_AT_decl_line(0xb6)
    4082                    .dwattr $C$DW$239, DW_AT_decl_column(0x0a)
    4083            
    4084                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4085                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    4086                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4087                    .dwendtag $C$DW$T$32
    4088            
    4089            $C$DW$T$66      .dwtag  DW_TAG_typedef
    4090                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    4091                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    4092                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4093                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4094                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    4095                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    4096            
    4097            
    4098            $C$DW$T$33      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   83

    4099                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    4100                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    4101            $C$DW$240       .dwtag  DW_TAG_member
    4102                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    4103                    .dwattr $C$DW$240, DW_AT_name("clockSource")
    4104                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("clockSource")
    4105                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4106                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4107                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4108                    .dwattr $C$DW$240, DW_AT_decl_line(0x105)
    4109                    .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    4110            
    4111            $C$DW$241       .dwtag  DW_TAG_member
    4112                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    4113                    .dwattr $C$DW$241, DW_AT_name("clockSourceDivider")
    4114                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("clockSourceDivider")
    4115                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4116                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4117                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4118                    .dwattr $C$DW$241, DW_AT_decl_line(0x11c)
    4119                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4120            
    4121            $C$DW$242       .dwtag  DW_TAG_member
    4122                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$27)
    4123                    .dwattr $C$DW$242, DW_AT_name("timerPeriod")
    4124                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("timerPeriod")
    4125                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4126                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4127                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4128                    .dwattr $C$DW$242, DW_AT_decl_line(0x11f)
    4129                    .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
    4130            
    4131            $C$DW$243       .dwtag  DW_TAG_member
    4132                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    4133                    .dwattr $C$DW$243, DW_AT_name("timerInterruptEnable_TAIE")
    4134                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4135                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4136                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4137                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4138                    .dwattr $C$DW$243, DW_AT_decl_line(0x124)
    4139                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    4140            
    4141            $C$DW$244       .dwtag  DW_TAG_member
    4142                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    4143                    .dwattr $C$DW$244, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4144                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4145                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4146                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4147                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4148                    .dwattr $C$DW$244, DW_AT_decl_line(0x129)
    4149                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    4150            
    4151            $C$DW$245       .dwtag  DW_TAG_member
    4152                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    4153                    .dwattr $C$DW$245, DW_AT_name("timerClear")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   84

    4154                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("timerClear")
    4155                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4156                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4157                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4158                    .dwattr $C$DW$245, DW_AT_decl_line(0x12f)
    4159                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    4160            
    4161            $C$DW$246       .dwtag  DW_TAG_member
    4162                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$30)
    4163                    .dwattr $C$DW$246, DW_AT_name("startTimer")
    4164                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("startTimer")
    4165                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4166                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4167                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4168                    .dwattr $C$DW$246, DW_AT_decl_line(0x131)
    4169                    .dwattr $C$DW$246, DW_AT_decl_column(0x0a)
    4170            
    4171                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4172                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    4173                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4174                    .dwendtag $C$DW$T$33
    4175            
    4176            $C$DW$T$67      .dwtag  DW_TAG_typedef
    4177                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    4178                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    4179                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4180                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4181                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    4182                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    4183            
    4184            
    4185            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4186                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    4187                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    4188            $C$DW$247       .dwtag  DW_TAG_member
    4189                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    4190                    .dwattr $C$DW$247, DW_AT_name("clockSource")
    4191                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("clockSource")
    4192                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4193                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4194                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4195                    .dwattr $C$DW$247, DW_AT_decl_line(0xc5)
    4196                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4197            
    4198            $C$DW$248       .dwtag  DW_TAG_member
    4199                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4200                    .dwattr $C$DW$248, DW_AT_name("clockSourceDivider")
    4201                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("clockSourceDivider")
    4202                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4203                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4204                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4205                    .dwattr $C$DW$248, DW_AT_decl_line(0xdc)
    4206                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4207            
    4208            $C$DW$249       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   85

    4209                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    4210                    .dwattr $C$DW$249, DW_AT_name("timerPeriod")
    4211                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("timerPeriod")
    4212                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4213                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4214                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4215                    .dwattr $C$DW$249, DW_AT_decl_line(0xde)
    4216                    .dwattr $C$DW$249, DW_AT_decl_column(0x0e)
    4217            
    4218            $C$DW$250       .dwtag  DW_TAG_member
    4219                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    4220                    .dwattr $C$DW$250, DW_AT_name("compareRegister")
    4221                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("compareRegister")
    4222                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4223                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4224                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4225                    .dwattr $C$DW$250, DW_AT_decl_line(0xe9)
    4226                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4227            
    4228            $C$DW$251       .dwtag  DW_TAG_member
    4229                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4230                    .dwattr $C$DW$251, DW_AT_name("compareOutputMode")
    4231                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("compareOutputMode")
    4232                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4233                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4234                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4235                    .dwattr $C$DW$251, DW_AT_decl_line(0xf4)
    4236                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4237            
    4238            $C$DW$252       .dwtag  DW_TAG_member
    4239                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    4240                    .dwattr $C$DW$252, DW_AT_name("dutyCycle")
    4241                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("dutyCycle")
    4242                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4243                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4244                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4245                    .dwattr $C$DW$252, DW_AT_decl_line(0xf6)
    4246                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    4247            
    4248                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4249                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    4250                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4251                    .dwendtag $C$DW$T$34
    4252            
    4253            $C$DW$T$68      .dwtag  DW_TAG_typedef
    4254                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    4255                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    4256                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4257                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4258                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    4259                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    4260            
    4261            
    4262            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4263                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   86

    4264                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    4265            $C$DW$253       .dwtag  DW_TAG_member
    4266                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    4267                    .dwattr $C$DW$253, DW_AT_name("captureRegister")
    4268                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("captureRegister")
    4269                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4270                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4271                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4272                    .dwattr $C$DW$253, DW_AT_decl_line(0xa0)
    4273                    .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    4274            
    4275            $C$DW$254       .dwtag  DW_TAG_member
    4276                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4277                    .dwattr $C$DW$254, DW_AT_name("captureMode")
    4278                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("captureMode")
    4279                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4280                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4281                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4282                    .dwattr $C$DW$254, DW_AT_decl_line(0xa7)
    4283                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4284            
    4285            $C$DW$255       .dwtag  DW_TAG_member
    4286                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4287                    .dwattr $C$DW$255, DW_AT_name("captureInputSelect")
    4288                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("captureInputSelect")
    4289                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4290                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4291                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4292                    .dwattr $C$DW$255, DW_AT_decl_line(0xae)
    4293                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4294            
    4295            $C$DW$256       .dwtag  DW_TAG_member
    4296                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4297                    .dwattr $C$DW$256, DW_AT_name("synchronizeCaptureSource")
    4298                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4299                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4300                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4301                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4302                    .dwattr $C$DW$256, DW_AT_decl_line(0xb3)
    4303                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4304            
    4305            $C$DW$257       .dwtag  DW_TAG_member
    4306                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4307                    .dwattr $C$DW$257, DW_AT_name("captureInterruptEnable")
    4308                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("captureInterruptEnable")
    4309                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4310                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4311                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4312                    .dwattr $C$DW$257, DW_AT_decl_line(0xb8)
    4313                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4314            
    4315            $C$DW$258       .dwtag  DW_TAG_member
    4316                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    4317                    .dwattr $C$DW$258, DW_AT_name("captureOutputMode")
    4318                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("captureOutputMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   87

    4319                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4320                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4321                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4322                    .dwattr $C$DW$258, DW_AT_decl_line(0xc3)
    4323                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    4324            
    4325                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4326                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    4327                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4328                    .dwendtag $C$DW$T$35
    4329            
    4330            $C$DW$T$69      .dwtag  DW_TAG_typedef
    4331                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4332                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4333                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4334                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4335                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4336                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4337            
    4338            
    4339            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4340                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4341                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4342            $C$DW$259       .dwtag  DW_TAG_member
    4343                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    4344                    .dwattr $C$DW$259, DW_AT_name("compareRegister")
    4345                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("compareRegister")
    4346                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4347                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4348                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4349                    .dwattr $C$DW$259, DW_AT_decl_line(0x146)
    4350                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4351            
    4352            $C$DW$260       .dwtag  DW_TAG_member
    4353                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    4354                    .dwattr $C$DW$260, DW_AT_name("compareInterruptEnable")
    4355                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("compareInterruptEnable")
    4356                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4357                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4358                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4359                    .dwattr $C$DW$260, DW_AT_decl_line(0x14b)
    4360                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    4361            
    4362            $C$DW$261       .dwtag  DW_TAG_member
    4363                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    4364                    .dwattr $C$DW$261, DW_AT_name("compareOutputMode")
    4365                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("compareOutputMode")
    4366                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4367                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4368                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4369                    .dwattr $C$DW$261, DW_AT_decl_line(0x156)
    4370                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    4371            
    4372            $C$DW$262       .dwtag  DW_TAG_member
    4373                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   88

    4374                    .dwattr $C$DW$262, DW_AT_name("compareValue")
    4375                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("compareValue")
    4376                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4377                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4378                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4379                    .dwattr $C$DW$262, DW_AT_decl_line(0x158)
    4380                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    4381            
    4382                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4383                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4384                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4385                    .dwendtag $C$DW$T$36
    4386            
    4387            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4388                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4389                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    4390                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4391                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4392                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4393                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4394            
    4395            
    4396            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4397                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4398                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4399            $C$DW$263       .dwtag  DW_TAG_member
    4400                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    4401                    .dwattr $C$DW$263, DW_AT_name("clockSource")
    4402                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("clockSource")
    4403                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4404                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4405                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4406                    .dwattr $C$DW$263, DW_AT_decl_line(0xd3)
    4407                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    4408            
    4409            $C$DW$264       .dwtag  DW_TAG_member
    4410                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    4411                    .dwattr $C$DW$264, DW_AT_name("clockSourceDivider")
    4412                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("clockSourceDivider")
    4413                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4414                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4415                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4416                    .dwattr $C$DW$264, DW_AT_decl_line(0xea)
    4417                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    4418            
    4419            $C$DW$265       .dwtag  DW_TAG_member
    4420                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    4421                    .dwattr $C$DW$265, DW_AT_name("timerInterruptEnable_TBIE")
    4422                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4423                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4424                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4425                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4426                    .dwattr $C$DW$265, DW_AT_decl_line(0xef)
    4427                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    4428            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   89

    4429            $C$DW$266       .dwtag  DW_TAG_member
    4430                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    4431                    .dwattr $C$DW$266, DW_AT_name("timerClear")
    4432                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("timerClear")
    4433                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4434                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4435                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4436                    .dwattr $C$DW$266, DW_AT_decl_line(0xf5)
    4437                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    4438            
    4439            $C$DW$267       .dwtag  DW_TAG_member
    4440                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$30)
    4441                    .dwattr $C$DW$267, DW_AT_name("startTimer")
    4442                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("startTimer")
    4443                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4444                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4445                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4446                    .dwattr $C$DW$267, DW_AT_decl_line(0xf7)
    4447                    .dwattr $C$DW$267, DW_AT_decl_column(0x0a)
    4448            
    4449                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4450                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4451                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4452                    .dwendtag $C$DW$T$37
    4453            
    4454            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4455                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4456                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4457                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4458                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4459                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4460                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4461            
    4462            
    4463            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4464                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4465                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4466            $C$DW$268       .dwtag  DW_TAG_member
    4467                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    4468                    .dwattr $C$DW$268, DW_AT_name("clockSource")
    4469                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("clockSource")
    4470                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4471                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4472                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4473                    .dwattr $C$DW$268, DW_AT_decl_line(0x107)
    4474                    .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    4475            
    4476            $C$DW$269       .dwtag  DW_TAG_member
    4477                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    4478                    .dwattr $C$DW$269, DW_AT_name("clockSourceDivider")
    4479                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("clockSourceDivider")
    4480                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4481                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4482                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4483                    .dwattr $C$DW$269, DW_AT_decl_line(0x11e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   90

    4484                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    4485            
    4486            $C$DW$270       .dwtag  DW_TAG_member
    4487                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    4488                    .dwattr $C$DW$270, DW_AT_name("timerPeriod")
    4489                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("timerPeriod")
    4490                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4491                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4492                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4493                    .dwattr $C$DW$270, DW_AT_decl_line(0x120)
    4494                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
    4495            
    4496            $C$DW$271       .dwtag  DW_TAG_member
    4497                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    4498                    .dwattr $C$DW$271, DW_AT_name("timerInterruptEnable_TBIE")
    4499                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4500                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4501                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4502                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4503                    .dwattr $C$DW$271, DW_AT_decl_line(0x125)
    4504                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    4505            
    4506            $C$DW$272       .dwtag  DW_TAG_member
    4507                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    4508                    .dwattr $C$DW$272, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4509                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4510                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4511                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4512                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4513                    .dwattr $C$DW$272, DW_AT_decl_line(0x12a)
    4514                    .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
    4515            
    4516            $C$DW$273       .dwtag  DW_TAG_member
    4517                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    4518                    .dwattr $C$DW$273, DW_AT_name("timerClear")
    4519                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("timerClear")
    4520                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4521                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4522                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4523                    .dwattr $C$DW$273, DW_AT_decl_line(0x130)
    4524                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    4525            
    4526            $C$DW$274       .dwtag  DW_TAG_member
    4527                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$30)
    4528                    .dwattr $C$DW$274, DW_AT_name("startTimer")
    4529                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("startTimer")
    4530                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4531                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4532                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4533                    .dwattr $C$DW$274, DW_AT_decl_line(0x132)
    4534                    .dwattr $C$DW$274, DW_AT_decl_column(0x0a)
    4535            
    4536                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4537                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4538                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   91

    4539                    .dwendtag $C$DW$T$38
    4540            
    4541            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4542                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4543                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4544                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4545                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4546                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4547                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    4548            
    4549            
    4550            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4551                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4552                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4553            $C$DW$275       .dwtag  DW_TAG_member
    4554                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$27)
    4555                    .dwattr $C$DW$275, DW_AT_name("clockSource")
    4556                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("clockSource")
    4557                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4558                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4559                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4560                    .dwattr $C$DW$275, DW_AT_decl_line(0x60)
    4561                    .dwattr $C$DW$275, DW_AT_decl_column(0x0e)
    4562            
    4563            $C$DW$276       .dwtag  DW_TAG_member
    4564                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    4565                    .dwattr $C$DW$276, DW_AT_name("clockSourceDivider")
    4566                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("clockSourceDivider")
    4567                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4568                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4569                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4570                    .dwattr $C$DW$276, DW_AT_decl_line(0x77)
    4571                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    4572            
    4573            $C$DW$277       .dwtag  DW_TAG_member
    4574                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    4575                    .dwattr $C$DW$277, DW_AT_name("timerPeriod")
    4576                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("timerPeriod")
    4577                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4578                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4579                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4580                    .dwattr $C$DW$277, DW_AT_decl_line(0x7a)
    4581                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    4582            
    4583            $C$DW$278       .dwtag  DW_TAG_member
    4584                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    4585                    .dwattr $C$DW$278, DW_AT_name("timerInterruptEnable_TBIE")
    4586                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4587                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4588                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4589                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4590                    .dwattr $C$DW$278, DW_AT_decl_line(0x7f)
    4591                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    4592            
    4593            $C$DW$279       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   92

    4594                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    4595                    .dwattr $C$DW$279, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4596                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4597                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4598                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4599                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4600                    .dwattr $C$DW$279, DW_AT_decl_line(0x84)
    4601                    .dwattr $C$DW$279, DW_AT_decl_column(0x0e)
    4602            
    4603            $C$DW$280       .dwtag  DW_TAG_member
    4604                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    4605                    .dwattr $C$DW$280, DW_AT_name("timerClear")
    4606                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("timerClear")
    4607                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4608                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4609                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4610                    .dwattr $C$DW$280, DW_AT_decl_line(0x8a)
    4611                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    4612            
    4613            $C$DW$281       .dwtag  DW_TAG_member
    4614                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$30)
    4615                    .dwattr $C$DW$281, DW_AT_name("startTimer")
    4616                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("startTimer")
    4617                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4618                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4619                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4620                    .dwattr $C$DW$281, DW_AT_decl_line(0x8c)
    4621                    .dwattr $C$DW$281, DW_AT_decl_column(0x0a)
    4622            
    4623                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4624                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4625                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    4626                    .dwendtag $C$DW$T$39
    4627            
    4628            $C$DW$T$73      .dwtag  DW_TAG_typedef
    4629                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    4630                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    4631                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4632                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4633                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    4634                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4635            
    4636            
    4637            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4638                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    4639                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4640            $C$DW$282       .dwtag  DW_TAG_member
    4641                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$27)
    4642                    .dwattr $C$DW$282, DW_AT_name("clockSource")
    4643                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("clockSource")
    4644                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4645                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4646                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4647                    .dwattr $C$DW$282, DW_AT_decl_line(0x20)
    4648                    .dwattr $C$DW$282, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   93

    4649            
    4650            $C$DW$283       .dwtag  DW_TAG_member
    4651                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    4652                    .dwattr $C$DW$283, DW_AT_name("clockSourceDivider")
    4653                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("clockSourceDivider")
    4654                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4655                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4656                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4657                    .dwattr $C$DW$283, DW_AT_decl_line(0x37)
    4658                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    4659            
    4660            $C$DW$284       .dwtag  DW_TAG_member
    4661                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    4662                    .dwattr $C$DW$284, DW_AT_name("timerPeriod")
    4663                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("timerPeriod")
    4664                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4665                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4666                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4667                    .dwattr $C$DW$284, DW_AT_decl_line(0x39)
    4668                    .dwattr $C$DW$284, DW_AT_decl_column(0x0e)
    4669            
    4670            $C$DW$285       .dwtag  DW_TAG_member
    4671                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    4672                    .dwattr $C$DW$285, DW_AT_name("compareRegister")
    4673                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("compareRegister")
    4674                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4675                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4676                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4677                    .dwattr $C$DW$285, DW_AT_decl_line(0x44)
    4678                    .dwattr $C$DW$285, DW_AT_decl_column(0x0e)
    4679            
    4680            $C$DW$286       .dwtag  DW_TAG_member
    4681                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    4682                    .dwattr $C$DW$286, DW_AT_name("compareOutputMode")
    4683                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("compareOutputMode")
    4684                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4685                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4686                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4687                    .dwattr $C$DW$286, DW_AT_decl_line(0x4f)
    4688                    .dwattr $C$DW$286, DW_AT_decl_column(0x0e)
    4689            
    4690            $C$DW$287       .dwtag  DW_TAG_member
    4691                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    4692                    .dwattr $C$DW$287, DW_AT_name("dutyCycle")
    4693                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("dutyCycle")
    4694                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4695                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4696                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4697                    .dwattr $C$DW$287, DW_AT_decl_line(0x51)
    4698                    .dwattr $C$DW$287, DW_AT_decl_column(0x0e)
    4699            
    4700                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4701                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    4702                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4703                    .dwendtag $C$DW$T$40
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   94

    4704            
    4705            $C$DW$T$74      .dwtag  DW_TAG_typedef
    4706                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    4707                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    4708                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4709                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4710                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    4711                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4712            
    4713            
    4714            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4715                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4716                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4717            $C$DW$288       .dwtag  DW_TAG_member
    4718                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$24)
    4719                    .dwattr $C$DW$288, DW_AT_name("selectClockSource")
    4720                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("selectClockSource")
    4721                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4723                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4724                    .dwattr $C$DW$288, DW_AT_decl_line(0x1c)
    4725                    .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    4726            
    4727            $C$DW$289       .dwtag  DW_TAG_member
    4728                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    4729                    .dwattr $C$DW$289, DW_AT_name("clockPrescalar")
    4730                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("clockPrescalar")
    4731                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4732                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4733                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4734                    .dwattr $C$DW$289, DW_AT_decl_line(0x1e)
    4735                    .dwattr $C$DW$289, DW_AT_decl_column(0x0e)
    4736            
    4737            $C$DW$290       .dwtag  DW_TAG_member
    4738                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$24)
    4739                    .dwattr $C$DW$290, DW_AT_name("firstModReg")
    4740                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("firstModReg")
    4741                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4742                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4743                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4744                    .dwattr $C$DW$290, DW_AT_decl_line(0x22)
    4745                    .dwattr $C$DW$290, DW_AT_decl_column(0x0d)
    4746            
    4747            $C$DW$291       .dwtag  DW_TAG_member
    4748                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$24)
    4749                    .dwattr $C$DW$291, DW_AT_name("secondModReg")
    4750                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("secondModReg")
    4751                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4752                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4753                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4754                    .dwattr $C$DW$291, DW_AT_decl_line(0x26)
    4755                    .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    4756            
    4757            $C$DW$292       .dwtag  DW_TAG_member
    4758                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$24)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   95

    4759                    .dwattr $C$DW$292, DW_AT_name("parity")
    4760                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("parity")
    4761                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4762                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4763                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4764                    .dwattr $C$DW$292, DW_AT_decl_line(0x2c)
    4765                    .dwattr $C$DW$292, DW_AT_decl_column(0x0d)
    4766            
    4767            $C$DW$293       .dwtag  DW_TAG_member
    4768                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$24)
    4769                    .dwattr $C$DW$293, DW_AT_name("msborLsbFirst")
    4770                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("msborLsbFirst")
    4771                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4772                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4773                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4774                    .dwattr $C$DW$293, DW_AT_decl_line(0x31)
    4775                    .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    4776            
    4777            $C$DW$294       .dwtag  DW_TAG_member
    4778                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$24)
    4779                    .dwattr $C$DW$294, DW_AT_name("numberofStopBits")
    4780                    .dwattr $C$DW$294, DW_AT_TI_symbol_name("numberofStopBits")
    4781                    .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4782                    .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4783                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4784                    .dwattr $C$DW$294, DW_AT_decl_line(0x36)
    4785                    .dwattr $C$DW$294, DW_AT_decl_column(0x0d)
    4786            
    4787            $C$DW$295       .dwtag  DW_TAG_member
    4788                    .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$24)
    4789                    .dwattr $C$DW$295, DW_AT_name("uartMode")
    4790                    .dwattr $C$DW$295, DW_AT_TI_symbol_name("uartMode")
    4791                    .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4792                    .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4793                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4794                    .dwattr $C$DW$295, DW_AT_decl_line(0x3d)
    4795                    .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    4796            
    4797            $C$DW$296       .dwtag  DW_TAG_member
    4798                    .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$24)
    4799                    .dwattr $C$DW$296, DW_AT_name("overSampling")
    4800                    .dwattr $C$DW$296, DW_AT_TI_symbol_name("overSampling")
    4801                    .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4802                    .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4803                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4804                    .dwattr $C$DW$296, DW_AT_decl_line(0x42)
    4805                    .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    4806            
    4807                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4808                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4809                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4810                    .dwendtag $C$DW$T$41
    4811            
    4812            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4813                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   96

    4814                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4815                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4816                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4817                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4818                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4819            
    4820            
    4821            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4822                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4823                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4824            $C$DW$297       .dwtag  DW_TAG_member
    4825                    .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$43)
    4826                    .dwattr $C$DW$297, DW_AT_name("clockSourceFrequency")
    4827                    .dwattr $C$DW$297, DW_AT_TI_symbol_name("clockSourceFrequency")
    4828                    .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4829                    .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4830                    .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4831                    .dwattr $C$DW$297, DW_AT_decl_line(0x31)
    4832                    .dwattr $C$DW$297, DW_AT_decl_column(0x0e)
    4833            
    4834            $C$DW$298       .dwtag  DW_TAG_member
    4835                    .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$43)
    4836                    .dwattr $C$DW$298, DW_AT_name("desiredSpiClock")
    4837                    .dwattr $C$DW$298, DW_AT_TI_symbol_name("desiredSpiClock")
    4838                    .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4839                    .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4840                    .dwattr $C$DW$298, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4841                    .dwattr $C$DW$298, DW_AT_decl_line(0x33)
    4842                    .dwattr $C$DW$298, DW_AT_decl_column(0x0e)
    4843            
    4844                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4845                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4846                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4847                    .dwendtag $C$DW$T$44
    4848            
    4849            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4850                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4851                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4852                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4853                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4854                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4855                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4856            
    4857            
    4858            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4859                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4860                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4861            $C$DW$299       .dwtag  DW_TAG_member
    4862                    .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$24)
    4863                    .dwattr $C$DW$299, DW_AT_name("selectClockSource")
    4864                    .dwattr $C$DW$299, DW_AT_TI_symbol_name("selectClockSource")
    4865                    .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4866                    .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4867                    .dwattr $C$DW$299, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4868                    .dwattr $C$DW$299, DW_AT_decl_line(0x14)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Power_Limit.asm                                                      PAGE   97

    4869                    .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    4870            
    4871            $C$DW$300       .dwtag  DW_TAG_member
    4872                    .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$43)
    4873                    .dwattr $C$DW$300, DW_AT_name("clockSourceFrequency")
    4874                    .dwattr $C$DW$300, DW_AT_TI_symbol_name("clockSourceFrequency")
    4875                    .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4876                    .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4877                    .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4878                    .dwattr $C$DW$300, DW_AT_decl_line(0x16)
    4879                    .dwattr $C$DW$300, DW_AT_decl_column(0x0e)
    4880            
    4881            $C$DW$301       .dwtag  DW_TAG_member
    4882                    .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$43)
    4883                    .dwattr $C$DW$301, DW_AT_name("desiredSpiClock")
    4884                    .dwattr $C$DW$301, DW_AT_TI_symbol_name("desiredSpiClock")
    4885                    .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4886                    .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4887                    .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4888                    .dwattr $C$DW$301, DW_AT_decl_line(0x18)
    4889                    .dwattr $C$DW$301, DW_AT_decl_column(0x0e)
    4890            
    4891            $C$DW$302       .dwtag  DW_TAG_member
    4892                    .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$24)
    4893                    .dwattr $C$DW$302, DW_AT_name("msbFirst")
    4894                    .dwattr $C$DW$302, DW_AT_TI_symbol_name("msbFirst")
    4895                    .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4896                    .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4897                    .dwattr $C$DW$302, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4898                    .dwattr $C$DW$302, DW_AT_decl_line(0x1d)
    4899                    .dwattr $C$DW$302, DW_AT_decl_column(0x0d)
