MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:05 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/pumps.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("TA0CCR3")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("TA0CCR3")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$111)

    4179            $C$DW$195       .dwtag  DW_TAG_enumerator
    4180                    .dwattr $C$DW$195, DW_AT_name("crc2")
    4181                    .dwattr $C$DW$195, DW_AT_const_value(0x06)
    4182                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4183                    .dwattr $C$DW$195, DW_AT_decl_line(0x76)
    4184                    .dwattr $C$DW$195, DW_AT_decl_column(0x05)
    4185            
    4186            $C$DW$196       .dwtag  DW_TAG_enumerator
    4187                    .dwattr $C$DW$196, DW_AT_name("ack")
    4188                    .dwattr $C$DW$196, DW_AT_const_value(0x07)
    4189                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4190                    .dwattr $C$DW$196, DW_AT_decl_line(0x77)
    4191                    .dwattr $C$DW$196, DW_AT_decl_column(0x05)
    4192            
    4193            $C$DW$197       .dwtag  DW_TAG_enumerator
    4194                    .dwattr $C$DW$197, DW_AT_name("var")
    4195                    .dwattr $C$DW$197, DW_AT_const_value(0x08)
    4196                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4197                    .dwattr $C$DW$197, DW_AT_decl_line(0x78)
    4198                    .dwattr $C$DW$197, DW_AT_decl_column(0x05)
    4199            
    4200            $C$DW$198       .dwtag  DW_TAG_enumerator
    4201                    .dwattr $C$DW$198, DW_AT_name("UGmsg")
    4202                    .dwattr $C$DW$198, DW_AT_const_value(0x09)
    4203                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4204                    .dwattr $C$DW$198, DW_AT_decl_line(0x79)
    4205                    .dwattr $C$DW$198, DW_AT_decl_column(0x05)
    4206            
    4207                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4208                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    4209                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    4210                    .dwendtag $C$DW$T$57
    4211            
    4212            $C$DW$T$58      .dwtag  DW_TAG_typedef
    4213                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    4214                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4215                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4216                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4217                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    4218                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4219            
    4220            
    4221            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    4222                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    4223            $C$DW$199       .dwtag  DW_TAG_enumerator
    4224                    .dwattr $C$DW$199, DW_AT_name("init")
    4225                    .dwattr $C$DW$199, DW_AT_const_value(0x00)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   86

    4226                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4227                    .dwattr $C$DW$199, DW_AT_decl_line(0x80)
    4228                    .dwattr $C$DW$199, DW_AT_decl_column(0x05)
    4229            
    4230            $C$DW$200       .dwtag  DW_TAG_enumerator
    4231                    .dwattr $C$DW$200, DW_AT_name("running")
    4232                    .dwattr $C$DW$200, DW_AT_const_value(0x01)
    4233                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4234                    .dwattr $C$DW$200, DW_AT_decl_line(0x80)
    4235                    .dwattr $C$DW$200, DW_AT_decl_column(0x0b)
    4236            
    4237            $C$DW$201       .dwtag  DW_TAG_enumerator
    4238                    .dwattr $C$DW$201, DW_AT_name("wait")
    4239                    .dwattr $C$DW$201, DW_AT_const_value(0x02)
    4240                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4241                    .dwattr $C$DW$201, DW_AT_decl_line(0x80)
    4242                    .dwattr $C$DW$201, DW_AT_decl_column(0x14)
    4243            
    4244                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4245                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    4246                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4247                    .dwendtag $C$DW$T$59
    4248            
    4249            $C$DW$T$60      .dwtag  DW_TAG_typedef
    4250                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    4251                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4252                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4253                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4254                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    4255                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    4256            
    4257            
    4258            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4259                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4260            $C$DW$202       .dwtag  DW_TAG_member
    4261                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$14)
    4262                    .dwattr $C$DW$202, DW_AT_name("__max_align1")
    4263                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("__max_align1")
    4264                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4265                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    4266                    .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4267                    .dwattr $C$DW$202, DW_AT_decl_line(0x7b)
    4268                    .dwattr $C$DW$202, DW_AT_decl_column(0x0c)
    4269            
    4270            $C$DW$203       .dwtag  DW_TAG_member
    4271                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$18)
    4272                    .dwattr $C$DW$203, DW_AT_name("__max_align2")
    4273                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("__max_align2")
    4274                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4275                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    4276                    .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4277                    .dwattr $C$DW$203, DW_AT_decl_line(0x7c)
    4278                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    4279            
    4280                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   87

    4281                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    4282                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4283                    .dwendtag $C$DW$T$22
    4284            
    4285            $C$DW$T$61      .dwtag  DW_TAG_typedef
    4286                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    4287                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    4288                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4289                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4290                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    4291                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    4292            
    4293            
    4294            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4295                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    4296                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    4297            $C$DW$204       .dwtag  DW_TAG_member
    4298                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$24)
    4299                    .dwattr $C$DW$204, DW_AT_name("memoryBufferControlIndex")
    4300                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    4301                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4302                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4303                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4304                    .dwattr $C$DW$204, DW_AT_decl_line(0x27)
    4305                    .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    4306            
    4307            $C$DW$205       .dwtag  DW_TAG_member
    4308                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$24)
    4309                    .dwattr $C$DW$205, DW_AT_name("inputSourceSelect")
    4310                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("inputSourceSelect")
    4311                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4312                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4313                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4314                    .dwattr $C$DW$205, DW_AT_decl_line(0x3b)
    4315                    .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    4316            
    4317            $C$DW$206       .dwtag  DW_TAG_member
    4318                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
    4319                    .dwattr $C$DW$206, DW_AT_name("positiveRefVoltageSourceSelect")
    4320                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    4321                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4322                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4323                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4324                    .dwattr $C$DW$206, DW_AT_decl_line(0x42)
    4325                    .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    4326            
    4327            $C$DW$207       .dwtag  DW_TAG_member
    4328                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$24)
    4329                    .dwattr $C$DW$207, DW_AT_name("negativeRefVoltageSourceSelect")
    4330                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    4331                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4332                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4333                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4334                    .dwattr $C$DW$207, DW_AT_decl_line(0x48)
    4335                    .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   88

    4336            
    4337            $C$DW$208       .dwtag  DW_TAG_member
    4338                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    4339                    .dwattr $C$DW$208, DW_AT_name("endOfSequence")
    4340                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("endOfSequence")
    4341                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4342                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4343                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4344                    .dwattr $C$DW$208, DW_AT_decl_line(0x51)
    4345                    .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    4346            
    4347                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4348                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    4349                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4350                    .dwendtag $C$DW$T$25
    4351            
    4352            $C$DW$T$62      .dwtag  DW_TAG_typedef
    4353                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    4354                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    4355                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4356                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4357                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    4358                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    4359            
    4360            
    4361            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4362                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    4363                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    4364            $C$DW$209       .dwtag  DW_TAG_member
    4365                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    4366                    .dwattr $C$DW$209, DW_AT_name("captureRegister")
    4367                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("captureRegister")
    4368                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4369                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4370                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4371                    .dwattr $C$DW$209, DW_AT_decl_line(0x58)
    4372                    .dwattr $C$DW$209, DW_AT_decl_column(0x0e)
    4373            
    4374            $C$DW$210       .dwtag  DW_TAG_member
    4375                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    4376                    .dwattr $C$DW$210, DW_AT_name("captureMode")
    4377                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("captureMode")
    4378                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4379                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4380                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4381                    .dwattr $C$DW$210, DW_AT_decl_line(0x5f)
    4382                    .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    4383            
    4384            $C$DW$211       .dwtag  DW_TAG_member
    4385                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    4386                    .dwattr $C$DW$211, DW_AT_name("captureInputSelect")
    4387                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("captureInputSelect")
    4388                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4389                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4390                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   89

    4391                    .dwattr $C$DW$211, DW_AT_decl_line(0x66)
    4392                    .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    4393            
    4394            $C$DW$212       .dwtag  DW_TAG_member
    4395                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$27)
    4396                    .dwattr $C$DW$212, DW_AT_name("synchronizeCaptureSource")
    4397                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4398                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4399                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4400                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4401                    .dwattr $C$DW$212, DW_AT_decl_line(0x6b)
    4402                    .dwattr $C$DW$212, DW_AT_decl_column(0x0e)
    4403            
    4404            $C$DW$213       .dwtag  DW_TAG_member
    4405                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$27)
    4406                    .dwattr $C$DW$213, DW_AT_name("captureInterruptEnable")
    4407                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("captureInterruptEnable")
    4408                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4409                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4410                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4411                    .dwattr $C$DW$213, DW_AT_decl_line(0x70)
    4412                    .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    4413            
    4414            $C$DW$214       .dwtag  DW_TAG_member
    4415                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$27)
    4416                    .dwattr $C$DW$214, DW_AT_name("captureOutputMode")
    4417                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("captureOutputMode")
    4418                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4419                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4420                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4421                    .dwattr $C$DW$214, DW_AT_decl_line(0x7b)
    4422                    .dwattr $C$DW$214, DW_AT_decl_column(0x0e)
    4423            
    4424                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4425                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    4426                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4427                    .dwendtag $C$DW$T$28
    4428            
    4429            $C$DW$T$63      .dwtag  DW_TAG_typedef
    4430                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    4431                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    4432                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4433                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4434                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    4435                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    4436            
    4437            
    4438            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4439                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    4440                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4441            $C$DW$215       .dwtag  DW_TAG_member
    4442                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    4443                    .dwattr $C$DW$215, DW_AT_name("compareRegister")
    4444                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("compareRegister")
    4445                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   90

    4446                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4447                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4448                    .dwattr $C$DW$215, DW_AT_decl_line(0x145)
    4449                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    4450            
    4451            $C$DW$216       .dwtag  DW_TAG_member
    4452                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    4453                    .dwattr $C$DW$216, DW_AT_name("compareInterruptEnable")
    4454                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("compareInterruptEnable")
    4455                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4456                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4457                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4458                    .dwattr $C$DW$216, DW_AT_decl_line(0x14a)
    4459                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    4460            
    4461            $C$DW$217       .dwtag  DW_TAG_member
    4462                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    4463                    .dwattr $C$DW$217, DW_AT_name("compareOutputMode")
    4464                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("compareOutputMode")
    4465                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4466                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4467                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4468                    .dwattr $C$DW$217, DW_AT_decl_line(0x155)
    4469                    .dwattr $C$DW$217, DW_AT_decl_column(0x0e)
    4470            
    4471            $C$DW$218       .dwtag  DW_TAG_member
    4472                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    4473                    .dwattr $C$DW$218, DW_AT_name("compareValue")
    4474                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("compareValue")
    4475                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4476                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4477                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4478                    .dwattr $C$DW$218, DW_AT_decl_line(0x157)
    4479                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    4480            
    4481                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4482                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4483                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4484                    .dwendtag $C$DW$T$29
    4485            
    4486            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4487                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4488                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4489                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4490                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4491                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4492                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    4493            
    4494            
    4495            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4496                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    4497                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4498            $C$DW$219       .dwtag  DW_TAG_member
    4499                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    4500                    .dwattr $C$DW$219, DW_AT_name("clockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   91

    4501                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("clockSource")
    4502                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4503                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4504                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4505                    .dwattr $C$DW$219, DW_AT_decl_line(0x20)
    4506                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    4507            
    4508            $C$DW$220       .dwtag  DW_TAG_member
    4509                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
    4510                    .dwattr $C$DW$220, DW_AT_name("clockSourceDivider")
    4511                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("clockSourceDivider")
    4512                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4513                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4514                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4515                    .dwattr $C$DW$220, DW_AT_decl_line(0x37)
    4516                    .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    4517            
    4518            $C$DW$221       .dwtag  DW_TAG_member
    4519                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    4520                    .dwattr $C$DW$221, DW_AT_name("timerInterruptEnable_TAIE")
    4521                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4522                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4523                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4524                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4525                    .dwattr $C$DW$221, DW_AT_decl_line(0x3c)
    4526                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    4527            
    4528            $C$DW$222       .dwtag  DW_TAG_member
    4529                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    4530                    .dwattr $C$DW$222, DW_AT_name("timerClear")
    4531                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("timerClear")
    4532                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4533                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4534                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4535                    .dwattr $C$DW$222, DW_AT_decl_line(0x42)
    4536                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    4537            
    4538            $C$DW$223       .dwtag  DW_TAG_member
    4539                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$30)
    4540                    .dwattr $C$DW$223, DW_AT_name("startTimer")
    4541                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("startTimer")
    4542                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4543                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4544                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4545                    .dwattr $C$DW$223, DW_AT_decl_line(0x44)
    4546                    .dwattr $C$DW$223, DW_AT_decl_column(0x0a)
    4547            
    4548                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4549                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    4550                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4551                    .dwendtag $C$DW$T$31
    4552            
    4553            $C$DW$T$65      .dwtag  DW_TAG_typedef
    4554                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    4555                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   92

    4556                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4557                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4558                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    4559                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4560            
    4561            
    4562            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4563                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    4564                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    4565            $C$DW$224       .dwtag  DW_TAG_member
    4566                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    4567                    .dwattr $C$DW$224, DW_AT_name("clockSource")
    4568                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("clockSource")
    4569                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4570                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4571                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4572                    .dwattr $C$DW$224, DW_AT_decl_line(0x8b)
    4573                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    4574            
    4575            $C$DW$225       .dwtag  DW_TAG_member
    4576                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    4577                    .dwattr $C$DW$225, DW_AT_name("clockSourceDivider")
    4578                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("clockSourceDivider")
    4579                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4580                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4581                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4582                    .dwattr $C$DW$225, DW_AT_decl_line(0xa2)
    4583                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    4584            
    4585            $C$DW$226       .dwtag  DW_TAG_member
    4586                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    4587                    .dwattr $C$DW$226, DW_AT_name("timerPeriod")
    4588                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("timerPeriod")
    4589                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4590                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4591                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4592                    .dwattr $C$DW$226, DW_AT_decl_line(0xa4)
    4593                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    4594            
    4595            $C$DW$227       .dwtag  DW_TAG_member
    4596                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4597                    .dwattr $C$DW$227, DW_AT_name("timerInterruptEnable_TAIE")
    4598                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4599                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4600                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4601                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4602                    .dwattr $C$DW$227, DW_AT_decl_line(0xa9)
    4603                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4604            
    4605            $C$DW$228       .dwtag  DW_TAG_member
    4606                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4607                    .dwattr $C$DW$228, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4608                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4609                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4610                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   93

    4611                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4612                    .dwattr $C$DW$228, DW_AT_decl_line(0xae)
    4613                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4614            
    4615            $C$DW$229       .dwtag  DW_TAG_member
    4616                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4617                    .dwattr $C$DW$229, DW_AT_name("timerClear")
    4618                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("timerClear")
    4619                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4620                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4621                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4622                    .dwattr $C$DW$229, DW_AT_decl_line(0xb4)
    4623                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4624            
    4625            $C$DW$230       .dwtag  DW_TAG_member
    4626                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$30)
    4627                    .dwattr $C$DW$230, DW_AT_name("startTimer")
    4628                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("startTimer")
    4629                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4630                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4631                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4632                    .dwattr $C$DW$230, DW_AT_decl_line(0xb6)
    4633                    .dwattr $C$DW$230, DW_AT_decl_column(0x0a)
    4634            
    4635                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4636                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    4637                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4638                    .dwendtag $C$DW$T$32
    4639            
    4640            $C$DW$T$66      .dwtag  DW_TAG_typedef
    4641                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    4642                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    4643                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4644                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4645                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    4646                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    4647            
    4648            
    4649            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4650                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    4651                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    4652            $C$DW$231       .dwtag  DW_TAG_member
    4653                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    4654                    .dwattr $C$DW$231, DW_AT_name("clockSource")
    4655                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("clockSource")
    4656                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4657                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4658                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4659                    .dwattr $C$DW$231, DW_AT_decl_line(0x105)
    4660                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4661            
    4662            $C$DW$232       .dwtag  DW_TAG_member
    4663                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    4664                    .dwattr $C$DW$232, DW_AT_name("clockSourceDivider")
    4665                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   94

    4666                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4667                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4668                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4669                    .dwattr $C$DW$232, DW_AT_decl_line(0x11c)
    4670                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    4671            
    4672            $C$DW$233       .dwtag  DW_TAG_member
    4673                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    4674                    .dwattr $C$DW$233, DW_AT_name("timerPeriod")
    4675                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("timerPeriod")
    4676                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4677                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4678                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4679                    .dwattr $C$DW$233, DW_AT_decl_line(0x11f)
    4680                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4681            
    4682            $C$DW$234       .dwtag  DW_TAG_member
    4683                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4684                    .dwattr $C$DW$234, DW_AT_name("timerInterruptEnable_TAIE")
    4685                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4686                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4687                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4688                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4689                    .dwattr $C$DW$234, DW_AT_decl_line(0x124)
    4690                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4691            
    4692            $C$DW$235       .dwtag  DW_TAG_member
    4693                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    4694                    .dwattr $C$DW$235, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4695                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4696                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4697                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4698                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4699                    .dwattr $C$DW$235, DW_AT_decl_line(0x129)
    4700                    .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    4701            
    4702            $C$DW$236       .dwtag  DW_TAG_member
    4703                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4704                    .dwattr $C$DW$236, DW_AT_name("timerClear")
    4705                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("timerClear")
    4706                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4707                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4708                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4709                    .dwattr $C$DW$236, DW_AT_decl_line(0x12f)
    4710                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4711            
    4712            $C$DW$237       .dwtag  DW_TAG_member
    4713                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$30)
    4714                    .dwattr $C$DW$237, DW_AT_name("startTimer")
    4715                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("startTimer")
    4716                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4717                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4718                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4719                    .dwattr $C$DW$237, DW_AT_decl_line(0x131)
    4720                    .dwattr $C$DW$237, DW_AT_decl_column(0x0a)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   95

    4721            
    4722                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4723                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    4724                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4725                    .dwendtag $C$DW$T$33
    4726            
    4727            $C$DW$T$67      .dwtag  DW_TAG_typedef
    4728                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    4729                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    4730                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4731                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4732                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    4733                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    4734            
    4735            
    4736            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4737                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    4738                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    4739            $C$DW$238       .dwtag  DW_TAG_member
    4740                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    4741                    .dwattr $C$DW$238, DW_AT_name("clockSource")
    4742                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("clockSource")
    4743                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4744                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4745                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4746                    .dwattr $C$DW$238, DW_AT_decl_line(0xc5)
    4747                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    4748            
    4749            $C$DW$239       .dwtag  DW_TAG_member
    4750                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4751                    .dwattr $C$DW$239, DW_AT_name("clockSourceDivider")
    4752                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("clockSourceDivider")
    4753                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4754                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4755                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4756                    .dwattr $C$DW$239, DW_AT_decl_line(0xdc)
    4757                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    4758            
    4759            $C$DW$240       .dwtag  DW_TAG_member
    4760                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    4761                    .dwattr $C$DW$240, DW_AT_name("timerPeriod")
    4762                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("timerPeriod")
    4763                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4764                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4765                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4766                    .dwattr $C$DW$240, DW_AT_decl_line(0xde)
    4767                    .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    4768            
    4769            $C$DW$241       .dwtag  DW_TAG_member
    4770                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    4771                    .dwattr $C$DW$241, DW_AT_name("compareRegister")
    4772                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("compareRegister")
    4773                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4774                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4775                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   96

    4776                    .dwattr $C$DW$241, DW_AT_decl_line(0xe9)
    4777                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4778            
    4779            $C$DW$242       .dwtag  DW_TAG_member
    4780                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$27)
    4781                    .dwattr $C$DW$242, DW_AT_name("compareOutputMode")
    4782                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("compareOutputMode")
    4783                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4784                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4785                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4786                    .dwattr $C$DW$242, DW_AT_decl_line(0xf4)
    4787                    .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
    4788            
    4789            $C$DW$243       .dwtag  DW_TAG_member
    4790                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    4791                    .dwattr $C$DW$243, DW_AT_name("dutyCycle")
    4792                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("dutyCycle")
    4793                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4794                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4795                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4796                    .dwattr $C$DW$243, DW_AT_decl_line(0xf6)
    4797                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    4798            
    4799                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4800                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    4801                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4802                    .dwendtag $C$DW$T$34
    4803            
    4804            $C$DW$T$68      .dwtag  DW_TAG_typedef
    4805                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    4806                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    4807                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4808                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4809                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    4810                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    4811            
    4812            
    4813            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4814                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    4815                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    4816            $C$DW$244       .dwtag  DW_TAG_member
    4817                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    4818                    .dwattr $C$DW$244, DW_AT_name("captureRegister")
    4819                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("captureRegister")
    4820                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4821                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4822                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4823                    .dwattr $C$DW$244, DW_AT_decl_line(0xa0)
    4824                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    4825            
    4826            $C$DW$245       .dwtag  DW_TAG_member
    4827                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    4828                    .dwattr $C$DW$245, DW_AT_name("captureMode")
    4829                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("captureMode")
    4830                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   97

    4831                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4832                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4833                    .dwattr $C$DW$245, DW_AT_decl_line(0xa7)
    4834                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    4835            
    4836            $C$DW$246       .dwtag  DW_TAG_member
    4837                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    4838                    .dwattr $C$DW$246, DW_AT_name("captureInputSelect")
    4839                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("captureInputSelect")
    4840                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4841                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4842                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4843                    .dwattr $C$DW$246, DW_AT_decl_line(0xae)
    4844                    .dwattr $C$DW$246, DW_AT_decl_column(0x0e)
    4845            
    4846            $C$DW$247       .dwtag  DW_TAG_member
    4847                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    4848                    .dwattr $C$DW$247, DW_AT_name("synchronizeCaptureSource")
    4849                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4850                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4851                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4852                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4853                    .dwattr $C$DW$247, DW_AT_decl_line(0xb3)
    4854                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4855            
    4856            $C$DW$248       .dwtag  DW_TAG_member
    4857                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4858                    .dwattr $C$DW$248, DW_AT_name("captureInterruptEnable")
    4859                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("captureInterruptEnable")
    4860                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4861                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4862                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4863                    .dwattr $C$DW$248, DW_AT_decl_line(0xb8)
    4864                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4865            
    4866            $C$DW$249       .dwtag  DW_TAG_member
    4867                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    4868                    .dwattr $C$DW$249, DW_AT_name("captureOutputMode")
    4869                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("captureOutputMode")
    4870                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4871                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4872                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4873                    .dwattr $C$DW$249, DW_AT_decl_line(0xc3)
    4874                    .dwattr $C$DW$249, DW_AT_decl_column(0x0e)
    4875            
    4876                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4877                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    4878                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4879                    .dwendtag $C$DW$T$35
    4880            
    4881            $C$DW$T$69      .dwtag  DW_TAG_typedef
    4882                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4883                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4884                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4885                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   98

    4886                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4887                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4888            
    4889            
    4890            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4891                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4892                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4893            $C$DW$250       .dwtag  DW_TAG_member
    4894                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    4895                    .dwattr $C$DW$250, DW_AT_name("compareRegister")
    4896                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("compareRegister")
    4897                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4898                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4899                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4900                    .dwattr $C$DW$250, DW_AT_decl_line(0x146)
    4901                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4902            
    4903            $C$DW$251       .dwtag  DW_TAG_member
    4904                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4905                    .dwattr $C$DW$251, DW_AT_name("compareInterruptEnable")
    4906                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("compareInterruptEnable")
    4907                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4908                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4909                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4910                    .dwattr $C$DW$251, DW_AT_decl_line(0x14b)
    4911                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4912            
    4913            $C$DW$252       .dwtag  DW_TAG_member
    4914                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    4915                    .dwattr $C$DW$252, DW_AT_name("compareOutputMode")
    4916                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("compareOutputMode")
    4917                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4918                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4919                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4920                    .dwattr $C$DW$252, DW_AT_decl_line(0x156)
    4921                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    4922            
    4923            $C$DW$253       .dwtag  DW_TAG_member
    4924                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    4925                    .dwattr $C$DW$253, DW_AT_name("compareValue")
    4926                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("compareValue")
    4927                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4928                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4929                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4930                    .dwattr $C$DW$253, DW_AT_decl_line(0x158)
    4931                    .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    4932            
    4933                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4934                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4935                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4936                    .dwendtag $C$DW$T$36
    4937            
    4938            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4939                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4940                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE   99

    4941                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4942                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4943                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4944                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4945            
    4946            
    4947            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4948                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4949                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4950            $C$DW$254       .dwtag  DW_TAG_member
    4951                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4952                    .dwattr $C$DW$254, DW_AT_name("clockSource")
    4953                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("clockSource")
    4954                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4955                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4956                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4957                    .dwattr $C$DW$254, DW_AT_decl_line(0xd3)
    4958                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4959            
    4960            $C$DW$255       .dwtag  DW_TAG_member
    4961                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4962                    .dwattr $C$DW$255, DW_AT_name("clockSourceDivider")
    4963                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("clockSourceDivider")
    4964                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4965                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4966                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4967                    .dwattr $C$DW$255, DW_AT_decl_line(0xea)
    4968                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4969            
    4970            $C$DW$256       .dwtag  DW_TAG_member
    4971                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4972                    .dwattr $C$DW$256, DW_AT_name("timerInterruptEnable_TBIE")
    4973                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4974                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4975                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4976                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4977                    .dwattr $C$DW$256, DW_AT_decl_line(0xef)
    4978                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4979            
    4980            $C$DW$257       .dwtag  DW_TAG_member
    4981                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4982                    .dwattr $C$DW$257, DW_AT_name("timerClear")
    4983                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("timerClear")
    4984                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4985                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4986                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4987                    .dwattr $C$DW$257, DW_AT_decl_line(0xf5)
    4988                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4989            
    4990            $C$DW$258       .dwtag  DW_TAG_member
    4991                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$30)
    4992                    .dwattr $C$DW$258, DW_AT_name("startTimer")
    4993                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("startTimer")
    4994                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4995                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  100

    4996                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4997                    .dwattr $C$DW$258, DW_AT_decl_line(0xf7)
    4998                    .dwattr $C$DW$258, DW_AT_decl_column(0x0a)
    4999            
    5000                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5001                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    5002                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5003                    .dwendtag $C$DW$T$37
    5004            
    5005            $C$DW$T$71      .dwtag  DW_TAG_typedef
    5006                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    5007                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    5008                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    5009                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5010                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    5011                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    5012            
    5013            
    5014            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5015                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    5016                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    5017            $C$DW$259       .dwtag  DW_TAG_member
    5018                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    5019                    .dwattr $C$DW$259, DW_AT_name("clockSource")
    5020                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("clockSource")
    5021                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5022                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5023                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5024                    .dwattr $C$DW$259, DW_AT_decl_line(0x107)
    5025                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    5026            
    5027            $C$DW$260       .dwtag  DW_TAG_member
    5028                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    5029                    .dwattr $C$DW$260, DW_AT_name("clockSourceDivider")
    5030                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("clockSourceDivider")
    5031                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5032                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5033                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5034                    .dwattr $C$DW$260, DW_AT_decl_line(0x11e)
    5035                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    5036            
    5037            $C$DW$261       .dwtag  DW_TAG_member
    5038                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    5039                    .dwattr $C$DW$261, DW_AT_name("timerPeriod")
    5040                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("timerPeriod")
    5041                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5042                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5043                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5044                    .dwattr $C$DW$261, DW_AT_decl_line(0x120)
    5045                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    5046            
    5047            $C$DW$262       .dwtag  DW_TAG_member
    5048                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    5049                    .dwattr $C$DW$262, DW_AT_name("timerInterruptEnable_TBIE")
    5050                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  101

    5051                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5052                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5053                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5054                    .dwattr $C$DW$262, DW_AT_decl_line(0x125)
    5055                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    5056            
    5057            $C$DW$263       .dwtag  DW_TAG_member
    5058                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    5059                    .dwattr $C$DW$263, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5060                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5061                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5062                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5063                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5064                    .dwattr $C$DW$263, DW_AT_decl_line(0x12a)
    5065                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    5066            
    5067            $C$DW$264       .dwtag  DW_TAG_member
    5068                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    5069                    .dwattr $C$DW$264, DW_AT_name("timerClear")
    5070                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("timerClear")
    5071                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5072                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5073                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5074                    .dwattr $C$DW$264, DW_AT_decl_line(0x130)
    5075                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    5076            
    5077            $C$DW$265       .dwtag  DW_TAG_member
    5078                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$30)
    5079                    .dwattr $C$DW$265, DW_AT_name("startTimer")
    5080                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("startTimer")
    5081                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5082                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5083                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5084                    .dwattr $C$DW$265, DW_AT_decl_line(0x132)
    5085                    .dwattr $C$DW$265, DW_AT_decl_column(0x0a)
    5086            
    5087                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5088                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    5089                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    5090                    .dwendtag $C$DW$T$38
    5091            
    5092            $C$DW$T$72      .dwtag  DW_TAG_typedef
    5093                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    5094                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    5095                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    5096                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5097                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    5098                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    5099            
    5100            
    5101            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5102                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    5103                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    5104            $C$DW$266       .dwtag  DW_TAG_member
    5105                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  102

    5106                    .dwattr $C$DW$266, DW_AT_name("clockSource")
    5107                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("clockSource")
    5108                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5109                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5110                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5111                    .dwattr $C$DW$266, DW_AT_decl_line(0x60)
    5112                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    5113            
    5114            $C$DW$267       .dwtag  DW_TAG_member
    5115                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    5116                    .dwattr $C$DW$267, DW_AT_name("clockSourceDivider")
    5117                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("clockSourceDivider")
    5118                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5119                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5120                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5121                    .dwattr $C$DW$267, DW_AT_decl_line(0x77)
    5122                    .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    5123            
    5124            $C$DW$268       .dwtag  DW_TAG_member
    5125                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    5126                    .dwattr $C$DW$268, DW_AT_name("timerPeriod")
    5127                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("timerPeriod")
    5128                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5129                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5130                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5131                    .dwattr $C$DW$268, DW_AT_decl_line(0x7a)
    5132                    .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    5133            
    5134            $C$DW$269       .dwtag  DW_TAG_member
    5135                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    5136                    .dwattr $C$DW$269, DW_AT_name("timerInterruptEnable_TBIE")
    5137                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5138                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5139                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5140                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5141                    .dwattr $C$DW$269, DW_AT_decl_line(0x7f)
    5142                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    5143            
    5144            $C$DW$270       .dwtag  DW_TAG_member
    5145                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    5146                    .dwattr $C$DW$270, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5147                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5148                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5149                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5150                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5151                    .dwattr $C$DW$270, DW_AT_decl_line(0x84)
    5152                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
    5153            
    5154            $C$DW$271       .dwtag  DW_TAG_member
    5155                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    5156                    .dwattr $C$DW$271, DW_AT_name("timerClear")
    5157                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("timerClear")
    5158                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5159                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5160                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  103

    5161                    .dwattr $C$DW$271, DW_AT_decl_line(0x8a)
    5162                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    5163            
    5164            $C$DW$272       .dwtag  DW_TAG_member
    5165                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$30)
    5166                    .dwattr $C$DW$272, DW_AT_name("startTimer")
    5167                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("startTimer")
    5168                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5169                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5170                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5171                    .dwattr $C$DW$272, DW_AT_decl_line(0x8c)
    5172                    .dwattr $C$DW$272, DW_AT_decl_column(0x0a)
    5173            
    5174                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5175                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    5176                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    5177                    .dwendtag $C$DW$T$39
    5178            
    5179            $C$DW$T$73      .dwtag  DW_TAG_typedef
    5180                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    5181                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    5182                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5183                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5184                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    5185                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    5186            
    5187            
    5188            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5189                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    5190                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    5191            $C$DW$273       .dwtag  DW_TAG_member
    5192                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    5193                    .dwattr $C$DW$273, DW_AT_name("clockSource")
    5194                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("clockSource")
    5195                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5196                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5197                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5198                    .dwattr $C$DW$273, DW_AT_decl_line(0x20)
    5199                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    5200            
    5201            $C$DW$274       .dwtag  DW_TAG_member
    5202                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    5203                    .dwattr $C$DW$274, DW_AT_name("clockSourceDivider")
    5204                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("clockSourceDivider")
    5205                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5206                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5207                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5208                    .dwattr $C$DW$274, DW_AT_decl_line(0x37)
    5209                    .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    5210            
    5211            $C$DW$275       .dwtag  DW_TAG_member
    5212                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$27)
    5213                    .dwattr $C$DW$275, DW_AT_name("timerPeriod")
    5214                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("timerPeriod")
    5215                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  104

    5216                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5217                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5218                    .dwattr $C$DW$275, DW_AT_decl_line(0x39)
    5219                    .dwattr $C$DW$275, DW_AT_decl_column(0x0e)
    5220            
    5221            $C$DW$276       .dwtag  DW_TAG_member
    5222                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    5223                    .dwattr $C$DW$276, DW_AT_name("compareRegister")
    5224                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("compareRegister")
    5225                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5226                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5227                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5228                    .dwattr $C$DW$276, DW_AT_decl_line(0x44)
    5229                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    5230            
    5231            $C$DW$277       .dwtag  DW_TAG_member
    5232                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    5233                    .dwattr $C$DW$277, DW_AT_name("compareOutputMode")
    5234                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("compareOutputMode")
    5235                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5236                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5237                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5238                    .dwattr $C$DW$277, DW_AT_decl_line(0x4f)
    5239                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    5240            
    5241            $C$DW$278       .dwtag  DW_TAG_member
    5242                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    5243                    .dwattr $C$DW$278, DW_AT_name("dutyCycle")
    5244                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("dutyCycle")
    5245                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5246                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5247                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5248                    .dwattr $C$DW$278, DW_AT_decl_line(0x51)
    5249                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    5250            
    5251                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5252                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    5253                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    5254                    .dwendtag $C$DW$T$40
    5255            
    5256            $C$DW$T$74      .dwtag  DW_TAG_typedef
    5257                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    5258                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    5259                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5260                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5261                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    5262                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    5263            
    5264            
    5265            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5266                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    5267                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    5268            $C$DW$279       .dwtag  DW_TAG_member
    5269                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$24)
    5270                    .dwattr $C$DW$279, DW_AT_name("selectClockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  105

    5271                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("selectClockSource")
    5272                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5273                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5274                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5275                    .dwattr $C$DW$279, DW_AT_decl_line(0x1c)
    5276                    .dwattr $C$DW$279, DW_AT_decl_column(0x0d)
    5277            
    5278            $C$DW$280       .dwtag  DW_TAG_member
    5279                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    5280                    .dwattr $C$DW$280, DW_AT_name("clockPrescalar")
    5281                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("clockPrescalar")
    5282                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5283                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5284                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5285                    .dwattr $C$DW$280, DW_AT_decl_line(0x1e)
    5286                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    5287            
    5288            $C$DW$281       .dwtag  DW_TAG_member
    5289                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$24)
    5290                    .dwattr $C$DW$281, DW_AT_name("firstModReg")
    5291                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("firstModReg")
    5292                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5293                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5294                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5295                    .dwattr $C$DW$281, DW_AT_decl_line(0x22)
    5296                    .dwattr $C$DW$281, DW_AT_decl_column(0x0d)
    5297            
    5298            $C$DW$282       .dwtag  DW_TAG_member
    5299                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$24)
    5300                    .dwattr $C$DW$282, DW_AT_name("secondModReg")
    5301                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("secondModReg")
    5302                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5303                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5304                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5305                    .dwattr $C$DW$282, DW_AT_decl_line(0x26)
    5306                    .dwattr $C$DW$282, DW_AT_decl_column(0x0d)
    5307            
    5308            $C$DW$283       .dwtag  DW_TAG_member
    5309                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$24)
    5310                    .dwattr $C$DW$283, DW_AT_name("parity")
    5311                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("parity")
    5312                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5313                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5314                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5315                    .dwattr $C$DW$283, DW_AT_decl_line(0x2c)
    5316                    .dwattr $C$DW$283, DW_AT_decl_column(0x0d)
    5317            
    5318            $C$DW$284       .dwtag  DW_TAG_member
    5319                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$24)
    5320                    .dwattr $C$DW$284, DW_AT_name("msborLsbFirst")
    5321                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("msborLsbFirst")
    5322                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5323                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5324                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5325                    .dwattr $C$DW$284, DW_AT_decl_line(0x31)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  106

    5326                    .dwattr $C$DW$284, DW_AT_decl_column(0x0d)
    5327            
    5328            $C$DW$285       .dwtag  DW_TAG_member
    5329                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$24)
    5330                    .dwattr $C$DW$285, DW_AT_name("numberofStopBits")
    5331                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("numberofStopBits")
    5332                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5333                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5334                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5335                    .dwattr $C$DW$285, DW_AT_decl_line(0x36)
    5336                    .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    5337            
    5338            $C$DW$286       .dwtag  DW_TAG_member
    5339                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$24)
    5340                    .dwattr $C$DW$286, DW_AT_name("uartMode")
    5341                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("uartMode")
    5342                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5343                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5344                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5345                    .dwattr $C$DW$286, DW_AT_decl_line(0x3d)
    5346                    .dwattr $C$DW$286, DW_AT_decl_column(0x0d)
    5347            
    5348            $C$DW$287       .dwtag  DW_TAG_member
    5349                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$24)
    5350                    .dwattr $C$DW$287, DW_AT_name("overSampling")
    5351                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("overSampling")
    5352                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5353                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5354                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5355                    .dwattr $C$DW$287, DW_AT_decl_line(0x42)
    5356                    .dwattr $C$DW$287, DW_AT_decl_column(0x0d)
    5357            
    5358                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5359                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    5360                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5361                    .dwendtag $C$DW$T$41
    5362            
    5363            $C$DW$T$75      .dwtag  DW_TAG_typedef
    5364                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    5365                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    5366                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5367                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5368                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    5369                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    5370            
    5371            
    5372            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5373                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5374                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    5375            $C$DW$288       .dwtag  DW_TAG_member
    5376                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$43)
    5377                    .dwattr $C$DW$288, DW_AT_name("clockSourceFrequency")
    5378                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("clockSourceFrequency")
    5379                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5380                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  107

    5381                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5382                    .dwattr $C$DW$288, DW_AT_decl_line(0x31)
    5383                    .dwattr $C$DW$288, DW_AT_decl_column(0x0e)
    5384            
    5385            $C$DW$289       .dwtag  DW_TAG_member
    5386                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$43)
    5387                    .dwattr $C$DW$289, DW_AT_name("desiredSpiClock")
    5388                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("desiredSpiClock")
    5389                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5390                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5391                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5392                    .dwattr $C$DW$289, DW_AT_decl_line(0x33)
    5393                    .dwattr $C$DW$289, DW_AT_decl_column(0x0e)
    5394            
    5395                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5396                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    5397                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    5398                    .dwendtag $C$DW$T$44
    5399            
    5400            $C$DW$T$76      .dwtag  DW_TAG_typedef
    5401                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5402                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    5403                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5404                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5405                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    5406                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    5407            
    5408            
    5409            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5410                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    5411                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    5412            $C$DW$290       .dwtag  DW_TAG_member
    5413                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$24)
    5414                    .dwattr $C$DW$290, DW_AT_name("selectClockSource")
    5415                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("selectClockSource")
    5416                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5417                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5418                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5419                    .dwattr $C$DW$290, DW_AT_decl_line(0x14)
    5420                    .dwattr $C$DW$290, DW_AT_decl_column(0x0d)
    5421            
    5422            $C$DW$291       .dwtag  DW_TAG_member
    5423                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$43)
    5424                    .dwattr $C$DW$291, DW_AT_name("clockSourceFrequency")
    5425                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("clockSourceFrequency")
    5426                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5427                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5428                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5429                    .dwattr $C$DW$291, DW_AT_decl_line(0x16)
    5430                    .dwattr $C$DW$291, DW_AT_decl_column(0x0e)
    5431            
    5432            $C$DW$292       .dwtag  DW_TAG_member
    5433                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$43)
    5434                    .dwattr $C$DW$292, DW_AT_name("desiredSpiClock")
    5435                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("desiredSpiClock")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
pumps.asm                                                            PAGE  108

    5436                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5437                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5438                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5439                    .dwattr $C$DW$292, DW_AT_decl_line(0x18)
    5440                    .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    5441            
    5442            $C$DW$293       .dwtag  DW_TAG_member
    5443                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$24)
    5444                    .dwattr $C$DW$293, DW_AT_name("msbFirst")
    5445                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("msbFirst")
    5446                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5447                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5448                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5449                    .dwattr $C$DW$293, DW_AT_decl_line(0x1d)
    5450                    .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    5451            
