MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:05 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/run.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PDOUT_H")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PDOUT_H")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$87)

    3739            $C$DW$207       .dwtag  DW_TAG_enumerator
    3740                    .dwattr $C$DW$207, DW_AT_name("crc2")
    3741                    .dwattr $C$DW$207, DW_AT_const_value(0x06)
    3742                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3743                    .dwattr $C$DW$207, DW_AT_decl_line(0x76)
    3744                    .dwattr $C$DW$207, DW_AT_decl_column(0x05)
    3745            
    3746            $C$DW$208       .dwtag  DW_TAG_enumerator
    3747                    .dwattr $C$DW$208, DW_AT_name("ack")
    3748                    .dwattr $C$DW$208, DW_AT_const_value(0x07)
    3749                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3750                    .dwattr $C$DW$208, DW_AT_decl_line(0x77)
    3751                    .dwattr $C$DW$208, DW_AT_decl_column(0x05)
    3752            
    3753            $C$DW$209       .dwtag  DW_TAG_enumerator
    3754                    .dwattr $C$DW$209, DW_AT_name("var")
    3755                    .dwattr $C$DW$209, DW_AT_const_value(0x08)
    3756                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3757                    .dwattr $C$DW$209, DW_AT_decl_line(0x78)
    3758                    .dwattr $C$DW$209, DW_AT_decl_column(0x05)
    3759            
    3760            $C$DW$210       .dwtag  DW_TAG_enumerator
    3761                    .dwattr $C$DW$210, DW_AT_name("UGmsg")
    3762                    .dwattr $C$DW$210, DW_AT_const_value(0x09)
    3763                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3764                    .dwattr $C$DW$210, DW_AT_decl_line(0x79)
    3765                    .dwattr $C$DW$210, DW_AT_decl_column(0x05)
    3766            
    3767                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3768                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    3769                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    3770                    .dwendtag $C$DW$T$57
    3771            
    3772            $C$DW$T$58      .dwtag  DW_TAG_typedef
    3773                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    3774                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3775                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3776                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3777                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    3778                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   77

    3779            
    3780            
    3781            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    3782                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3783            $C$DW$211       .dwtag  DW_TAG_enumerator
    3784                    .dwattr $C$DW$211, DW_AT_name("init")
    3785                    .dwattr $C$DW$211, DW_AT_const_value(0x00)
    3786                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3787                    .dwattr $C$DW$211, DW_AT_decl_line(0x80)
    3788                    .dwattr $C$DW$211, DW_AT_decl_column(0x05)
    3789            
    3790            $C$DW$212       .dwtag  DW_TAG_enumerator
    3791                    .dwattr $C$DW$212, DW_AT_name("running")
    3792                    .dwattr $C$DW$212, DW_AT_const_value(0x01)
    3793                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3794                    .dwattr $C$DW$212, DW_AT_decl_line(0x80)
    3795                    .dwattr $C$DW$212, DW_AT_decl_column(0x0b)
    3796            
    3797            $C$DW$213       .dwtag  DW_TAG_enumerator
    3798                    .dwattr $C$DW$213, DW_AT_name("wait")
    3799                    .dwattr $C$DW$213, DW_AT_const_value(0x02)
    3800                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    3801                    .dwattr $C$DW$213, DW_AT_decl_line(0x80)
    3802                    .dwattr $C$DW$213, DW_AT_decl_column(0x14)
    3803            
    3804                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3805                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    3806                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3807                    .dwendtag $C$DW$T$59
    3808            
    3809            $C$DW$T$60      .dwtag  DW_TAG_typedef
    3810                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    3811                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3812                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3813                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    3814                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    3815                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3816            
    3817            
    3818            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3819                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3820            $C$DW$214       .dwtag  DW_TAG_member
    3821                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$14)
    3822                    .dwattr $C$DW$214, DW_AT_name("__max_align1")
    3823                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("__max_align1")
    3824                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3825                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3826                    .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3827                    .dwattr $C$DW$214, DW_AT_decl_line(0x7b)
    3828                    .dwattr $C$DW$214, DW_AT_decl_column(0x0c)
    3829            
    3830            $C$DW$215       .dwtag  DW_TAG_member
    3831                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$18)
    3832                    .dwattr $C$DW$215, DW_AT_name("__max_align2")
    3833                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("__max_align2")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   78

    3834                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3835                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3836                    .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    3837                    .dwattr $C$DW$215, DW_AT_decl_line(0x7c)
    3838                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3839            
    3840                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3841                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    3842                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3843                    .dwendtag $C$DW$T$22
    3844            
    3845            $C$DW$T$61      .dwtag  DW_TAG_typedef
    3846                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    3847                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    3848                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3849                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    3850                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    3851                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3852            
    3853            
    3854            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3855                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    3856                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    3857            $C$DW$216       .dwtag  DW_TAG_member
    3858                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$24)
    3859                    .dwattr $C$DW$216, DW_AT_name("memoryBufferControlIndex")
    3860                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    3861                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3862                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3863                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3864                    .dwattr $C$DW$216, DW_AT_decl_line(0x27)
    3865                    .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    3866            
    3867            $C$DW$217       .dwtag  DW_TAG_member
    3868                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$24)
    3869                    .dwattr $C$DW$217, DW_AT_name("inputSourceSelect")
    3870                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("inputSourceSelect")
    3871                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3872                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3873                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3874                    .dwattr $C$DW$217, DW_AT_decl_line(0x3b)
    3875                    .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    3876            
    3877            $C$DW$218       .dwtag  DW_TAG_member
    3878                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$24)
    3879                    .dwattr $C$DW$218, DW_AT_name("positiveRefVoltageSourceSelect")
    3880                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    3881                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3882                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3883                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3884                    .dwattr $C$DW$218, DW_AT_decl_line(0x42)
    3885                    .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    3886            
    3887            $C$DW$219       .dwtag  DW_TAG_member
    3888                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$24)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   79

    3889                    .dwattr $C$DW$219, DW_AT_name("negativeRefVoltageSourceSelect")
    3890                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    3891                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3892                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3893                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3894                    .dwattr $C$DW$219, DW_AT_decl_line(0x48)
    3895                    .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    3896            
    3897            $C$DW$220       .dwtag  DW_TAG_member
    3898                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    3899                    .dwattr $C$DW$220, DW_AT_name("endOfSequence")
    3900                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("endOfSequence")
    3901                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3902                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3903                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    3904                    .dwattr $C$DW$220, DW_AT_decl_line(0x51)
    3905                    .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    3906            
    3907                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3908                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    3909                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3910                    .dwendtag $C$DW$T$25
    3911            
    3912            $C$DW$T$62      .dwtag  DW_TAG_typedef
    3913                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    3914                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    3915                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3916                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    3917                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    3918                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3919            
    3920            
    3921            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3922                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    3923                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3924            $C$DW$221       .dwtag  DW_TAG_member
    3925                    .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$27)
    3926                    .dwattr $C$DW$221, DW_AT_name("captureRegister")
    3927                    .dwattr $C$DW$221, DW_AT_TI_symbol_name("captureRegister")
    3928                    .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3929                    .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3930                    .dwattr $C$DW$221, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3931                    .dwattr $C$DW$221, DW_AT_decl_line(0x58)
    3932                    .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    3933            
    3934            $C$DW$222       .dwtag  DW_TAG_member
    3935                    .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
    3936                    .dwattr $C$DW$222, DW_AT_name("captureMode")
    3937                    .dwattr $C$DW$222, DW_AT_TI_symbol_name("captureMode")
    3938                    .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3939                    .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3940                    .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3941                    .dwattr $C$DW$222, DW_AT_decl_line(0x5f)
    3942                    .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    3943            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   80

    3944            $C$DW$223       .dwtag  DW_TAG_member
    3945                    .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$27)
    3946                    .dwattr $C$DW$223, DW_AT_name("captureInputSelect")
    3947                    .dwattr $C$DW$223, DW_AT_TI_symbol_name("captureInputSelect")
    3948                    .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3949                    .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3950                    .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3951                    .dwattr $C$DW$223, DW_AT_decl_line(0x66)
    3952                    .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    3953            
    3954            $C$DW$224       .dwtag  DW_TAG_member
    3955                    .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
    3956                    .dwattr $C$DW$224, DW_AT_name("synchronizeCaptureSource")
    3957                    .dwattr $C$DW$224, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3958                    .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3959                    .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3960                    .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3961                    .dwattr $C$DW$224, DW_AT_decl_line(0x6b)
    3962                    .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    3963            
    3964            $C$DW$225       .dwtag  DW_TAG_member
    3965                    .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    3966                    .dwattr $C$DW$225, DW_AT_name("captureInterruptEnable")
    3967                    .dwattr $C$DW$225, DW_AT_TI_symbol_name("captureInterruptEnable")
    3968                    .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3969                    .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3970                    .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3971                    .dwattr $C$DW$225, DW_AT_decl_line(0x70)
    3972                    .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    3973            
    3974            $C$DW$226       .dwtag  DW_TAG_member
    3975                    .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    3976                    .dwattr $C$DW$226, DW_AT_name("captureOutputMode")
    3977                    .dwattr $C$DW$226, DW_AT_TI_symbol_name("captureOutputMode")
    3978                    .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3979                    .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3980                    .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3981                    .dwattr $C$DW$226, DW_AT_decl_line(0x7b)
    3982                    .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
    3983            
    3984                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3985                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    3986                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3987                    .dwendtag $C$DW$T$28
    3988            
    3989            $C$DW$T$63      .dwtag  DW_TAG_typedef
    3990                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    3991                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    3992                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3993                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3994                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    3995                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    3996            
    3997            
    3998            $C$DW$T$29      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   81

    3999                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    4000                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4001            $C$DW$227       .dwtag  DW_TAG_member
    4002                    .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    4003                    .dwattr $C$DW$227, DW_AT_name("compareRegister")
    4004                    .dwattr $C$DW$227, DW_AT_TI_symbol_name("compareRegister")
    4005                    .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4006                    .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4007                    .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4008                    .dwattr $C$DW$227, DW_AT_decl_line(0x145)
    4009                    .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    4010            
    4011            $C$DW$228       .dwtag  DW_TAG_member
    4012                    .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    4013                    .dwattr $C$DW$228, DW_AT_name("compareInterruptEnable")
    4014                    .dwattr $C$DW$228, DW_AT_TI_symbol_name("compareInterruptEnable")
    4015                    .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4016                    .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4017                    .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4018                    .dwattr $C$DW$228, DW_AT_decl_line(0x14a)
    4019                    .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    4020            
    4021            $C$DW$229       .dwtag  DW_TAG_member
    4022                    .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    4023                    .dwattr $C$DW$229, DW_AT_name("compareOutputMode")
    4024                    .dwattr $C$DW$229, DW_AT_TI_symbol_name("compareOutputMode")
    4025                    .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4026                    .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4027                    .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4028                    .dwattr $C$DW$229, DW_AT_decl_line(0x155)
    4029                    .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    4030            
    4031            $C$DW$230       .dwtag  DW_TAG_member
    4032                    .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
    4033                    .dwattr $C$DW$230, DW_AT_name("compareValue")
    4034                    .dwattr $C$DW$230, DW_AT_TI_symbol_name("compareValue")
    4035                    .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4036                    .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4037                    .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4038                    .dwattr $C$DW$230, DW_AT_decl_line(0x157)
    4039                    .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    4040            
    4041                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4042                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4043                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4044                    .dwendtag $C$DW$T$29
    4045            
    4046            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4047                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4048                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4049                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4050                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4051                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4052                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    4053            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   82

    4054            
    4055            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4056                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    4057                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4058            $C$DW$231       .dwtag  DW_TAG_member
    4059                    .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$27)
    4060                    .dwattr $C$DW$231, DW_AT_name("clockSource")
    4061                    .dwattr $C$DW$231, DW_AT_TI_symbol_name("clockSource")
    4062                    .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4063                    .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4064                    .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4065                    .dwattr $C$DW$231, DW_AT_decl_line(0x20)
    4066                    .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    4067            
    4068            $C$DW$232       .dwtag  DW_TAG_member
    4069                    .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    4070                    .dwattr $C$DW$232, DW_AT_name("clockSourceDivider")
    4071                    .dwattr $C$DW$232, DW_AT_TI_symbol_name("clockSourceDivider")
    4072                    .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4073                    .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4074                    .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4075                    .dwattr $C$DW$232, DW_AT_decl_line(0x37)
    4076                    .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    4077            
    4078            $C$DW$233       .dwtag  DW_TAG_member
    4079                    .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    4080                    .dwattr $C$DW$233, DW_AT_name("timerInterruptEnable_TAIE")
    4081                    .dwattr $C$DW$233, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4082                    .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4083                    .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4084                    .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4085                    .dwattr $C$DW$233, DW_AT_decl_line(0x3c)
    4086                    .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    4087            
    4088            $C$DW$234       .dwtag  DW_TAG_member
    4089                    .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    4090                    .dwattr $C$DW$234, DW_AT_name("timerClear")
    4091                    .dwattr $C$DW$234, DW_AT_TI_symbol_name("timerClear")
    4092                    .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4093                    .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4094                    .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4095                    .dwattr $C$DW$234, DW_AT_decl_line(0x42)
    4096                    .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    4097            
    4098            $C$DW$235       .dwtag  DW_TAG_member
    4099                    .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$30)
    4100                    .dwattr $C$DW$235, DW_AT_name("startTimer")
    4101                    .dwattr $C$DW$235, DW_AT_TI_symbol_name("startTimer")
    4102                    .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4103                    .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4104                    .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4105                    .dwattr $C$DW$235, DW_AT_decl_line(0x44)
    4106                    .dwattr $C$DW$235, DW_AT_decl_column(0x0a)
    4107            
    4108                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   83

    4109                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    4110                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4111                    .dwendtag $C$DW$T$31
    4112            
    4113            $C$DW$T$65      .dwtag  DW_TAG_typedef
    4114                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    4115                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    4116                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4117                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4118                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    4119                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4120            
    4121            
    4122            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4123                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    4124                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    4125            $C$DW$236       .dwtag  DW_TAG_member
    4126                    .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    4127                    .dwattr $C$DW$236, DW_AT_name("clockSource")
    4128                    .dwattr $C$DW$236, DW_AT_TI_symbol_name("clockSource")
    4129                    .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4130                    .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4131                    .dwattr $C$DW$236, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4132                    .dwattr $C$DW$236, DW_AT_decl_line(0x8b)
    4133                    .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    4134            
    4135            $C$DW$237       .dwtag  DW_TAG_member
    4136                    .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    4137                    .dwattr $C$DW$237, DW_AT_name("clockSourceDivider")
    4138                    .dwattr $C$DW$237, DW_AT_TI_symbol_name("clockSourceDivider")
    4139                    .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4140                    .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4141                    .dwattr $C$DW$237, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4142                    .dwattr $C$DW$237, DW_AT_decl_line(0xa2)
    4143                    .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    4144            
    4145            $C$DW$238       .dwtag  DW_TAG_member
    4146                    .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    4147                    .dwattr $C$DW$238, DW_AT_name("timerPeriod")
    4148                    .dwattr $C$DW$238, DW_AT_TI_symbol_name("timerPeriod")
    4149                    .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4150                    .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4151                    .dwattr $C$DW$238, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4152                    .dwattr $C$DW$238, DW_AT_decl_line(0xa4)
    4153                    .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    4154            
    4155            $C$DW$239       .dwtag  DW_TAG_member
    4156                    .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4157                    .dwattr $C$DW$239, DW_AT_name("timerInterruptEnable_TAIE")
    4158                    .dwattr $C$DW$239, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4159                    .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4160                    .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4161                    .dwattr $C$DW$239, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4162                    .dwattr $C$DW$239, DW_AT_decl_line(0xa9)
    4163                    .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   84

    4164            
    4165            $C$DW$240       .dwtag  DW_TAG_member
    4166                    .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    4167                    .dwattr $C$DW$240, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4168                    .dwattr $C$DW$240, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4169                    .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4170                    .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4171                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4172                    .dwattr $C$DW$240, DW_AT_decl_line(0xae)
    4173                    .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    4174            
    4175            $C$DW$241       .dwtag  DW_TAG_member
    4176                    .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$27)
    4177                    .dwattr $C$DW$241, DW_AT_name("timerClear")
    4178                    .dwattr $C$DW$241, DW_AT_TI_symbol_name("timerClear")
    4179                    .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4180                    .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4181                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4182                    .dwattr $C$DW$241, DW_AT_decl_line(0xb4)
    4183                    .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    4184            
    4185            $C$DW$242       .dwtag  DW_TAG_member
    4186                    .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$30)
    4187                    .dwattr $C$DW$242, DW_AT_name("startTimer")
    4188                    .dwattr $C$DW$242, DW_AT_TI_symbol_name("startTimer")
    4189                    .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4190                    .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4191                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4192                    .dwattr $C$DW$242, DW_AT_decl_line(0xb6)
    4193                    .dwattr $C$DW$242, DW_AT_decl_column(0x0a)
    4194            
    4195                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4196                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    4197                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4198                    .dwendtag $C$DW$T$32
    4199            
    4200            $C$DW$T$66      .dwtag  DW_TAG_typedef
    4201                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    4202                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    4203                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4204                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4205                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    4206                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    4207            
    4208            
    4209            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4210                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    4211                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    4212            $C$DW$243       .dwtag  DW_TAG_member
    4213                    .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    4214                    .dwattr $C$DW$243, DW_AT_name("clockSource")
    4215                    .dwattr $C$DW$243, DW_AT_TI_symbol_name("clockSource")
    4216                    .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4217                    .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4218                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   85

    4219                    .dwattr $C$DW$243, DW_AT_decl_line(0x105)
    4220                    .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    4221            
    4222            $C$DW$244       .dwtag  DW_TAG_member
    4223                    .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$27)
    4224                    .dwattr $C$DW$244, DW_AT_name("clockSourceDivider")
    4225                    .dwattr $C$DW$244, DW_AT_TI_symbol_name("clockSourceDivider")
    4226                    .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4227                    .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4228                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4229                    .dwattr $C$DW$244, DW_AT_decl_line(0x11c)
    4230                    .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    4231            
    4232            $C$DW$245       .dwtag  DW_TAG_member
    4233                    .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$27)
    4234                    .dwattr $C$DW$245, DW_AT_name("timerPeriod")
    4235                    .dwattr $C$DW$245, DW_AT_TI_symbol_name("timerPeriod")
    4236                    .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4237                    .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4238                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4239                    .dwattr $C$DW$245, DW_AT_decl_line(0x11f)
    4240                    .dwattr $C$DW$245, DW_AT_decl_column(0x0e)
    4241            
    4242            $C$DW$246       .dwtag  DW_TAG_member
    4243                    .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    4244                    .dwattr $C$DW$246, DW_AT_name("timerInterruptEnable_TAIE")
    4245                    .dwattr $C$DW$246, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    4246                    .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4247                    .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4248                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4249                    .dwattr $C$DW$246, DW_AT_decl_line(0x124)
    4250                    .dwattr $C$DW$246, DW_AT_decl_column(0x0e)
    4251            
    4252            $C$DW$247       .dwtag  DW_TAG_member
    4253                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    4254                    .dwattr $C$DW$247, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4255                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4256                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4257                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4258                    .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4259                    .dwattr $C$DW$247, DW_AT_decl_line(0x129)
    4260                    .dwattr $C$DW$247, DW_AT_decl_column(0x0e)
    4261            
    4262            $C$DW$248       .dwtag  DW_TAG_member
    4263                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    4264                    .dwattr $C$DW$248, DW_AT_name("timerClear")
    4265                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("timerClear")
    4266                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4267                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4268                    .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4269                    .dwattr $C$DW$248, DW_AT_decl_line(0x12f)
    4270                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4271            
    4272            $C$DW$249       .dwtag  DW_TAG_member
    4273                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$30)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   86

    4274                    .dwattr $C$DW$249, DW_AT_name("startTimer")
    4275                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("startTimer")
    4276                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4277                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4278                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4279                    .dwattr $C$DW$249, DW_AT_decl_line(0x131)
    4280                    .dwattr $C$DW$249, DW_AT_decl_column(0x0a)
    4281            
    4282                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4283                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    4284                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4285                    .dwendtag $C$DW$T$33
    4286            
    4287            $C$DW$T$67      .dwtag  DW_TAG_typedef
    4288                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    4289                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    4290                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4291                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4292                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    4293                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    4294            
    4295            
    4296            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4297                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    4298                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    4299            $C$DW$250       .dwtag  DW_TAG_member
    4300                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    4301                    .dwattr $C$DW$250, DW_AT_name("clockSource")
    4302                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("clockSource")
    4303                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4304                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4305                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4306                    .dwattr $C$DW$250, DW_AT_decl_line(0xc5)
    4307                    .dwattr $C$DW$250, DW_AT_decl_column(0x0e)
    4308            
    4309            $C$DW$251       .dwtag  DW_TAG_member
    4310                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$27)
    4311                    .dwattr $C$DW$251, DW_AT_name("clockSourceDivider")
    4312                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("clockSourceDivider")
    4313                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4314                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4315                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4316                    .dwattr $C$DW$251, DW_AT_decl_line(0xdc)
    4317                    .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    4318            
    4319            $C$DW$252       .dwtag  DW_TAG_member
    4320                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    4321                    .dwattr $C$DW$252, DW_AT_name("timerPeriod")
    4322                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("timerPeriod")
    4323                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4324                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4325                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4326                    .dwattr $C$DW$252, DW_AT_decl_line(0xde)
    4327                    .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    4328            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   87

    4329            $C$DW$253       .dwtag  DW_TAG_member
    4330                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    4331                    .dwattr $C$DW$253, DW_AT_name("compareRegister")
    4332                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("compareRegister")
    4333                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4334                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4335                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4336                    .dwattr $C$DW$253, DW_AT_decl_line(0xe9)
    4337                    .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    4338            
    4339            $C$DW$254       .dwtag  DW_TAG_member
    4340                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4341                    .dwattr $C$DW$254, DW_AT_name("compareOutputMode")
    4342                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("compareOutputMode")
    4343                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4344                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4345                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4346                    .dwattr $C$DW$254, DW_AT_decl_line(0xf4)
    4347                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4348            
    4349            $C$DW$255       .dwtag  DW_TAG_member
    4350                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4351                    .dwattr $C$DW$255, DW_AT_name("dutyCycle")
    4352                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("dutyCycle")
    4353                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4354                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4355                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4356                    .dwattr $C$DW$255, DW_AT_decl_line(0xf6)
    4357                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4358            
    4359                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4360                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    4361                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4362                    .dwendtag $C$DW$T$34
    4363            
    4364            $C$DW$T$68      .dwtag  DW_TAG_typedef
    4365                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    4366                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    4367                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4368                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4369                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    4370                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    4371            
    4372            
    4373            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4374                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    4375                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    4376            $C$DW$256       .dwtag  DW_TAG_member
    4377                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4378                    .dwattr $C$DW$256, DW_AT_name("captureRegister")
    4379                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("captureRegister")
    4380                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4381                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4382                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4383                    .dwattr $C$DW$256, DW_AT_decl_line(0xa0)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   88

    4384                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4385            
    4386            $C$DW$257       .dwtag  DW_TAG_member
    4387                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4388                    .dwattr $C$DW$257, DW_AT_name("captureMode")
    4389                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("captureMode")
    4390                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4391                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4392                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4393                    .dwattr $C$DW$257, DW_AT_decl_line(0xa7)
    4394                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4395            
    4396            $C$DW$258       .dwtag  DW_TAG_member
    4397                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    4398                    .dwattr $C$DW$258, DW_AT_name("captureInputSelect")
    4399                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("captureInputSelect")
    4400                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4401                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4402                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4403                    .dwattr $C$DW$258, DW_AT_decl_line(0xae)
    4404                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    4405            
    4406            $C$DW$259       .dwtag  DW_TAG_member
    4407                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    4408                    .dwattr $C$DW$259, DW_AT_name("synchronizeCaptureSource")
    4409                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4410                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4411                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4412                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4413                    .dwattr $C$DW$259, DW_AT_decl_line(0xb3)
    4414                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4415            
    4416            $C$DW$260       .dwtag  DW_TAG_member
    4417                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    4418                    .dwattr $C$DW$260, DW_AT_name("captureInterruptEnable")
    4419                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("captureInterruptEnable")
    4420                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4421                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4422                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4423                    .dwattr $C$DW$260, DW_AT_decl_line(0xb8)
    4424                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    4425            
    4426            $C$DW$261       .dwtag  DW_TAG_member
    4427                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    4428                    .dwattr $C$DW$261, DW_AT_name("captureOutputMode")
    4429                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("captureOutputMode")
    4430                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4431                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4432                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4433                    .dwattr $C$DW$261, DW_AT_decl_line(0xc3)
    4434                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    4435            
    4436                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4437                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    4438                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   89

    4439                    .dwendtag $C$DW$T$35
    4440            
    4441            $C$DW$T$69      .dwtag  DW_TAG_typedef
    4442                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    4443                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    4444                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4445                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4446                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    4447                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    4448            
    4449            
    4450            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4451                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    4452                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    4453            $C$DW$262       .dwtag  DW_TAG_member
    4454                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    4455                    .dwattr $C$DW$262, DW_AT_name("compareRegister")
    4456                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("compareRegister")
    4457                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4458                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4459                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4460                    .dwattr $C$DW$262, DW_AT_decl_line(0x146)
    4461                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    4462            
    4463            $C$DW$263       .dwtag  DW_TAG_member
    4464                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    4465                    .dwattr $C$DW$263, DW_AT_name("compareInterruptEnable")
    4466                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("compareInterruptEnable")
    4467                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4468                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4469                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4470                    .dwattr $C$DW$263, DW_AT_decl_line(0x14b)
    4471                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    4472            
    4473            $C$DW$264       .dwtag  DW_TAG_member
    4474                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    4475                    .dwattr $C$DW$264, DW_AT_name("compareOutputMode")
    4476                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("compareOutputMode")
    4477                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4478                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4479                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4480                    .dwattr $C$DW$264, DW_AT_decl_line(0x156)
    4481                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    4482            
    4483            $C$DW$265       .dwtag  DW_TAG_member
    4484                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    4485                    .dwattr $C$DW$265, DW_AT_name("compareValue")
    4486                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("compareValue")
    4487                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4488                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4489                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4490                    .dwattr $C$DW$265, DW_AT_decl_line(0x158)
    4491                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    4492            
    4493                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   90

    4494                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    4495                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4496                    .dwendtag $C$DW$T$36
    4497            
    4498            $C$DW$T$70      .dwtag  DW_TAG_typedef
    4499                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    4500                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    4501                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4502                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4503                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    4504                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    4505            
    4506            
    4507            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4508                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    4509                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4510            $C$DW$266       .dwtag  DW_TAG_member
    4511                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    4512                    .dwattr $C$DW$266, DW_AT_name("clockSource")
    4513                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("clockSource")
    4514                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4515                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4516                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4517                    .dwattr $C$DW$266, DW_AT_decl_line(0xd3)
    4518                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    4519            
    4520            $C$DW$267       .dwtag  DW_TAG_member
    4521                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    4522                    .dwattr $C$DW$267, DW_AT_name("clockSourceDivider")
    4523                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("clockSourceDivider")
    4524                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4525                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4526                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4527                    .dwattr $C$DW$267, DW_AT_decl_line(0xea)
    4528                    .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    4529            
    4530            $C$DW$268       .dwtag  DW_TAG_member
    4531                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    4532                    .dwattr $C$DW$268, DW_AT_name("timerInterruptEnable_TBIE")
    4533                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4534                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4535                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4536                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4537                    .dwattr $C$DW$268, DW_AT_decl_line(0xef)
    4538                    .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    4539            
    4540            $C$DW$269       .dwtag  DW_TAG_member
    4541                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    4542                    .dwattr $C$DW$269, DW_AT_name("timerClear")
    4543                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("timerClear")
    4544                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4545                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4546                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4547                    .dwattr $C$DW$269, DW_AT_decl_line(0xf5)
    4548                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   91

    4549            
    4550            $C$DW$270       .dwtag  DW_TAG_member
    4551                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$30)
    4552                    .dwattr $C$DW$270, DW_AT_name("startTimer")
    4553                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("startTimer")
    4554                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4555                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4556                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4557                    .dwattr $C$DW$270, DW_AT_decl_line(0xf7)
    4558                    .dwattr $C$DW$270, DW_AT_decl_column(0x0a)
    4559            
    4560                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4561                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    4562                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4563                    .dwendtag $C$DW$T$37
    4564            
    4565            $C$DW$T$71      .dwtag  DW_TAG_typedef
    4566                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    4567                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    4568                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4569                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4570                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    4571                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    4572            
    4573            
    4574            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4575                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    4576                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    4577            $C$DW$271       .dwtag  DW_TAG_member
    4578                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    4579                    .dwattr $C$DW$271, DW_AT_name("clockSource")
    4580                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("clockSource")
    4581                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4582                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4583                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4584                    .dwattr $C$DW$271, DW_AT_decl_line(0x107)
    4585                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    4586            
    4587            $C$DW$272       .dwtag  DW_TAG_member
    4588                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    4589                    .dwattr $C$DW$272, DW_AT_name("clockSourceDivider")
    4590                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("clockSourceDivider")
    4591                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4592                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4593                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4594                    .dwattr $C$DW$272, DW_AT_decl_line(0x11e)
    4595                    .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
    4596            
    4597            $C$DW$273       .dwtag  DW_TAG_member
    4598                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    4599                    .dwattr $C$DW$273, DW_AT_name("timerPeriod")
    4600                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("timerPeriod")
    4601                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4602                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4603                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   92

    4604                    .dwattr $C$DW$273, DW_AT_decl_line(0x120)
    4605                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    4606            
    4607            $C$DW$274       .dwtag  DW_TAG_member
    4608                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    4609                    .dwattr $C$DW$274, DW_AT_name("timerInterruptEnable_TBIE")
    4610                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4611                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4612                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4613                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4614                    .dwattr $C$DW$274, DW_AT_decl_line(0x125)
    4615                    .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    4616            
    4617            $C$DW$275       .dwtag  DW_TAG_member
    4618                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$27)
    4619                    .dwattr $C$DW$275, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4620                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4621                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4622                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4623                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4624                    .dwattr $C$DW$275, DW_AT_decl_line(0x12a)
    4625                    .dwattr $C$DW$275, DW_AT_decl_column(0x0e)
    4626            
    4627            $C$DW$276       .dwtag  DW_TAG_member
    4628                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    4629                    .dwattr $C$DW$276, DW_AT_name("timerClear")
    4630                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("timerClear")
    4631                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4632                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4633                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4634                    .dwattr $C$DW$276, DW_AT_decl_line(0x130)
    4635                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    4636            
    4637            $C$DW$277       .dwtag  DW_TAG_member
    4638                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$30)
    4639                    .dwattr $C$DW$277, DW_AT_name("startTimer")
    4640                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("startTimer")
    4641                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4642                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4643                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4644                    .dwattr $C$DW$277, DW_AT_decl_line(0x132)
    4645                    .dwattr $C$DW$277, DW_AT_decl_column(0x0a)
    4646            
    4647                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4648                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    4649                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4650                    .dwendtag $C$DW$T$38
    4651            
    4652            $C$DW$T$72      .dwtag  DW_TAG_typedef
    4653                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    4654                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4655                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4656                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4657                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    4658                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   93

    4659            
    4660            
    4661            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4662                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    4663                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    4664            $C$DW$278       .dwtag  DW_TAG_member
    4665                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    4666                    .dwattr $C$DW$278, DW_AT_name("clockSource")
    4667                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("clockSource")
    4668                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4669                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4670                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4671                    .dwattr $C$DW$278, DW_AT_decl_line(0x60)
    4672                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    4673            
    4674            $C$DW$279       .dwtag  DW_TAG_member
    4675                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    4676                    .dwattr $C$DW$279, DW_AT_name("clockSourceDivider")
    4677                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("clockSourceDivider")
    4678                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4679                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4680                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4681                    .dwattr $C$DW$279, DW_AT_decl_line(0x77)
    4682                    .dwattr $C$DW$279, DW_AT_decl_column(0x0e)
    4683            
    4684            $C$DW$280       .dwtag  DW_TAG_member
    4685                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    4686                    .dwattr $C$DW$280, DW_AT_name("timerPeriod")
    4687                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("timerPeriod")
    4688                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4689                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4690                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4691                    .dwattr $C$DW$280, DW_AT_decl_line(0x7a)
    4692                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    4693            
    4694            $C$DW$281       .dwtag  DW_TAG_member
    4695                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    4696                    .dwattr $C$DW$281, DW_AT_name("timerInterruptEnable_TBIE")
    4697                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    4698                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4699                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4700                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4701                    .dwattr $C$DW$281, DW_AT_decl_line(0x7f)
    4702                    .dwattr $C$DW$281, DW_AT_decl_column(0x0e)
    4703            
    4704            $C$DW$282       .dwtag  DW_TAG_member
    4705                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$27)
    4706                    .dwattr $C$DW$282, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    4707                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    4708                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4709                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4710                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4711                    .dwattr $C$DW$282, DW_AT_decl_line(0x84)
    4712                    .dwattr $C$DW$282, DW_AT_decl_column(0x0e)
    4713            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   94

    4714            $C$DW$283       .dwtag  DW_TAG_member
    4715                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    4716                    .dwattr $C$DW$283, DW_AT_name("timerClear")
    4717                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("timerClear")
    4718                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4719                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4720                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4721                    .dwattr $C$DW$283, DW_AT_decl_line(0x8a)
    4722                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    4723            
    4724            $C$DW$284       .dwtag  DW_TAG_member
    4725                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$30)
    4726                    .dwattr $C$DW$284, DW_AT_name("startTimer")
    4727                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("startTimer")
    4728                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4729                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4730                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4731                    .dwattr $C$DW$284, DW_AT_decl_line(0x8c)
    4732                    .dwattr $C$DW$284, DW_AT_decl_column(0x0a)
    4733            
    4734                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4735                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    4736                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    4737                    .dwendtag $C$DW$T$39
    4738            
    4739            $C$DW$T$73      .dwtag  DW_TAG_typedef
    4740                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    4741                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    4742                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4743                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4744                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    4745                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4746            
    4747            
    4748            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4749                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    4750                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4751            $C$DW$285       .dwtag  DW_TAG_member
    4752                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    4753                    .dwattr $C$DW$285, DW_AT_name("clockSource")
    4754                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("clockSource")
    4755                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4756                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4757                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4758                    .dwattr $C$DW$285, DW_AT_decl_line(0x20)
    4759                    .dwattr $C$DW$285, DW_AT_decl_column(0x0e)
    4760            
    4761            $C$DW$286       .dwtag  DW_TAG_member
    4762                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    4763                    .dwattr $C$DW$286, DW_AT_name("clockSourceDivider")
    4764                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("clockSourceDivider")
    4765                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4766                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4767                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4768                    .dwattr $C$DW$286, DW_AT_decl_line(0x37)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   95

    4769                    .dwattr $C$DW$286, DW_AT_decl_column(0x0e)
    4770            
    4771            $C$DW$287       .dwtag  DW_TAG_member
    4772                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    4773                    .dwattr $C$DW$287, DW_AT_name("timerPeriod")
    4774                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("timerPeriod")
    4775                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4776                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4777                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4778                    .dwattr $C$DW$287, DW_AT_decl_line(0x39)
    4779                    .dwattr $C$DW$287, DW_AT_decl_column(0x0e)
    4780            
    4781            $C$DW$288       .dwtag  DW_TAG_member
    4782                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
    4783                    .dwattr $C$DW$288, DW_AT_name("compareRegister")
    4784                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("compareRegister")
    4785                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4786                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4787                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4788                    .dwattr $C$DW$288, DW_AT_decl_line(0x44)
    4789                    .dwattr $C$DW$288, DW_AT_decl_column(0x0e)
    4790            
    4791            $C$DW$289       .dwtag  DW_TAG_member
    4792                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    4793                    .dwattr $C$DW$289, DW_AT_name("compareOutputMode")
    4794                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("compareOutputMode")
    4795                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4796                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4797                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4798                    .dwattr $C$DW$289, DW_AT_decl_line(0x4f)
    4799                    .dwattr $C$DW$289, DW_AT_decl_column(0x0e)
    4800            
    4801            $C$DW$290       .dwtag  DW_TAG_member
    4802                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$27)
    4803                    .dwattr $C$DW$290, DW_AT_name("dutyCycle")
    4804                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("dutyCycle")
    4805                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4806                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4807                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4808                    .dwattr $C$DW$290, DW_AT_decl_line(0x51)
    4809                    .dwattr $C$DW$290, DW_AT_decl_column(0x0e)
    4810            
    4811                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4812                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    4813                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4814                    .dwendtag $C$DW$T$40
    4815            
    4816            $C$DW$T$74      .dwtag  DW_TAG_typedef
    4817                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    4818                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    4819                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4820                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4821                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    4822                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4823            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   96

    4824            
    4825            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4826                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    4827                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4828            $C$DW$291       .dwtag  DW_TAG_member
    4829                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$24)
    4830                    .dwattr $C$DW$291, DW_AT_name("selectClockSource")
    4831                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("selectClockSource")
    4832                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4833                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4834                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4835                    .dwattr $C$DW$291, DW_AT_decl_line(0x1c)
    4836                    .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    4837            
    4838            $C$DW$292       .dwtag  DW_TAG_member
    4839                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
    4840                    .dwattr $C$DW$292, DW_AT_name("clockPrescalar")
    4841                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("clockPrescalar")
    4842                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4843                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4844                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4845                    .dwattr $C$DW$292, DW_AT_decl_line(0x1e)
    4846                    .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    4847            
    4848            $C$DW$293       .dwtag  DW_TAG_member
    4849                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$24)
    4850                    .dwattr $C$DW$293, DW_AT_name("firstModReg")
    4851                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("firstModReg")
    4852                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4853                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4854                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4855                    .dwattr $C$DW$293, DW_AT_decl_line(0x22)
    4856                    .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    4857            
    4858            $C$DW$294       .dwtag  DW_TAG_member
    4859                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$24)
    4860                    .dwattr $C$DW$294, DW_AT_name("secondModReg")
    4861                    .dwattr $C$DW$294, DW_AT_TI_symbol_name("secondModReg")
    4862                    .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4863                    .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4864                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4865                    .dwattr $C$DW$294, DW_AT_decl_line(0x26)
    4866                    .dwattr $C$DW$294, DW_AT_decl_column(0x0d)
    4867            
    4868            $C$DW$295       .dwtag  DW_TAG_member
    4869                    .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$24)
    4870                    .dwattr $C$DW$295, DW_AT_name("parity")
    4871                    .dwattr $C$DW$295, DW_AT_TI_symbol_name("parity")
    4872                    .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4873                    .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4874                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4875                    .dwattr $C$DW$295, DW_AT_decl_line(0x2c)
    4876                    .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    4877            
    4878            $C$DW$296       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   97

    4879                    .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$24)
    4880                    .dwattr $C$DW$296, DW_AT_name("msborLsbFirst")
    4881                    .dwattr $C$DW$296, DW_AT_TI_symbol_name("msborLsbFirst")
    4882                    .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4883                    .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4884                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4885                    .dwattr $C$DW$296, DW_AT_decl_line(0x31)
    4886                    .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    4887            
    4888            $C$DW$297       .dwtag  DW_TAG_member
    4889                    .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$24)
    4890                    .dwattr $C$DW$297, DW_AT_name("numberofStopBits")
    4891                    .dwattr $C$DW$297, DW_AT_TI_symbol_name("numberofStopBits")
    4892                    .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4893                    .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4894                    .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4895                    .dwattr $C$DW$297, DW_AT_decl_line(0x36)
    4896                    .dwattr $C$DW$297, DW_AT_decl_column(0x0d)
    4897            
    4898            $C$DW$298       .dwtag  DW_TAG_member
    4899                    .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$24)
    4900                    .dwattr $C$DW$298, DW_AT_name("uartMode")
    4901                    .dwattr $C$DW$298, DW_AT_TI_symbol_name("uartMode")
    4902                    .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4903                    .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4904                    .dwattr $C$DW$298, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4905                    .dwattr $C$DW$298, DW_AT_decl_line(0x3d)
    4906                    .dwattr $C$DW$298, DW_AT_decl_column(0x0d)
    4907            
    4908            $C$DW$299       .dwtag  DW_TAG_member
    4909                    .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$24)
    4910                    .dwattr $C$DW$299, DW_AT_name("overSampling")
    4911                    .dwattr $C$DW$299, DW_AT_TI_symbol_name("overSampling")
    4912                    .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4913                    .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4914                    .dwattr $C$DW$299, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4915                    .dwattr $C$DW$299, DW_AT_decl_line(0x42)
    4916                    .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    4917            
    4918                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4919                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    4920                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    4921                    .dwendtag $C$DW$T$41
    4922            
    4923            $C$DW$T$75      .dwtag  DW_TAG_typedef
    4924                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    4925                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4926                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4927                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4928                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    4929                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    4930            
    4931            
    4932            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4933                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   98

    4934                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    4935            $C$DW$300       .dwtag  DW_TAG_member
    4936                    .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$43)
    4937                    .dwattr $C$DW$300, DW_AT_name("clockSourceFrequency")
    4938                    .dwattr $C$DW$300, DW_AT_TI_symbol_name("clockSourceFrequency")
    4939                    .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4940                    .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4941                    .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4942                    .dwattr $C$DW$300, DW_AT_decl_line(0x31)
    4943                    .dwattr $C$DW$300, DW_AT_decl_column(0x0e)
    4944            
    4945            $C$DW$301       .dwtag  DW_TAG_member
    4946                    .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$43)
    4947                    .dwattr $C$DW$301, DW_AT_name("desiredSpiClock")
    4948                    .dwattr $C$DW$301, DW_AT_TI_symbol_name("desiredSpiClock")
    4949                    .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4950                    .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4951                    .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4952                    .dwattr $C$DW$301, DW_AT_decl_line(0x33)
    4953                    .dwattr $C$DW$301, DW_AT_decl_column(0x0e)
    4954            
    4955                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4956                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    4957                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4958                    .dwendtag $C$DW$T$44
    4959            
    4960            $C$DW$T$76      .dwtag  DW_TAG_typedef
    4961                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    4962                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    4963                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4964                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    4965                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    4966                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    4967            
    4968            
    4969            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4970                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    4971                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    4972            $C$DW$302       .dwtag  DW_TAG_member
    4973                    .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$24)
    4974                    .dwattr $C$DW$302, DW_AT_name("selectClockSource")
    4975                    .dwattr $C$DW$302, DW_AT_TI_symbol_name("selectClockSource")
    4976                    .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4977                    .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4978                    .dwattr $C$DW$302, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4979                    .dwattr $C$DW$302, DW_AT_decl_line(0x14)
    4980                    .dwattr $C$DW$302, DW_AT_decl_column(0x0d)
    4981            
    4982            $C$DW$303       .dwtag  DW_TAG_member
    4983                    .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$43)
    4984                    .dwattr $C$DW$303, DW_AT_name("clockSourceFrequency")
    4985                    .dwattr $C$DW$303, DW_AT_TI_symbol_name("clockSourceFrequency")
    4986                    .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4987                    .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4988                    .dwattr $C$DW$303, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:05 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
run.asm                                                              PAGE   99

    4989                    .dwattr $C$DW$303, DW_AT_decl_line(0x16)
    4990                    .dwattr $C$DW$303, DW_AT_decl_column(0x0e)
    4991            
    4992            $C$DW$304       .dwtag  DW_TAG_member
    4993                    .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$43)
    4994                    .dwattr $C$DW$304, DW_AT_name("desiredSpiClock")
    4995                    .dwattr $C$DW$304, DW_AT_TI_symbol_name("desiredSpiClock")
    4996                    .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4997                    .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4998                    .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    4999                    .dwattr $C$DW$304, DW_AT_decl_line(0x18)
    5000                    .dwattr $C$DW$304, DW_AT_decl_column(0x0e)
    5001            
    5002            $C$DW$305       .dwtag  DW_TAG_member
    5003                    .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$24)
    5004                    .dwattr $C$DW$305, DW_AT_name("msbFirst")
    5005                    .dwattr $C$DW$305, DW_AT_TI_symbol_name("msbFirst")
    5006                    .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5007                    .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5008                    .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5009                    .dwattr $C$DW$305, DW_AT_decl_line(0x1d)
    5010                    .dwattr $C$DW$305, DW_AT_decl_column(0x0d)
    5011            
