MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:05 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/shutdown.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PCOUT_L")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PCOUT_L")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$89)

    2506                    .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2507                    .dwattr $C$DW$122, DW_AT_decl_line(0x76)
    2508                    .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    2509            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   49

    2510            $C$DW$123       .dwtag  DW_TAG_enumerator
    2511                    .dwattr $C$DW$123, DW_AT_name("ack")
    2512                    .dwattr $C$DW$123, DW_AT_const_value(0x07)
    2513                    .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2514                    .dwattr $C$DW$123, DW_AT_decl_line(0x77)
    2515                    .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    2516            
    2517            $C$DW$124       .dwtag  DW_TAG_enumerator
    2518                    .dwattr $C$DW$124, DW_AT_name("var")
    2519                    .dwattr $C$DW$124, DW_AT_const_value(0x08)
    2520                    .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2521                    .dwattr $C$DW$124, DW_AT_decl_line(0x78)
    2522                    .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    2523            
    2524            $C$DW$125       .dwtag  DW_TAG_enumerator
    2525                    .dwattr $C$DW$125, DW_AT_name("UGmsg")
    2526                    .dwattr $C$DW$125, DW_AT_const_value(0x09)
    2527                    .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2528                    .dwattr $C$DW$125, DW_AT_decl_line(0x79)
    2529                    .dwattr $C$DW$125, DW_AT_decl_column(0x05)
    2530            
    2531                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2532                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    2533                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    2534                    .dwendtag $C$DW$T$57
    2535            
    2536            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2537                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    2538                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2539                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2540                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2541                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    2542                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    2543            
    2544            
    2545            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2546                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2547            $C$DW$126       .dwtag  DW_TAG_enumerator
    2548                    .dwattr $C$DW$126, DW_AT_name("init")
    2549                    .dwattr $C$DW$126, DW_AT_const_value(0x00)
    2550                    .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2551                    .dwattr $C$DW$126, DW_AT_decl_line(0x80)
    2552                    .dwattr $C$DW$126, DW_AT_decl_column(0x05)
    2553            
    2554            $C$DW$127       .dwtag  DW_TAG_enumerator
    2555                    .dwattr $C$DW$127, DW_AT_name("running")
    2556                    .dwattr $C$DW$127, DW_AT_const_value(0x01)
    2557                    .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    2558                    .dwattr $C$DW$127, DW_AT_decl_line(0x80)
    2559                    .dwattr $C$DW$127, DW_AT_decl_column(0x0b)
    2560            
    2561            $C$DW$128       .dwtag  DW_TAG_enumerator
    2562                    .dwattr $C$DW$128, DW_AT_name("wait")
    2563                    .dwattr $C$DW$128, DW_AT_const_value(0x02)
    2564                    .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   50

    2565                    .dwattr $C$DW$128, DW_AT_decl_line(0x80)
    2566                    .dwattr $C$DW$128, DW_AT_decl_column(0x14)
    2567            
    2568                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2569                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    2570                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    2571                    .dwendtag $C$DW$T$59
    2572            
    2573            $C$DW$T$60      .dwtag  DW_TAG_typedef
    2574                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    2575                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2576                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2577                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    2578                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    2579                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    2580            
    2581            
    2582            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2583                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2584            $C$DW$129       .dwtag  DW_TAG_member
    2585                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$14)
    2586                    .dwattr $C$DW$129, DW_AT_name("__max_align1")
    2587                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("__max_align1")
    2588                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2590                    .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2591                    .dwattr $C$DW$129, DW_AT_decl_line(0x7b)
    2592                    .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    2593            
    2594            $C$DW$130       .dwtag  DW_TAG_member
    2595                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$18)
    2596                    .dwattr $C$DW$130, DW_AT_name("__max_align2")
    2597                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("__max_align2")
    2598                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2599                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2600                    .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2601                    .dwattr $C$DW$130, DW_AT_decl_line(0x7c)
    2602                    .dwattr $C$DW$130, DW_AT_decl_column(0x0e)
    2603            
    2604                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2605                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    2606                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2607                    .dwendtag $C$DW$T$22
    2608            
    2609            $C$DW$T$61      .dwtag  DW_TAG_typedef
    2610                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    2611                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    2612                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2613                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2614                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    2615                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2616            
    2617            
    2618            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2619                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   51

    2620                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    2621            $C$DW$131       .dwtag  DW_TAG_member
    2622                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$24)
    2623                    .dwattr $C$DW$131, DW_AT_name("memoryBufferControlIndex")
    2624                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    2625                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2627                    .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2628                    .dwattr $C$DW$131, DW_AT_decl_line(0x27)
    2629                    .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2630            
    2631            $C$DW$132       .dwtag  DW_TAG_member
    2632                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$24)
    2633                    .dwattr $C$DW$132, DW_AT_name("inputSourceSelect")
    2634                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("inputSourceSelect")
    2635                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2636                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2637                    .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2638                    .dwattr $C$DW$132, DW_AT_decl_line(0x3b)
    2639                    .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2640            
    2641            $C$DW$133       .dwtag  DW_TAG_member
    2642                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$24)
    2643                    .dwattr $C$DW$133, DW_AT_name("positiveRefVoltageSourceSelect")
    2644                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    2645                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2646                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2647                    .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2648                    .dwattr $C$DW$133, DW_AT_decl_line(0x42)
    2649                    .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2650            
    2651            $C$DW$134       .dwtag  DW_TAG_member
    2652                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$24)
    2653                    .dwattr $C$DW$134, DW_AT_name("negativeRefVoltageSourceSelect")
    2654                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    2655                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2656                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2657                    .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2658                    .dwattr $C$DW$134, DW_AT_decl_line(0x48)
    2659                    .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2660            
    2661            $C$DW$135       .dwtag  DW_TAG_member
    2662                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$24)
    2663                    .dwattr $C$DW$135, DW_AT_name("endOfSequence")
    2664                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("endOfSequence")
    2665                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2666                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2667                    .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    2668                    .dwattr $C$DW$135, DW_AT_decl_line(0x51)
    2669                    .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2670            
    2671                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2672                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    2673                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2674                    .dwendtag $C$DW$T$25
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   52

    2675            
    2676            $C$DW$T$62      .dwtag  DW_TAG_typedef
    2677                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    2678                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    2679                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2680                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    2681                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    2682                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2683            
    2684            
    2685            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2686                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    2687                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2688            $C$DW$136       .dwtag  DW_TAG_member
    2689                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    2690                    .dwattr $C$DW$136, DW_AT_name("captureRegister")
    2691                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("captureRegister")
    2692                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2693                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2694                    .dwattr $C$DW$136, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2695                    .dwattr $C$DW$136, DW_AT_decl_line(0x58)
    2696                    .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2697            
    2698            $C$DW$137       .dwtag  DW_TAG_member
    2699                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    2700                    .dwattr $C$DW$137, DW_AT_name("captureMode")
    2701                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("captureMode")
    2702                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2703                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2704                    .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2705                    .dwattr $C$DW$137, DW_AT_decl_line(0x5f)
    2706                    .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2707            
    2708            $C$DW$138       .dwtag  DW_TAG_member
    2709                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2710                    .dwattr $C$DW$138, DW_AT_name("captureInputSelect")
    2711                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("captureInputSelect")
    2712                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2713                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2714                    .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2715                    .dwattr $C$DW$138, DW_AT_decl_line(0x66)
    2716                    .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2717            
    2718            $C$DW$139       .dwtag  DW_TAG_member
    2719                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2720                    .dwattr $C$DW$139, DW_AT_name("synchronizeCaptureSource")
    2721                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2722                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2723                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2724                    .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2725                    .dwattr $C$DW$139, DW_AT_decl_line(0x6b)
    2726                    .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2727            
    2728            $C$DW$140       .dwtag  DW_TAG_member
    2729                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   53

    2730                    .dwattr $C$DW$140, DW_AT_name("captureInterruptEnable")
    2731                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("captureInterruptEnable")
    2732                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2733                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2734                    .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2735                    .dwattr $C$DW$140, DW_AT_decl_line(0x70)
    2736                    .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2737            
    2738            $C$DW$141       .dwtag  DW_TAG_member
    2739                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2740                    .dwattr $C$DW$141, DW_AT_name("captureOutputMode")
    2741                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("captureOutputMode")
    2742                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2743                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2744                    .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2745                    .dwattr $C$DW$141, DW_AT_decl_line(0x7b)
    2746                    .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2747            
    2748                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2749                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    2750                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2751                    .dwendtag $C$DW$T$28
    2752            
    2753            $C$DW$T$63      .dwtag  DW_TAG_typedef
    2754                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    2755                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    2756                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2757                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2758                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    2759                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2760            
    2761            
    2762            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2763                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    2764                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2765            $C$DW$142       .dwtag  DW_TAG_member
    2766                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    2767                    .dwattr $C$DW$142, DW_AT_name("compareRegister")
    2768                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("compareRegister")
    2769                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2770                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2771                    .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2772                    .dwattr $C$DW$142, DW_AT_decl_line(0x145)
    2773                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2774            
    2775            $C$DW$143       .dwtag  DW_TAG_member
    2776                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    2777                    .dwattr $C$DW$143, DW_AT_name("compareInterruptEnable")
    2778                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("compareInterruptEnable")
    2779                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2780                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2781                    .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2782                    .dwattr $C$DW$143, DW_AT_decl_line(0x14a)
    2783                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2784            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   54

    2785            $C$DW$144       .dwtag  DW_TAG_member
    2786                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2787                    .dwattr $C$DW$144, DW_AT_name("compareOutputMode")
    2788                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("compareOutputMode")
    2789                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2790                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2791                    .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2792                    .dwattr $C$DW$144, DW_AT_decl_line(0x155)
    2793                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2794            
    2795            $C$DW$145       .dwtag  DW_TAG_member
    2796                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2797                    .dwattr $C$DW$145, DW_AT_name("compareValue")
    2798                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("compareValue")
    2799                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2800                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2801                    .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2802                    .dwattr $C$DW$145, DW_AT_decl_line(0x157)
    2803                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2804            
    2805                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2806                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    2807                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2808                    .dwendtag $C$DW$T$29
    2809            
    2810            $C$DW$T$64      .dwtag  DW_TAG_typedef
    2811                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    2812                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    2813                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2814                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2815                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    2816                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    2817            
    2818            
    2819            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2820                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    2821                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    2822            $C$DW$146       .dwtag  DW_TAG_member
    2823                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2824                    .dwattr $C$DW$146, DW_AT_name("clockSource")
    2825                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("clockSource")
    2826                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2827                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2828                    .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2829                    .dwattr $C$DW$146, DW_AT_decl_line(0x20)
    2830                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2831            
    2832            $C$DW$147       .dwtag  DW_TAG_member
    2833                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2834                    .dwattr $C$DW$147, DW_AT_name("clockSourceDivider")
    2835                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("clockSourceDivider")
    2836                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2837                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2838                    .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2839                    .dwattr $C$DW$147, DW_AT_decl_line(0x37)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   55

    2840                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2841            
    2842            $C$DW$148       .dwtag  DW_TAG_member
    2843                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2844                    .dwattr $C$DW$148, DW_AT_name("timerInterruptEnable_TAIE")
    2845                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2846                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2847                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2848                    .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2849                    .dwattr $C$DW$148, DW_AT_decl_line(0x3c)
    2850                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2851            
    2852            $C$DW$149       .dwtag  DW_TAG_member
    2853                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    2854                    .dwattr $C$DW$149, DW_AT_name("timerClear")
    2855                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("timerClear")
    2856                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2857                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2858                    .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2859                    .dwattr $C$DW$149, DW_AT_decl_line(0x42)
    2860                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2861            
    2862            $C$DW$150       .dwtag  DW_TAG_member
    2863                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    2864                    .dwattr $C$DW$150, DW_AT_name("startTimer")
    2865                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("startTimer")
    2866                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2867                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2868                    .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2869                    .dwattr $C$DW$150, DW_AT_decl_line(0x44)
    2870                    .dwattr $C$DW$150, DW_AT_decl_column(0x0a)
    2871            
    2872                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2873                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    2874                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2875                    .dwendtag $C$DW$T$31
    2876            
    2877            $C$DW$T$65      .dwtag  DW_TAG_typedef
    2878                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    2879                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    2880                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2881                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2882                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    2883                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    2884            
    2885            
    2886            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2887                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    2888                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    2889            $C$DW$151       .dwtag  DW_TAG_member
    2890                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2891                    .dwattr $C$DW$151, DW_AT_name("clockSource")
    2892                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("clockSource")
    2893                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2894                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   56

    2895                    .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2896                    .dwattr $C$DW$151, DW_AT_decl_line(0x8b)
    2897                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2898            
    2899            $C$DW$152       .dwtag  DW_TAG_member
    2900                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2901                    .dwattr $C$DW$152, DW_AT_name("clockSourceDivider")
    2902                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("clockSourceDivider")
    2903                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2904                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2905                    .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2906                    .dwattr $C$DW$152, DW_AT_decl_line(0xa2)
    2907                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    2908            
    2909            $C$DW$153       .dwtag  DW_TAG_member
    2910                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    2911                    .dwattr $C$DW$153, DW_AT_name("timerPeriod")
    2912                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("timerPeriod")
    2913                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2914                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2915                    .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2916                    .dwattr $C$DW$153, DW_AT_decl_line(0xa4)
    2917                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2918            
    2919            $C$DW$154       .dwtag  DW_TAG_member
    2920                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    2921                    .dwattr $C$DW$154, DW_AT_name("timerInterruptEnable_TAIE")
    2922                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2923                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2924                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2925                    .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2926                    .dwattr $C$DW$154, DW_AT_decl_line(0xa9)
    2927                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2928            
    2929            $C$DW$155       .dwtag  DW_TAG_member
    2930                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    2931                    .dwattr $C$DW$155, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2932                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2933                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2934                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2935                    .dwattr $C$DW$155, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2936                    .dwattr $C$DW$155, DW_AT_decl_line(0xae)
    2937                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2938            
    2939            $C$DW$156       .dwtag  DW_TAG_member
    2940                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    2941                    .dwattr $C$DW$156, DW_AT_name("timerClear")
    2942                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("timerClear")
    2943                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2944                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2945                    .dwattr $C$DW$156, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2946                    .dwattr $C$DW$156, DW_AT_decl_line(0xb4)
    2947                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2948            
    2949            $C$DW$157       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   57

    2950                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$30)
    2951                    .dwattr $C$DW$157, DW_AT_name("startTimer")
    2952                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("startTimer")
    2953                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2954                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2955                    .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2956                    .dwattr $C$DW$157, DW_AT_decl_line(0xb6)
    2957                    .dwattr $C$DW$157, DW_AT_decl_column(0x0a)
    2958            
    2959                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2960                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    2961                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2962                    .dwendtag $C$DW$T$32
    2963            
    2964            $C$DW$T$66      .dwtag  DW_TAG_typedef
    2965                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    2966                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    2967                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2968                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    2969                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    2970                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    2971            
    2972            
    2973            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2974                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    2975                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    2976            $C$DW$158       .dwtag  DW_TAG_member
    2977                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    2978                    .dwattr $C$DW$158, DW_AT_name("clockSource")
    2979                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSource")
    2980                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2981                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2982                    .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2983                    .dwattr $C$DW$158, DW_AT_decl_line(0x105)
    2984                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2985            
    2986            $C$DW$159       .dwtag  DW_TAG_member
    2987                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    2988                    .dwattr $C$DW$159, DW_AT_name("clockSourceDivider")
    2989                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("clockSourceDivider")
    2990                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2991                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2992                    .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    2993                    .dwattr $C$DW$159, DW_AT_decl_line(0x11c)
    2994                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2995            
    2996            $C$DW$160       .dwtag  DW_TAG_member
    2997                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    2998                    .dwattr $C$DW$160, DW_AT_name("timerPeriod")
    2999                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerPeriod")
    3000                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3001                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3002                    .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3003                    .dwattr $C$DW$160, DW_AT_decl_line(0x11f)
    3004                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   58

    3005            
    3006            $C$DW$161       .dwtag  DW_TAG_member
    3007                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3008                    .dwattr $C$DW$161, DW_AT_name("timerInterruptEnable_TAIE")
    3009                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    3010                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3011                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3012                    .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3013                    .dwattr $C$DW$161, DW_AT_decl_line(0x124)
    3014                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3015            
    3016            $C$DW$162       .dwtag  DW_TAG_member
    3017                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    3018                    .dwattr $C$DW$162, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3019                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3020                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3021                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3022                    .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3023                    .dwattr $C$DW$162, DW_AT_decl_line(0x129)
    3024                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3025            
    3026            $C$DW$163       .dwtag  DW_TAG_member
    3027                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3028                    .dwattr $C$DW$163, DW_AT_name("timerClear")
    3029                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("timerClear")
    3030                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3031                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3032                    .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3033                    .dwattr $C$DW$163, DW_AT_decl_line(0x12f)
    3034                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3035            
    3036            $C$DW$164       .dwtag  DW_TAG_member
    3037                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$30)
    3038                    .dwattr $C$DW$164, DW_AT_name("startTimer")
    3039                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("startTimer")
    3040                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3041                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3042                    .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3043                    .dwattr $C$DW$164, DW_AT_decl_line(0x131)
    3044                    .dwattr $C$DW$164, DW_AT_decl_column(0x0a)
    3045            
    3046                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3047                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    3048                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3049                    .dwendtag $C$DW$T$33
    3050            
    3051            $C$DW$T$67      .dwtag  DW_TAG_typedef
    3052                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    3053                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    3054                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3055                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3056                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    3057                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    3058            
    3059            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   59

    3060            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3061                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    3062                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    3063            $C$DW$165       .dwtag  DW_TAG_member
    3064                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3065                    .dwattr $C$DW$165, DW_AT_name("clockSource")
    3066                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("clockSource")
    3067                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3068                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3069                    .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3070                    .dwattr $C$DW$165, DW_AT_decl_line(0xc5)
    3071                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3072            
    3073            $C$DW$166       .dwtag  DW_TAG_member
    3074                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3075                    .dwattr $C$DW$166, DW_AT_name("clockSourceDivider")
    3076                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockSourceDivider")
    3077                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3078                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3079                    .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3080                    .dwattr $C$DW$166, DW_AT_decl_line(0xdc)
    3081                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3082            
    3083            $C$DW$167       .dwtag  DW_TAG_member
    3084                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3085                    .dwattr $C$DW$167, DW_AT_name("timerPeriod")
    3086                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("timerPeriod")
    3087                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3088                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3089                    .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3090                    .dwattr $C$DW$167, DW_AT_decl_line(0xde)
    3091                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3092            
    3093            $C$DW$168       .dwtag  DW_TAG_member
    3094                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3095                    .dwattr $C$DW$168, DW_AT_name("compareRegister")
    3096                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("compareRegister")
    3097                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3098                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3099                    .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3100                    .dwattr $C$DW$168, DW_AT_decl_line(0xe9)
    3101                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3102            
    3103            $C$DW$169       .dwtag  DW_TAG_member
    3104                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3105                    .dwattr $C$DW$169, DW_AT_name("compareOutputMode")
    3106                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("compareOutputMode")
    3107                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3108                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3109                    .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3110                    .dwattr $C$DW$169, DW_AT_decl_line(0xf4)
    3111                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3112            
    3113            $C$DW$170       .dwtag  DW_TAG_member
    3114                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   60

    3115                    .dwattr $C$DW$170, DW_AT_name("dutyCycle")
    3116                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("dutyCycle")
    3117                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3118                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3119                    .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3120                    .dwattr $C$DW$170, DW_AT_decl_line(0xf6)
    3121                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3122            
    3123                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3124                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    3125                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3126                    .dwendtag $C$DW$T$34
    3127            
    3128            $C$DW$T$68      .dwtag  DW_TAG_typedef
    3129                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    3130                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    3131                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3132                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3133                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    3134                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3135            
    3136            
    3137            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3138                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    3139                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3140            $C$DW$171       .dwtag  DW_TAG_member
    3141                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3142                    .dwattr $C$DW$171, DW_AT_name("captureRegister")
    3143                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("captureRegister")
    3144                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3145                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3146                    .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3147                    .dwattr $C$DW$171, DW_AT_decl_line(0xa0)
    3148                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3149            
    3150            $C$DW$172       .dwtag  DW_TAG_member
    3151                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3152                    .dwattr $C$DW$172, DW_AT_name("captureMode")
    3153                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("captureMode")
    3154                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3155                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3156                    .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3157                    .dwattr $C$DW$172, DW_AT_decl_line(0xa7)
    3158                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3159            
    3160            $C$DW$173       .dwtag  DW_TAG_member
    3161                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    3162                    .dwattr $C$DW$173, DW_AT_name("captureInputSelect")
    3163                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("captureInputSelect")
    3164                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3165                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3166                    .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3167                    .dwattr $C$DW$173, DW_AT_decl_line(0xae)
    3168                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    3169            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   61

    3170            $C$DW$174       .dwtag  DW_TAG_member
    3171                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3172                    .dwattr $C$DW$174, DW_AT_name("synchronizeCaptureSource")
    3173                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    3174                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3175                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3176                    .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3177                    .dwattr $C$DW$174, DW_AT_decl_line(0xb3)
    3178                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    3179            
    3180            $C$DW$175       .dwtag  DW_TAG_member
    3181                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    3182                    .dwattr $C$DW$175, DW_AT_name("captureInterruptEnable")
    3183                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("captureInterruptEnable")
    3184                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3185                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3186                    .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3187                    .dwattr $C$DW$175, DW_AT_decl_line(0xb8)
    3188                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    3189            
    3190            $C$DW$176       .dwtag  DW_TAG_member
    3191                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    3192                    .dwattr $C$DW$176, DW_AT_name("captureOutputMode")
    3193                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("captureOutputMode")
    3194                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3195                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3196                    .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3197                    .dwattr $C$DW$176, DW_AT_decl_line(0xc3)
    3198                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    3199            
    3200                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3201                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    3202                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3203                    .dwendtag $C$DW$T$35
    3204            
    3205            $C$DW$T$69      .dwtag  DW_TAG_typedef
    3206                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    3207                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    3208                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3209                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3210                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    3211                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3212            
    3213            
    3214            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3215                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    3216                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3217            $C$DW$177       .dwtag  DW_TAG_member
    3218                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3219                    .dwattr $C$DW$177, DW_AT_name("compareRegister")
    3220                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("compareRegister")
    3221                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3222                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3223                    .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3224                    .dwattr $C$DW$177, DW_AT_decl_line(0x146)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   62

    3225                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    3226            
    3227            $C$DW$178       .dwtag  DW_TAG_member
    3228                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3229                    .dwattr $C$DW$178, DW_AT_name("compareInterruptEnable")
    3230                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("compareInterruptEnable")
    3231                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3232                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3233                    .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3234                    .dwattr $C$DW$178, DW_AT_decl_line(0x14b)
    3235                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    3236            
    3237            $C$DW$179       .dwtag  DW_TAG_member
    3238                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    3239                    .dwattr $C$DW$179, DW_AT_name("compareOutputMode")
    3240                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("compareOutputMode")
    3241                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3242                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3243                    .dwattr $C$DW$179, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3244                    .dwattr $C$DW$179, DW_AT_decl_line(0x156)
    3245                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    3246            
    3247            $C$DW$180       .dwtag  DW_TAG_member
    3248                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3249                    .dwattr $C$DW$180, DW_AT_name("compareValue")
    3250                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("compareValue")
    3251                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3252                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3253                    .dwattr $C$DW$180, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3254                    .dwattr $C$DW$180, DW_AT_decl_line(0x158)
    3255                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3256            
    3257                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3258                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    3259                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3260                    .dwendtag $C$DW$T$36
    3261            
    3262            $C$DW$T$70      .dwtag  DW_TAG_typedef
    3263                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    3264                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    3265                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3266                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3267                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    3268                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3269            
    3270            
    3271            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3272                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    3273                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    3274            $C$DW$181       .dwtag  DW_TAG_member
    3275                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$27)
    3276                    .dwattr $C$DW$181, DW_AT_name("clockSource")
    3277                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("clockSource")
    3278                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3279                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   63

    3280                    .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3281                    .dwattr $C$DW$181, DW_AT_decl_line(0xd3)
    3282                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3283            
    3284            $C$DW$182       .dwtag  DW_TAG_member
    3285                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    3286                    .dwattr $C$DW$182, DW_AT_name("clockSourceDivider")
    3287                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("clockSourceDivider")
    3288                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3289                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3290                    .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3291                    .dwattr $C$DW$182, DW_AT_decl_line(0xea)
    3292                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3293            
    3294            $C$DW$183       .dwtag  DW_TAG_member
    3295                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3296                    .dwattr $C$DW$183, DW_AT_name("timerInterruptEnable_TBIE")
    3297                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3298                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3299                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3300                    .dwattr $C$DW$183, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3301                    .dwattr $C$DW$183, DW_AT_decl_line(0xef)
    3302                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3303            
    3304            $C$DW$184       .dwtag  DW_TAG_member
    3305                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    3306                    .dwattr $C$DW$184, DW_AT_name("timerClear")
    3307                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("timerClear")
    3308                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3309                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3310                    .dwattr $C$DW$184, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3311                    .dwattr $C$DW$184, DW_AT_decl_line(0xf5)
    3312                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3313            
    3314            $C$DW$185       .dwtag  DW_TAG_member
    3315                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    3316                    .dwattr $C$DW$185, DW_AT_name("startTimer")
    3317                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("startTimer")
    3318                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3319                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3320                    .dwattr $C$DW$185, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3321                    .dwattr $C$DW$185, DW_AT_decl_line(0xf7)
    3322                    .dwattr $C$DW$185, DW_AT_decl_column(0x0a)
    3323            
    3324                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3325                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    3326                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3327                    .dwendtag $C$DW$T$37
    3328            
    3329            $C$DW$T$71      .dwtag  DW_TAG_typedef
    3330                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    3331                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    3332                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3333                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3334                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   64

    3335                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    3336            
    3337            
    3338            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3339                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    3340                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    3341            $C$DW$186       .dwtag  DW_TAG_member
    3342                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3343                    .dwattr $C$DW$186, DW_AT_name("clockSource")
    3344                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("clockSource")
    3345                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3346                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3347                    .dwattr $C$DW$186, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3348                    .dwattr $C$DW$186, DW_AT_decl_line(0x107)
    3349                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3350            
    3351            $C$DW$187       .dwtag  DW_TAG_member
    3352                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$27)
    3353                    .dwattr $C$DW$187, DW_AT_name("clockSourceDivider")
    3354                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("clockSourceDivider")
    3355                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3356                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3357                    .dwattr $C$DW$187, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3358                    .dwattr $C$DW$187, DW_AT_decl_line(0x11e)
    3359                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3360            
    3361            $C$DW$188       .dwtag  DW_TAG_member
    3362                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3363                    .dwattr $C$DW$188, DW_AT_name("timerPeriod")
    3364                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("timerPeriod")
    3365                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3366                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3367                    .dwattr $C$DW$188, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3368                    .dwattr $C$DW$188, DW_AT_decl_line(0x120)
    3369                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    3370            
    3371            $C$DW$189       .dwtag  DW_TAG_member
    3372                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3373                    .dwattr $C$DW$189, DW_AT_name("timerInterruptEnable_TBIE")
    3374                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3375                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3376                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3377                    .dwattr $C$DW$189, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3378                    .dwattr $C$DW$189, DW_AT_decl_line(0x125)
    3379                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    3380            
    3381            $C$DW$190       .dwtag  DW_TAG_member
    3382                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    3383                    .dwattr $C$DW$190, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3384                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3385                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3386                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3387                    .dwattr $C$DW$190, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3388                    .dwattr $C$DW$190, DW_AT_decl_line(0x12a)
    3389                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   65

    3390            
    3391            $C$DW$191       .dwtag  DW_TAG_member
    3392                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3393                    .dwattr $C$DW$191, DW_AT_name("timerClear")
    3394                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("timerClear")
    3395                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3396                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3397                    .dwattr $C$DW$191, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3398                    .dwattr $C$DW$191, DW_AT_decl_line(0x130)
    3399                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    3400            
    3401            $C$DW$192       .dwtag  DW_TAG_member
    3402                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$30)
    3403                    .dwattr $C$DW$192, DW_AT_name("startTimer")
    3404                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("startTimer")
    3405                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3406                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3407                    .dwattr $C$DW$192, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3408                    .dwattr $C$DW$192, DW_AT_decl_line(0x132)
    3409                    .dwattr $C$DW$192, DW_AT_decl_column(0x0a)
    3410            
    3411                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3412                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    3413                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3414                    .dwendtag $C$DW$T$38
    3415            
    3416            $C$DW$T$72      .dwtag  DW_TAG_typedef
    3417                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    3418                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    3419                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3420                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3421                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    3422                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3423            
    3424            
    3425            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3426                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    3427                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    3428            $C$DW$193       .dwtag  DW_TAG_member
    3429                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3430                    .dwattr $C$DW$193, DW_AT_name("clockSource")
    3431                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("clockSource")
    3432                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3433                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3434                    .dwattr $C$DW$193, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3435                    .dwattr $C$DW$193, DW_AT_decl_line(0x60)
    3436                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    3437            
    3438            $C$DW$194       .dwtag  DW_TAG_member
    3439                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3440                    .dwattr $C$DW$194, DW_AT_name("clockSourceDivider")
    3441                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("clockSourceDivider")
    3442                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3443                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3444                    .dwattr $C$DW$194, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   66

    3445                    .dwattr $C$DW$194, DW_AT_decl_line(0x77)
    3446                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    3447            
    3448            $C$DW$195       .dwtag  DW_TAG_member
    3449                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3450                    .dwattr $C$DW$195, DW_AT_name("timerPeriod")
    3451                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerPeriod")
    3452                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3453                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3454                    .dwattr $C$DW$195, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3455                    .dwattr $C$DW$195, DW_AT_decl_line(0x7a)
    3456                    .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    3457            
    3458            $C$DW$196       .dwtag  DW_TAG_member
    3459                    .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    3460                    .dwattr $C$DW$196, DW_AT_name("timerInterruptEnable_TBIE")
    3461                    .dwattr $C$DW$196, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    3462                    .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3463                    .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3464                    .dwattr $C$DW$196, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3465                    .dwattr $C$DW$196, DW_AT_decl_line(0x7f)
    3466                    .dwattr $C$DW$196, DW_AT_decl_column(0x0e)
    3467            
    3468            $C$DW$197       .dwtag  DW_TAG_member
    3469                    .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3470                    .dwattr $C$DW$197, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    3471                    .dwattr $C$DW$197, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    3472                    .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3473                    .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3474                    .dwattr $C$DW$197, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3475                    .dwattr $C$DW$197, DW_AT_decl_line(0x84)
    3476                    .dwattr $C$DW$197, DW_AT_decl_column(0x0e)
    3477            
    3478            $C$DW$198       .dwtag  DW_TAG_member
    3479                    .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    3480                    .dwattr $C$DW$198, DW_AT_name("timerClear")
    3481                    .dwattr $C$DW$198, DW_AT_TI_symbol_name("timerClear")
    3482                    .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3483                    .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3484                    .dwattr $C$DW$198, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3485                    .dwattr $C$DW$198, DW_AT_decl_line(0x8a)
    3486                    .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    3487            
    3488            $C$DW$199       .dwtag  DW_TAG_member
    3489                    .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$30)
    3490                    .dwattr $C$DW$199, DW_AT_name("startTimer")
    3491                    .dwattr $C$DW$199, DW_AT_TI_symbol_name("startTimer")
    3492                    .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3493                    .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3494                    .dwattr $C$DW$199, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3495                    .dwattr $C$DW$199, DW_AT_decl_line(0x8c)
    3496                    .dwattr $C$DW$199, DW_AT_decl_column(0x0a)
    3497            
    3498                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3499                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   67

    3500                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    3501                    .dwendtag $C$DW$T$39
    3502            
    3503            $C$DW$T$73      .dwtag  DW_TAG_typedef
    3504                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    3505                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    3506                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3507                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3508                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    3509                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3510            
    3511            
    3512            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3513                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    3514                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    3515            $C$DW$200       .dwtag  DW_TAG_member
    3516                    .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3517                    .dwattr $C$DW$200, DW_AT_name("clockSource")
    3518                    .dwattr $C$DW$200, DW_AT_TI_symbol_name("clockSource")
    3519                    .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3520                    .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3521                    .dwattr $C$DW$200, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3522                    .dwattr $C$DW$200, DW_AT_decl_line(0x20)
    3523                    .dwattr $C$DW$200, DW_AT_decl_column(0x0e)
    3524            
    3525            $C$DW$201       .dwtag  DW_TAG_member
    3526                    .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$27)
    3527                    .dwattr $C$DW$201, DW_AT_name("clockSourceDivider")
    3528                    .dwattr $C$DW$201, DW_AT_TI_symbol_name("clockSourceDivider")
    3529                    .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3530                    .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3531                    .dwattr $C$DW$201, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3532                    .dwattr $C$DW$201, DW_AT_decl_line(0x37)
    3533                    .dwattr $C$DW$201, DW_AT_decl_column(0x0e)
    3534            
    3535            $C$DW$202       .dwtag  DW_TAG_member
    3536                    .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    3537                    .dwattr $C$DW$202, DW_AT_name("timerPeriod")
    3538                    .dwattr $C$DW$202, DW_AT_TI_symbol_name("timerPeriod")
    3539                    .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3540                    .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3541                    .dwattr $C$DW$202, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3542                    .dwattr $C$DW$202, DW_AT_decl_line(0x39)
    3543                    .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    3544            
    3545            $C$DW$203       .dwtag  DW_TAG_member
    3546                    .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    3547                    .dwattr $C$DW$203, DW_AT_name("compareRegister")
    3548                    .dwattr $C$DW$203, DW_AT_TI_symbol_name("compareRegister")
    3549                    .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3550                    .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3551                    .dwattr $C$DW$203, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3552                    .dwattr $C$DW$203, DW_AT_decl_line(0x44)
    3553                    .dwattr $C$DW$203, DW_AT_decl_column(0x0e)
    3554            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   68

    3555            $C$DW$204       .dwtag  DW_TAG_member
    3556                    .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3557                    .dwattr $C$DW$204, DW_AT_name("compareOutputMode")
    3558                    .dwattr $C$DW$204, DW_AT_TI_symbol_name("compareOutputMode")
    3559                    .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3560                    .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3561                    .dwattr $C$DW$204, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3562                    .dwattr $C$DW$204, DW_AT_decl_line(0x4f)
    3563                    .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    3564            
    3565            $C$DW$205       .dwtag  DW_TAG_member
    3566                    .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$27)
    3567                    .dwattr $C$DW$205, DW_AT_name("dutyCycle")
    3568                    .dwattr $C$DW$205, DW_AT_TI_symbol_name("dutyCycle")
    3569                    .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3570                    .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3571                    .dwattr $C$DW$205, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    3572                    .dwattr $C$DW$205, DW_AT_decl_line(0x51)
    3573                    .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    3574            
    3575                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3576                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    3577                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3578                    .dwendtag $C$DW$T$40
    3579            
    3580            $C$DW$T$74      .dwtag  DW_TAG_typedef
    3581                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    3582                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    3583                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3584                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    3585                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    3586                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3587            
    3588            
    3589            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3590                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    3591                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3592            $C$DW$206       .dwtag  DW_TAG_member
    3593                    .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
    3594                    .dwattr $C$DW$206, DW_AT_name("selectClockSource")
    3595                    .dwattr $C$DW$206, DW_AT_TI_symbol_name("selectClockSource")
    3596                    .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3597                    .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3598                    .dwattr $C$DW$206, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3599                    .dwattr $C$DW$206, DW_AT_decl_line(0x1c)
    3600                    .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    3601            
    3602            $C$DW$207       .dwtag  DW_TAG_member
    3603                    .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$27)
    3604                    .dwattr $C$DW$207, DW_AT_name("clockPrescalar")
    3605                    .dwattr $C$DW$207, DW_AT_TI_symbol_name("clockPrescalar")
    3606                    .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3607                    .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3608                    .dwattr $C$DW$207, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3609                    .dwattr $C$DW$207, DW_AT_decl_line(0x1e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   69

    3610                    .dwattr $C$DW$207, DW_AT_decl_column(0x0e)
    3611            
    3612            $C$DW$208       .dwtag  DW_TAG_member
    3613                    .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    3614                    .dwattr $C$DW$208, DW_AT_name("firstModReg")
    3615                    .dwattr $C$DW$208, DW_AT_TI_symbol_name("firstModReg")
    3616                    .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3617                    .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3618                    .dwattr $C$DW$208, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3619                    .dwattr $C$DW$208, DW_AT_decl_line(0x22)
    3620                    .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    3621            
    3622            $C$DW$209       .dwtag  DW_TAG_member
    3623                    .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$24)
    3624                    .dwattr $C$DW$209, DW_AT_name("secondModReg")
    3625                    .dwattr $C$DW$209, DW_AT_TI_symbol_name("secondModReg")
    3626                    .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3627                    .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3628                    .dwattr $C$DW$209, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3629                    .dwattr $C$DW$209, DW_AT_decl_line(0x26)
    3630                    .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    3631            
    3632            $C$DW$210       .dwtag  DW_TAG_member
    3633                    .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$24)
    3634                    .dwattr $C$DW$210, DW_AT_name("parity")
    3635                    .dwattr $C$DW$210, DW_AT_TI_symbol_name("parity")
    3636                    .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3637                    .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3638                    .dwattr $C$DW$210, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3639                    .dwattr $C$DW$210, DW_AT_decl_line(0x2c)
    3640                    .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    3641            
    3642            $C$DW$211       .dwtag  DW_TAG_member
    3643                    .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$24)
    3644                    .dwattr $C$DW$211, DW_AT_name("msborLsbFirst")
    3645                    .dwattr $C$DW$211, DW_AT_TI_symbol_name("msborLsbFirst")
    3646                    .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3647                    .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3648                    .dwattr $C$DW$211, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3649                    .dwattr $C$DW$211, DW_AT_decl_line(0x31)
    3650                    .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    3651            
    3652            $C$DW$212       .dwtag  DW_TAG_member
    3653                    .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$24)
    3654                    .dwattr $C$DW$212, DW_AT_name("numberofStopBits")
    3655                    .dwattr $C$DW$212, DW_AT_TI_symbol_name("numberofStopBits")
    3656                    .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3657                    .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3658                    .dwattr $C$DW$212, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3659                    .dwattr $C$DW$212, DW_AT_decl_line(0x36)
    3660                    .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    3661            
    3662            $C$DW$213       .dwtag  DW_TAG_member
    3663                    .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$24)
    3664                    .dwattr $C$DW$213, DW_AT_name("uartMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   70

    3665                    .dwattr $C$DW$213, DW_AT_TI_symbol_name("uartMode")
    3666                    .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3667                    .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3668                    .dwattr $C$DW$213, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3669                    .dwattr $C$DW$213, DW_AT_decl_line(0x3d)
    3670                    .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    3671            
    3672            $C$DW$214       .dwtag  DW_TAG_member
    3673                    .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$24)
    3674                    .dwattr $C$DW$214, DW_AT_name("overSampling")
    3675                    .dwattr $C$DW$214, DW_AT_TI_symbol_name("overSampling")
    3676                    .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3677                    .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3678                    .dwattr $C$DW$214, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3679                    .dwattr $C$DW$214, DW_AT_decl_line(0x42)
    3680                    .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    3681            
    3682                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3683                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    3684                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3685                    .dwendtag $C$DW$T$41
    3686            
    3687            $C$DW$T$75      .dwtag  DW_TAG_typedef
    3688                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    3689                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    3690                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3691                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3692                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    3693                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3694            
    3695            
    3696            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3697                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3698                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    3699            $C$DW$215       .dwtag  DW_TAG_member
    3700                    .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$43)
    3701                    .dwattr $C$DW$215, DW_AT_name("clockSourceFrequency")
    3702                    .dwattr $C$DW$215, DW_AT_TI_symbol_name("clockSourceFrequency")
    3703                    .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3704                    .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3705                    .dwattr $C$DW$215, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3706                    .dwattr $C$DW$215, DW_AT_decl_line(0x31)
    3707                    .dwattr $C$DW$215, DW_AT_decl_column(0x0e)
    3708            
    3709            $C$DW$216       .dwtag  DW_TAG_member
    3710                    .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$43)
    3711                    .dwattr $C$DW$216, DW_AT_name("desiredSpiClock")
    3712                    .dwattr $C$DW$216, DW_AT_TI_symbol_name("desiredSpiClock")
    3713                    .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3714                    .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3715                    .dwattr $C$DW$216, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3716                    .dwattr $C$DW$216, DW_AT_decl_line(0x33)
    3717                    .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    3718            
    3719                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   71

    3720                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    3721                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3722                    .dwendtag $C$DW$T$44
    3723            
    3724            $C$DW$T$76      .dwtag  DW_TAG_typedef
    3725                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    3726                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    3727                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3728                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    3729                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    3730                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3731            
    3732            
    3733            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3734                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    3735                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    3736            $C$DW$217       .dwtag  DW_TAG_member
    3737                    .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$24)
    3738                    .dwattr $C$DW$217, DW_AT_name("selectClockSource")
    3739                    .dwattr $C$DW$217, DW_AT_TI_symbol_name("selectClockSource")
    3740                    .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3741                    .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3742                    .dwattr $C$DW$217, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3743                    .dwattr $C$DW$217, DW_AT_decl_line(0x14)
    3744                    .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    3745            
    3746            $C$DW$218       .dwtag  DW_TAG_member
    3747                    .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$43)
    3748                    .dwattr $C$DW$218, DW_AT_name("clockSourceFrequency")
    3749                    .dwattr $C$DW$218, DW_AT_TI_symbol_name("clockSourceFrequency")
    3750                    .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3751                    .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3752                    .dwattr $C$DW$218, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3753                    .dwattr $C$DW$218, DW_AT_decl_line(0x16)
    3754                    .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    3755            
    3756            $C$DW$219       .dwtag  DW_TAG_member
    3757                    .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$43)
    3758                    .dwattr $C$DW$219, DW_AT_name("desiredSpiClock")
    3759                    .dwattr $C$DW$219, DW_AT_TI_symbol_name("desiredSpiClock")
    3760                    .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3761                    .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3762                    .dwattr $C$DW$219, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3763                    .dwattr $C$DW$219, DW_AT_decl_line(0x18)
    3764                    .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3765            
    3766            $C$DW$220       .dwtag  DW_TAG_member
    3767                    .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    3768                    .dwattr $C$DW$220, DW_AT_name("msbFirst")
    3769                    .dwattr $C$DW$220, DW_AT_TI_symbol_name("msbFirst")
    3770                    .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3771                    .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3772                    .dwattr $C$DW$220, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    3773                    .dwattr $C$DW$220, DW_AT_decl_line(0x1d)
    3774                    .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:06 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
shutdown.asm                                                         PAGE   72

    3775            
