MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 14:07:36 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/start.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PAOUT_H")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PAOUT_H")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$94)

MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  262

   11882                    .dwattr $C$DW$745, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   11883                    .dwattr $C$DW$745, DW_AT_decl_line(0x76)
   11884                    .dwattr $C$DW$745, DW_AT_decl_column(0x05)
   11885            
   11886            $C$DW$746       .dwtag  DW_TAG_enumerator
   11887                    .dwattr $C$DW$746, DW_AT_name("ack")
   11888                    .dwattr $C$DW$746, DW_AT_const_value(0x07)
   11889                    .dwattr $C$DW$746, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   11890                    .dwattr $C$DW$746, DW_AT_decl_line(0x77)
   11891                    .dwattr $C$DW$746, DW_AT_decl_column(0x05)
   11892            
   11893            $C$DW$747       .dwtag  DW_TAG_enumerator
   11894                    .dwattr $C$DW$747, DW_AT_name("var")
   11895                    .dwattr $C$DW$747, DW_AT_const_value(0x08)
   11896                    .dwattr $C$DW$747, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   11897                    .dwattr $C$DW$747, DW_AT_decl_line(0x78)
   11898                    .dwattr $C$DW$747, DW_AT_decl_column(0x05)
   11899            
   11900            $C$DW$748       .dwtag  DW_TAG_enumerator
   11901                    .dwattr $C$DW$748, DW_AT_name("UGmsg")
   11902                    .dwattr $C$DW$748, DW_AT_const_value(0x09)
   11903                    .dwattr $C$DW$748, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   11904                    .dwattr $C$DW$748, DW_AT_decl_line(0x79)
   11905                    .dwattr $C$DW$748, DW_AT_decl_column(0x05)
   11906            
   11907                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   11908                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
   11909                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
   11910                    .dwendtag $C$DW$T$57
   11911            
   11912            $C$DW$T$58      .dwtag  DW_TAG_typedef
   11913                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
   11914                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
   11915                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
   11916                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   11917                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
   11918                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
   11919            
   11920            
   11921            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
   11922                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
   11923            $C$DW$749       .dwtag  DW_TAG_enumerator
   11924                    .dwattr $C$DW$749, DW_AT_name("init")
   11925                    .dwattr $C$DW$749, DW_AT_const_value(0x00)
   11926                    .dwattr $C$DW$749, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   11927                    .dwattr $C$DW$749, DW_AT_decl_line(0x80)
   11928                    .dwattr $C$DW$749, DW_AT_decl_column(0x05)
   11929            
   11930            $C$DW$750       .dwtag  DW_TAG_enumerator
   11931                    .dwattr $C$DW$750, DW_AT_name("running")
   11932                    .dwattr $C$DW$750, DW_AT_const_value(0x01)
   11933                    .dwattr $C$DW$750, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   11934                    .dwattr $C$DW$750, DW_AT_decl_line(0x80)
   11935                    .dwattr $C$DW$750, DW_AT_decl_column(0x0b)
   11936            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  263

   11937            $C$DW$751       .dwtag  DW_TAG_enumerator
   11938                    .dwattr $C$DW$751, DW_AT_name("wait")
   11939                    .dwattr $C$DW$751, DW_AT_const_value(0x02)
   11940                    .dwattr $C$DW$751, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   11941                    .dwattr $C$DW$751, DW_AT_decl_line(0x80)
   11942                    .dwattr $C$DW$751, DW_AT_decl_column(0x14)
   11943            
   11944                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   11945                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
   11946                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
   11947                    .dwendtag $C$DW$T$59
   11948            
   11949            $C$DW$T$60      .dwtag  DW_TAG_typedef
   11950                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
   11951                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
   11952                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
   11953                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   11954                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
   11955                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
   11956            
   11957            
   11958            $C$DW$T$22      .dwtag  DW_TAG_structure_type
   11959                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
   11960            $C$DW$752       .dwtag  DW_TAG_member
   11961                    .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$14)
   11962                    .dwattr $C$DW$752, DW_AT_name("__max_align1")
   11963                    .dwattr $C$DW$752, DW_AT_TI_symbol_name("__max_align1")
   11964                    .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11965                    .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
   11966                    .dwattr $C$DW$752, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11967                    .dwattr $C$DW$752, DW_AT_decl_line(0x7b)
   11968                    .dwattr $C$DW$752, DW_AT_decl_column(0x0c)
   11969            
   11970            $C$DW$753       .dwtag  DW_TAG_member
   11971                    .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$18)
   11972                    .dwattr $C$DW$753, DW_AT_name("__max_align2")
   11973                    .dwattr $C$DW$753, DW_AT_TI_symbol_name("__max_align2")
   11974                    .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11975                    .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
   11976                    .dwattr $C$DW$753, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   11977                    .dwattr $C$DW$753, DW_AT_decl_line(0x7c)
   11978                    .dwattr $C$DW$753, DW_AT_decl_column(0x0e)
   11979            
   11980                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11981                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
   11982                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
   11983                    .dwendtag $C$DW$T$22
   11984            
   11985            $C$DW$T$61      .dwtag  DW_TAG_typedef
   11986                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
   11987                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
   11988                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   11989                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   11990                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
   11991                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  264

   11992            
   11993            
   11994            $C$DW$T$25      .dwtag  DW_TAG_structure_type
   11995                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
   11996                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
   11997            $C$DW$754       .dwtag  DW_TAG_member
   11998                    .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$24)
   11999                    .dwattr $C$DW$754, DW_AT_name("memoryBufferControlIndex")
   12000                    .dwattr $C$DW$754, DW_AT_TI_symbol_name("memoryBufferControlIndex")
   12001                    .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12002                    .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
   12003                    .dwattr $C$DW$754, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   12004                    .dwattr $C$DW$754, DW_AT_decl_line(0x27)
   12005                    .dwattr $C$DW$754, DW_AT_decl_column(0x0d)
   12006            
   12007            $C$DW$755       .dwtag  DW_TAG_member
   12008                    .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$24)
   12009                    .dwattr $C$DW$755, DW_AT_name("inputSourceSelect")
   12010                    .dwattr $C$DW$755, DW_AT_TI_symbol_name("inputSourceSelect")
   12011                    .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12012                    .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
   12013                    .dwattr $C$DW$755, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   12014                    .dwattr $C$DW$755, DW_AT_decl_line(0x3b)
   12015                    .dwattr $C$DW$755, DW_AT_decl_column(0x0d)
   12016            
   12017            $C$DW$756       .dwtag  DW_TAG_member
   12018                    .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$24)
   12019                    .dwattr $C$DW$756, DW_AT_name("positiveRefVoltageSourceSelect")
   12020                    .dwattr $C$DW$756, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
   12021                    .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12022                    .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
   12023                    .dwattr $C$DW$756, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   12024                    .dwattr $C$DW$756, DW_AT_decl_line(0x42)
   12025                    .dwattr $C$DW$756, DW_AT_decl_column(0x0d)
   12026            
   12027            $C$DW$757       .dwtag  DW_TAG_member
   12028                    .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$24)
   12029                    .dwattr $C$DW$757, DW_AT_name("negativeRefVoltageSourceSelect")
   12030                    .dwattr $C$DW$757, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
   12031                    .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12032                    .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
   12033                    .dwattr $C$DW$757, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   12034                    .dwattr $C$DW$757, DW_AT_decl_line(0x48)
   12035                    .dwattr $C$DW$757, DW_AT_decl_column(0x0d)
   12036            
   12037            $C$DW$758       .dwtag  DW_TAG_member
   12038                    .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$24)
   12039                    .dwattr $C$DW$758, DW_AT_name("endOfSequence")
   12040                    .dwattr $C$DW$758, DW_AT_TI_symbol_name("endOfSequence")
   12041                    .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12042                    .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
   12043                    .dwattr $C$DW$758, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   12044                    .dwattr $C$DW$758, DW_AT_decl_line(0x51)
   12045                    .dwattr $C$DW$758, DW_AT_decl_column(0x0d)
   12046            
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  265

   12047                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
   12048                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
   12049                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
   12050                    .dwendtag $C$DW$T$25
   12051            
   12052            $C$DW$T$62      .dwtag  DW_TAG_typedef
   12053                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
   12054                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
   12055                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   12056                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
   12057                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
   12058                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
   12059            
   12060            
   12061            $C$DW$T$28      .dwtag  DW_TAG_structure_type
   12062                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
   12063                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
   12064            $C$DW$759       .dwtag  DW_TAG_member
   12065                    .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$27)
   12066                    .dwattr $C$DW$759, DW_AT_name("captureRegister")
   12067                    .dwattr $C$DW$759, DW_AT_TI_symbol_name("captureRegister")
   12068                    .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12069                    .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
   12070                    .dwattr $C$DW$759, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12071                    .dwattr $C$DW$759, DW_AT_decl_line(0x58)
   12072                    .dwattr $C$DW$759, DW_AT_decl_column(0x0e)
   12073            
   12074            $C$DW$760       .dwtag  DW_TAG_member
   12075                    .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$27)
   12076                    .dwattr $C$DW$760, DW_AT_name("captureMode")
   12077                    .dwattr $C$DW$760, DW_AT_TI_symbol_name("captureMode")
   12078                    .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12079                    .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
   12080                    .dwattr $C$DW$760, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12081                    .dwattr $C$DW$760, DW_AT_decl_line(0x5f)
   12082                    .dwattr $C$DW$760, DW_AT_decl_column(0x0e)
   12083            
   12084            $C$DW$761       .dwtag  DW_TAG_member
   12085                    .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$27)
   12086                    .dwattr $C$DW$761, DW_AT_name("captureInputSelect")
   12087                    .dwattr $C$DW$761, DW_AT_TI_symbol_name("captureInputSelect")
   12088                    .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12089                    .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
   12090                    .dwattr $C$DW$761, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12091                    .dwattr $C$DW$761, DW_AT_decl_line(0x66)
   12092                    .dwattr $C$DW$761, DW_AT_decl_column(0x0e)
   12093            
   12094            $C$DW$762       .dwtag  DW_TAG_member
   12095                    .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$27)
   12096                    .dwattr $C$DW$762, DW_AT_name("synchronizeCaptureSource")
   12097                    .dwattr $C$DW$762, DW_AT_TI_symbol_name("synchronizeCaptureSource")
   12098                    .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12099                    .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
   12100                    .dwattr $C$DW$762, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12101                    .dwattr $C$DW$762, DW_AT_decl_line(0x6b)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  266

   12102                    .dwattr $C$DW$762, DW_AT_decl_column(0x0e)
   12103            
   12104            $C$DW$763       .dwtag  DW_TAG_member
   12105                    .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$27)
   12106                    .dwattr $C$DW$763, DW_AT_name("captureInterruptEnable")
   12107                    .dwattr $C$DW$763, DW_AT_TI_symbol_name("captureInterruptEnable")
   12108                    .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12109                    .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
   12110                    .dwattr $C$DW$763, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12111                    .dwattr $C$DW$763, DW_AT_decl_line(0x70)
   12112                    .dwattr $C$DW$763, DW_AT_decl_column(0x0e)
   12113            
   12114            $C$DW$764       .dwtag  DW_TAG_member
   12115                    .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$27)
   12116                    .dwattr $C$DW$764, DW_AT_name("captureOutputMode")
   12117                    .dwattr $C$DW$764, DW_AT_TI_symbol_name("captureOutputMode")
   12118                    .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12119                    .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
   12120                    .dwattr $C$DW$764, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12121                    .dwattr $C$DW$764, DW_AT_decl_line(0x7b)
   12122                    .dwattr $C$DW$764, DW_AT_decl_column(0x0e)
   12123            
   12124                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12125                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
   12126                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
   12127                    .dwendtag $C$DW$T$28
   12128            
   12129            $C$DW$T$63      .dwtag  DW_TAG_typedef
   12130                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
   12131                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
   12132                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   12133                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12134                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
   12135                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
   12136            
   12137            
   12138            $C$DW$T$29      .dwtag  DW_TAG_structure_type
   12139                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
   12140                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
   12141            $C$DW$765       .dwtag  DW_TAG_member
   12142                    .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$27)
   12143                    .dwattr $C$DW$765, DW_AT_name("compareRegister")
   12144                    .dwattr $C$DW$765, DW_AT_TI_symbol_name("compareRegister")
   12145                    .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12146                    .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
   12147                    .dwattr $C$DW$765, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12148                    .dwattr $C$DW$765, DW_AT_decl_line(0x145)
   12149                    .dwattr $C$DW$765, DW_AT_decl_column(0x0e)
   12150            
   12151            $C$DW$766       .dwtag  DW_TAG_member
   12152                    .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$27)
   12153                    .dwattr $C$DW$766, DW_AT_name("compareInterruptEnable")
   12154                    .dwattr $C$DW$766, DW_AT_TI_symbol_name("compareInterruptEnable")
   12155                    .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12156                    .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  267

   12157                    .dwattr $C$DW$766, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12158                    .dwattr $C$DW$766, DW_AT_decl_line(0x14a)
   12159                    .dwattr $C$DW$766, DW_AT_decl_column(0x0e)
   12160            
   12161            $C$DW$767       .dwtag  DW_TAG_member
   12162                    .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$27)
   12163                    .dwattr $C$DW$767, DW_AT_name("compareOutputMode")
   12164                    .dwattr $C$DW$767, DW_AT_TI_symbol_name("compareOutputMode")
   12165                    .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12166                    .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
   12167                    .dwattr $C$DW$767, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12168                    .dwattr $C$DW$767, DW_AT_decl_line(0x155)
   12169                    .dwattr $C$DW$767, DW_AT_decl_column(0x0e)
   12170            
   12171            $C$DW$768       .dwtag  DW_TAG_member
   12172                    .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$27)
   12173                    .dwattr $C$DW$768, DW_AT_name("compareValue")
   12174                    .dwattr $C$DW$768, DW_AT_TI_symbol_name("compareValue")
   12175                    .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12176                    .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
   12177                    .dwattr $C$DW$768, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12178                    .dwattr $C$DW$768, DW_AT_decl_line(0x157)
   12179                    .dwattr $C$DW$768, DW_AT_decl_column(0x0e)
   12180            
   12181                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12182                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
   12183                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
   12184                    .dwendtag $C$DW$T$29
   12185            
   12186            $C$DW$T$64      .dwtag  DW_TAG_typedef
   12187                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
   12188                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
   12189                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   12190                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12191                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
   12192                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
   12193            
   12194            
   12195            $C$DW$T$31      .dwtag  DW_TAG_structure_type
   12196                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
   12197                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
   12198            $C$DW$769       .dwtag  DW_TAG_member
   12199                    .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$27)
   12200                    .dwattr $C$DW$769, DW_AT_name("clockSource")
   12201                    .dwattr $C$DW$769, DW_AT_TI_symbol_name("clockSource")
   12202                    .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12203                    .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
   12204                    .dwattr $C$DW$769, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12205                    .dwattr $C$DW$769, DW_AT_decl_line(0x20)
   12206                    .dwattr $C$DW$769, DW_AT_decl_column(0x0e)
   12207            
   12208            $C$DW$770       .dwtag  DW_TAG_member
   12209                    .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$27)
   12210                    .dwattr $C$DW$770, DW_AT_name("clockSourceDivider")
   12211                    .dwattr $C$DW$770, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  268

   12212                    .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12213                    .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
   12214                    .dwattr $C$DW$770, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12215                    .dwattr $C$DW$770, DW_AT_decl_line(0x37)
   12216                    .dwattr $C$DW$770, DW_AT_decl_column(0x0e)
   12217            
   12218            $C$DW$771       .dwtag  DW_TAG_member
   12219                    .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$27)
   12220                    .dwattr $C$DW$771, DW_AT_name("timerInterruptEnable_TAIE")
   12221                    .dwattr $C$DW$771, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
   12222                    .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12223                    .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
   12224                    .dwattr $C$DW$771, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12225                    .dwattr $C$DW$771, DW_AT_decl_line(0x3c)
   12226                    .dwattr $C$DW$771, DW_AT_decl_column(0x0e)
   12227            
   12228            $C$DW$772       .dwtag  DW_TAG_member
   12229                    .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$27)
   12230                    .dwattr $C$DW$772, DW_AT_name("timerClear")
   12231                    .dwattr $C$DW$772, DW_AT_TI_symbol_name("timerClear")
   12232                    .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12233                    .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
   12234                    .dwattr $C$DW$772, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12235                    .dwattr $C$DW$772, DW_AT_decl_line(0x42)
   12236                    .dwattr $C$DW$772, DW_AT_decl_column(0x0e)
   12237            
   12238            $C$DW$773       .dwtag  DW_TAG_member
   12239                    .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$30)
   12240                    .dwattr $C$DW$773, DW_AT_name("startTimer")
   12241                    .dwattr $C$DW$773, DW_AT_TI_symbol_name("startTimer")
   12242                    .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12243                    .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
   12244                    .dwattr $C$DW$773, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12245                    .dwattr $C$DW$773, DW_AT_decl_line(0x44)
   12246                    .dwattr $C$DW$773, DW_AT_decl_column(0x0a)
   12247            
   12248                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12249                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
   12250                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
   12251                    .dwendtag $C$DW$T$31
   12252            
   12253            $C$DW$T$65      .dwtag  DW_TAG_typedef
   12254                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
   12255                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
   12256                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   12257                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12258                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
   12259                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
   12260            
   12261            
   12262            $C$DW$T$32      .dwtag  DW_TAG_structure_type
   12263                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
   12264                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
   12265            $C$DW$774       .dwtag  DW_TAG_member
   12266                    .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  269

   12267                    .dwattr $C$DW$774, DW_AT_name("clockSource")
   12268                    .dwattr $C$DW$774, DW_AT_TI_symbol_name("clockSource")
   12269                    .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12270                    .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
   12271                    .dwattr $C$DW$774, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12272                    .dwattr $C$DW$774, DW_AT_decl_line(0x8b)
   12273                    .dwattr $C$DW$774, DW_AT_decl_column(0x0e)
   12274            
   12275            $C$DW$775       .dwtag  DW_TAG_member
   12276                    .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$27)
   12277                    .dwattr $C$DW$775, DW_AT_name("clockSourceDivider")
   12278                    .dwattr $C$DW$775, DW_AT_TI_symbol_name("clockSourceDivider")
   12279                    .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12280                    .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
   12281                    .dwattr $C$DW$775, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12282                    .dwattr $C$DW$775, DW_AT_decl_line(0xa2)
   12283                    .dwattr $C$DW$775, DW_AT_decl_column(0x0e)
   12284            
   12285            $C$DW$776       .dwtag  DW_TAG_member
   12286                    .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$27)
   12287                    .dwattr $C$DW$776, DW_AT_name("timerPeriod")
   12288                    .dwattr $C$DW$776, DW_AT_TI_symbol_name("timerPeriod")
   12289                    .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12290                    .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
   12291                    .dwattr $C$DW$776, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12292                    .dwattr $C$DW$776, DW_AT_decl_line(0xa4)
   12293                    .dwattr $C$DW$776, DW_AT_decl_column(0x0e)
   12294            
   12295            $C$DW$777       .dwtag  DW_TAG_member
   12296                    .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$27)
   12297                    .dwattr $C$DW$777, DW_AT_name("timerInterruptEnable_TAIE")
   12298                    .dwattr $C$DW$777, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
   12299                    .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12300                    .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
   12301                    .dwattr $C$DW$777, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12302                    .dwattr $C$DW$777, DW_AT_decl_line(0xa9)
   12303                    .dwattr $C$DW$777, DW_AT_decl_column(0x0e)
   12304            
   12305            $C$DW$778       .dwtag  DW_TAG_member
   12306                    .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$27)
   12307                    .dwattr $C$DW$778, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
   12308                    .dwattr $C$DW$778, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   12309                    .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12310                    .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
   12311                    .dwattr $C$DW$778, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12312                    .dwattr $C$DW$778, DW_AT_decl_line(0xae)
   12313                    .dwattr $C$DW$778, DW_AT_decl_column(0x0e)
   12314            
   12315            $C$DW$779       .dwtag  DW_TAG_member
   12316                    .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$27)
   12317                    .dwattr $C$DW$779, DW_AT_name("timerClear")
   12318                    .dwattr $C$DW$779, DW_AT_TI_symbol_name("timerClear")
   12319                    .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12320                    .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
   12321                    .dwattr $C$DW$779, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  270

   12322                    .dwattr $C$DW$779, DW_AT_decl_line(0xb4)
   12323                    .dwattr $C$DW$779, DW_AT_decl_column(0x0e)
   12324            
   12325            $C$DW$780       .dwtag  DW_TAG_member
   12326                    .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$30)
   12327                    .dwattr $C$DW$780, DW_AT_name("startTimer")
   12328                    .dwattr $C$DW$780, DW_AT_TI_symbol_name("startTimer")
   12329                    .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12330                    .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
   12331                    .dwattr $C$DW$780, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12332                    .dwattr $C$DW$780, DW_AT_decl_line(0xb6)
   12333                    .dwattr $C$DW$780, DW_AT_decl_column(0x0a)
   12334            
   12335                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12336                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
   12337                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
   12338                    .dwendtag $C$DW$T$32
   12339            
   12340            $C$DW$T$66      .dwtag  DW_TAG_typedef
   12341                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
   12342                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
   12343                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   12344                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12345                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
   12346                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
   12347            
   12348            
   12349            $C$DW$T$33      .dwtag  DW_TAG_structure_type
   12350                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
   12351                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
   12352            $C$DW$781       .dwtag  DW_TAG_member
   12353                    .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$27)
   12354                    .dwattr $C$DW$781, DW_AT_name("clockSource")
   12355                    .dwattr $C$DW$781, DW_AT_TI_symbol_name("clockSource")
   12356                    .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12357                    .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
   12358                    .dwattr $C$DW$781, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12359                    .dwattr $C$DW$781, DW_AT_decl_line(0x105)
   12360                    .dwattr $C$DW$781, DW_AT_decl_column(0x0e)
   12361            
   12362            $C$DW$782       .dwtag  DW_TAG_member
   12363                    .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$27)
   12364                    .dwattr $C$DW$782, DW_AT_name("clockSourceDivider")
   12365                    .dwattr $C$DW$782, DW_AT_TI_symbol_name("clockSourceDivider")
   12366                    .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12367                    .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
   12368                    .dwattr $C$DW$782, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12369                    .dwattr $C$DW$782, DW_AT_decl_line(0x11c)
   12370                    .dwattr $C$DW$782, DW_AT_decl_column(0x0e)
   12371            
   12372            $C$DW$783       .dwtag  DW_TAG_member
   12373                    .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$27)
   12374                    .dwattr $C$DW$783, DW_AT_name("timerPeriod")
   12375                    .dwattr $C$DW$783, DW_AT_TI_symbol_name("timerPeriod")
   12376                    .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  271

   12377                    .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
   12378                    .dwattr $C$DW$783, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12379                    .dwattr $C$DW$783, DW_AT_decl_line(0x11f)
   12380                    .dwattr $C$DW$783, DW_AT_decl_column(0x0e)
   12381            
   12382            $C$DW$784       .dwtag  DW_TAG_member
   12383                    .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$27)
   12384                    .dwattr $C$DW$784, DW_AT_name("timerInterruptEnable_TAIE")
   12385                    .dwattr $C$DW$784, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
   12386                    .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12387                    .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
   12388                    .dwattr $C$DW$784, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12389                    .dwattr $C$DW$784, DW_AT_decl_line(0x124)
   12390                    .dwattr $C$DW$784, DW_AT_decl_column(0x0e)
   12391            
   12392            $C$DW$785       .dwtag  DW_TAG_member
   12393                    .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$27)
   12394                    .dwattr $C$DW$785, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
   12395                    .dwattr $C$DW$785, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   12396                    .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12397                    .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
   12398                    .dwattr $C$DW$785, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12399                    .dwattr $C$DW$785, DW_AT_decl_line(0x129)
   12400                    .dwattr $C$DW$785, DW_AT_decl_column(0x0e)
   12401            
   12402            $C$DW$786       .dwtag  DW_TAG_member
   12403                    .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$27)
   12404                    .dwattr $C$DW$786, DW_AT_name("timerClear")
   12405                    .dwattr $C$DW$786, DW_AT_TI_symbol_name("timerClear")
   12406                    .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12407                    .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
   12408                    .dwattr $C$DW$786, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12409                    .dwattr $C$DW$786, DW_AT_decl_line(0x12f)
   12410                    .dwattr $C$DW$786, DW_AT_decl_column(0x0e)
   12411            
   12412            $C$DW$787       .dwtag  DW_TAG_member
   12413                    .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$30)
   12414                    .dwattr $C$DW$787, DW_AT_name("startTimer")
   12415                    .dwattr $C$DW$787, DW_AT_TI_symbol_name("startTimer")
   12416                    .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12417                    .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
   12418                    .dwattr $C$DW$787, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12419                    .dwattr $C$DW$787, DW_AT_decl_line(0x131)
   12420                    .dwattr $C$DW$787, DW_AT_decl_column(0x0a)
   12421            
   12422                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12423                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
   12424                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
   12425                    .dwendtag $C$DW$T$33
   12426            
   12427            $C$DW$T$67      .dwtag  DW_TAG_typedef
   12428                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
   12429                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
   12430                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   12431                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  272

   12432                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
   12433                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
   12434            
   12435            
   12436            $C$DW$T$34      .dwtag  DW_TAG_structure_type
   12437                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
   12438                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
   12439            $C$DW$788       .dwtag  DW_TAG_member
   12440                    .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$27)
   12441                    .dwattr $C$DW$788, DW_AT_name("clockSource")
   12442                    .dwattr $C$DW$788, DW_AT_TI_symbol_name("clockSource")
   12443                    .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12444                    .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
   12445                    .dwattr $C$DW$788, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12446                    .dwattr $C$DW$788, DW_AT_decl_line(0xc5)
   12447                    .dwattr $C$DW$788, DW_AT_decl_column(0x0e)
   12448            
   12449            $C$DW$789       .dwtag  DW_TAG_member
   12450                    .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$27)
   12451                    .dwattr $C$DW$789, DW_AT_name("clockSourceDivider")
   12452                    .dwattr $C$DW$789, DW_AT_TI_symbol_name("clockSourceDivider")
   12453                    .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12454                    .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
   12455                    .dwattr $C$DW$789, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12456                    .dwattr $C$DW$789, DW_AT_decl_line(0xdc)
   12457                    .dwattr $C$DW$789, DW_AT_decl_column(0x0e)
   12458            
   12459            $C$DW$790       .dwtag  DW_TAG_member
   12460                    .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$27)
   12461                    .dwattr $C$DW$790, DW_AT_name("timerPeriod")
   12462                    .dwattr $C$DW$790, DW_AT_TI_symbol_name("timerPeriod")
   12463                    .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12464                    .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
   12465                    .dwattr $C$DW$790, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12466                    .dwattr $C$DW$790, DW_AT_decl_line(0xde)
   12467                    .dwattr $C$DW$790, DW_AT_decl_column(0x0e)
   12468            
   12469            $C$DW$791       .dwtag  DW_TAG_member
   12470                    .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$27)
   12471                    .dwattr $C$DW$791, DW_AT_name("compareRegister")
   12472                    .dwattr $C$DW$791, DW_AT_TI_symbol_name("compareRegister")
   12473                    .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12474                    .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
   12475                    .dwattr $C$DW$791, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12476                    .dwattr $C$DW$791, DW_AT_decl_line(0xe9)
   12477                    .dwattr $C$DW$791, DW_AT_decl_column(0x0e)
   12478            
   12479            $C$DW$792       .dwtag  DW_TAG_member
   12480                    .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$27)
   12481                    .dwattr $C$DW$792, DW_AT_name("compareOutputMode")
   12482                    .dwattr $C$DW$792, DW_AT_TI_symbol_name("compareOutputMode")
   12483                    .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12484                    .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
   12485                    .dwattr $C$DW$792, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12486                    .dwattr $C$DW$792, DW_AT_decl_line(0xf4)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  273

   12487                    .dwattr $C$DW$792, DW_AT_decl_column(0x0e)
   12488            
   12489            $C$DW$793       .dwtag  DW_TAG_member
   12490                    .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$27)
   12491                    .dwattr $C$DW$793, DW_AT_name("dutyCycle")
   12492                    .dwattr $C$DW$793, DW_AT_TI_symbol_name("dutyCycle")
   12493                    .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12494                    .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
   12495                    .dwattr $C$DW$793, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12496                    .dwattr $C$DW$793, DW_AT_decl_line(0xf6)
   12497                    .dwattr $C$DW$793, DW_AT_decl_column(0x0e)
   12498            
   12499                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12500                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
   12501                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
   12502                    .dwendtag $C$DW$T$34
   12503            
   12504            $C$DW$T$68      .dwtag  DW_TAG_typedef
   12505                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
   12506                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
   12507                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   12508                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12509                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
   12510                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
   12511            
   12512            
   12513            $C$DW$T$35      .dwtag  DW_TAG_structure_type
   12514                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
   12515                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
   12516            $C$DW$794       .dwtag  DW_TAG_member
   12517                    .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$27)
   12518                    .dwattr $C$DW$794, DW_AT_name("captureRegister")
   12519                    .dwattr $C$DW$794, DW_AT_TI_symbol_name("captureRegister")
   12520                    .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12521                    .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
   12522                    .dwattr $C$DW$794, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12523                    .dwattr $C$DW$794, DW_AT_decl_line(0xa0)
   12524                    .dwattr $C$DW$794, DW_AT_decl_column(0x0e)
   12525            
   12526            $C$DW$795       .dwtag  DW_TAG_member
   12527                    .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$27)
   12528                    .dwattr $C$DW$795, DW_AT_name("captureMode")
   12529                    .dwattr $C$DW$795, DW_AT_TI_symbol_name("captureMode")
   12530                    .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12531                    .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
   12532                    .dwattr $C$DW$795, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12533                    .dwattr $C$DW$795, DW_AT_decl_line(0xa7)
   12534                    .dwattr $C$DW$795, DW_AT_decl_column(0x0e)
   12535            
   12536            $C$DW$796       .dwtag  DW_TAG_member
   12537                    .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$27)
   12538                    .dwattr $C$DW$796, DW_AT_name("captureInputSelect")
   12539                    .dwattr $C$DW$796, DW_AT_TI_symbol_name("captureInputSelect")
   12540                    .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12541                    .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  274

   12542                    .dwattr $C$DW$796, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12543                    .dwattr $C$DW$796, DW_AT_decl_line(0xae)
   12544                    .dwattr $C$DW$796, DW_AT_decl_column(0x0e)
   12545            
   12546            $C$DW$797       .dwtag  DW_TAG_member
   12547                    .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$27)
   12548                    .dwattr $C$DW$797, DW_AT_name("synchronizeCaptureSource")
   12549                    .dwattr $C$DW$797, DW_AT_TI_symbol_name("synchronizeCaptureSource")
   12550                    .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12551                    .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
   12552                    .dwattr $C$DW$797, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12553                    .dwattr $C$DW$797, DW_AT_decl_line(0xb3)
   12554                    .dwattr $C$DW$797, DW_AT_decl_column(0x0e)
   12555            
   12556            $C$DW$798       .dwtag  DW_TAG_member
   12557                    .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$27)
   12558                    .dwattr $C$DW$798, DW_AT_name("captureInterruptEnable")
   12559                    .dwattr $C$DW$798, DW_AT_TI_symbol_name("captureInterruptEnable")
   12560                    .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12561                    .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
   12562                    .dwattr $C$DW$798, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12563                    .dwattr $C$DW$798, DW_AT_decl_line(0xb8)
   12564                    .dwattr $C$DW$798, DW_AT_decl_column(0x0e)
   12565            
   12566            $C$DW$799       .dwtag  DW_TAG_member
   12567                    .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$27)
   12568                    .dwattr $C$DW$799, DW_AT_name("captureOutputMode")
   12569                    .dwattr $C$DW$799, DW_AT_TI_symbol_name("captureOutputMode")
   12570                    .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12571                    .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
   12572                    .dwattr $C$DW$799, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12573                    .dwattr $C$DW$799, DW_AT_decl_line(0xc3)
   12574                    .dwattr $C$DW$799, DW_AT_decl_column(0x0e)
   12575            
   12576                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12577                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
   12578                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
   12579                    .dwendtag $C$DW$T$35
   12580            
   12581            $C$DW$T$69      .dwtag  DW_TAG_typedef
   12582                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
   12583                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
   12584                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   12585                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12586                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
   12587                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
   12588            
   12589            
   12590            $C$DW$T$36      .dwtag  DW_TAG_structure_type
   12591                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
   12592                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
   12593            $C$DW$800       .dwtag  DW_TAG_member
   12594                    .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$27)
   12595                    .dwattr $C$DW$800, DW_AT_name("compareRegister")
   12596                    .dwattr $C$DW$800, DW_AT_TI_symbol_name("compareRegister")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  275

   12597                    .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12598                    .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
   12599                    .dwattr $C$DW$800, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12600                    .dwattr $C$DW$800, DW_AT_decl_line(0x146)
   12601                    .dwattr $C$DW$800, DW_AT_decl_column(0x0e)
   12602            
   12603            $C$DW$801       .dwtag  DW_TAG_member
   12604                    .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$27)
   12605                    .dwattr $C$DW$801, DW_AT_name("compareInterruptEnable")
   12606                    .dwattr $C$DW$801, DW_AT_TI_symbol_name("compareInterruptEnable")
   12607                    .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12608                    .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
   12609                    .dwattr $C$DW$801, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12610                    .dwattr $C$DW$801, DW_AT_decl_line(0x14b)
   12611                    .dwattr $C$DW$801, DW_AT_decl_column(0x0e)
   12612            
   12613            $C$DW$802       .dwtag  DW_TAG_member
   12614                    .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$27)
   12615                    .dwattr $C$DW$802, DW_AT_name("compareOutputMode")
   12616                    .dwattr $C$DW$802, DW_AT_TI_symbol_name("compareOutputMode")
   12617                    .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12618                    .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
   12619                    .dwattr $C$DW$802, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12620                    .dwattr $C$DW$802, DW_AT_decl_line(0x156)
   12621                    .dwattr $C$DW$802, DW_AT_decl_column(0x0e)
   12622            
   12623            $C$DW$803       .dwtag  DW_TAG_member
   12624                    .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$27)
   12625                    .dwattr $C$DW$803, DW_AT_name("compareValue")
   12626                    .dwattr $C$DW$803, DW_AT_TI_symbol_name("compareValue")
   12627                    .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12628                    .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
   12629                    .dwattr $C$DW$803, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12630                    .dwattr $C$DW$803, DW_AT_decl_line(0x158)
   12631                    .dwattr $C$DW$803, DW_AT_decl_column(0x0e)
   12632            
   12633                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12634                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
   12635                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
   12636                    .dwendtag $C$DW$T$36
   12637            
   12638            $C$DW$T$70      .dwtag  DW_TAG_typedef
   12639                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
   12640                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
   12641                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   12642                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12643                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
   12644                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
   12645            
   12646            
   12647            $C$DW$T$37      .dwtag  DW_TAG_structure_type
   12648                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
   12649                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
   12650            $C$DW$804       .dwtag  DW_TAG_member
   12651                    .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  276

   12652                    .dwattr $C$DW$804, DW_AT_name("clockSource")
   12653                    .dwattr $C$DW$804, DW_AT_TI_symbol_name("clockSource")
   12654                    .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12655                    .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
   12656                    .dwattr $C$DW$804, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12657                    .dwattr $C$DW$804, DW_AT_decl_line(0xd3)
   12658                    .dwattr $C$DW$804, DW_AT_decl_column(0x0e)
   12659            
   12660            $C$DW$805       .dwtag  DW_TAG_member
   12661                    .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$27)
   12662                    .dwattr $C$DW$805, DW_AT_name("clockSourceDivider")
   12663                    .dwattr $C$DW$805, DW_AT_TI_symbol_name("clockSourceDivider")
   12664                    .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12665                    .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
   12666                    .dwattr $C$DW$805, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12667                    .dwattr $C$DW$805, DW_AT_decl_line(0xea)
   12668                    .dwattr $C$DW$805, DW_AT_decl_column(0x0e)
   12669            
   12670            $C$DW$806       .dwtag  DW_TAG_member
   12671                    .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$27)
   12672                    .dwattr $C$DW$806, DW_AT_name("timerInterruptEnable_TBIE")
   12673                    .dwattr $C$DW$806, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
   12674                    .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12675                    .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
   12676                    .dwattr $C$DW$806, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12677                    .dwattr $C$DW$806, DW_AT_decl_line(0xef)
   12678                    .dwattr $C$DW$806, DW_AT_decl_column(0x0e)
   12679            
   12680            $C$DW$807       .dwtag  DW_TAG_member
   12681                    .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$27)
   12682                    .dwattr $C$DW$807, DW_AT_name("timerClear")
   12683                    .dwattr $C$DW$807, DW_AT_TI_symbol_name("timerClear")
   12684                    .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12685                    .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
   12686                    .dwattr $C$DW$807, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12687                    .dwattr $C$DW$807, DW_AT_decl_line(0xf5)
   12688                    .dwattr $C$DW$807, DW_AT_decl_column(0x0e)
   12689            
   12690            $C$DW$808       .dwtag  DW_TAG_member
   12691                    .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$30)
   12692                    .dwattr $C$DW$808, DW_AT_name("startTimer")
   12693                    .dwattr $C$DW$808, DW_AT_TI_symbol_name("startTimer")
   12694                    .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12695                    .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
   12696                    .dwattr $C$DW$808, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12697                    .dwattr $C$DW$808, DW_AT_decl_line(0xf7)
   12698                    .dwattr $C$DW$808, DW_AT_decl_column(0x0a)
   12699            
   12700                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12701                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
   12702                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
   12703                    .dwendtag $C$DW$T$37
   12704            
   12705            $C$DW$T$71      .dwtag  DW_TAG_typedef
   12706                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  277

   12707                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
   12708                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
   12709                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12710                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
   12711                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
   12712            
   12713            
   12714            $C$DW$T$38      .dwtag  DW_TAG_structure_type
   12715                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
   12716                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
   12717            $C$DW$809       .dwtag  DW_TAG_member
   12718                    .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$27)
   12719                    .dwattr $C$DW$809, DW_AT_name("clockSource")
   12720                    .dwattr $C$DW$809, DW_AT_TI_symbol_name("clockSource")
   12721                    .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12722                    .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
   12723                    .dwattr $C$DW$809, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12724                    .dwattr $C$DW$809, DW_AT_decl_line(0x107)
   12725                    .dwattr $C$DW$809, DW_AT_decl_column(0x0e)
   12726            
   12727            $C$DW$810       .dwtag  DW_TAG_member
   12728                    .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$27)
   12729                    .dwattr $C$DW$810, DW_AT_name("clockSourceDivider")
   12730                    .dwattr $C$DW$810, DW_AT_TI_symbol_name("clockSourceDivider")
   12731                    .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12732                    .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
   12733                    .dwattr $C$DW$810, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12734                    .dwattr $C$DW$810, DW_AT_decl_line(0x11e)
   12735                    .dwattr $C$DW$810, DW_AT_decl_column(0x0e)
   12736            
   12737            $C$DW$811       .dwtag  DW_TAG_member
   12738                    .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$27)
   12739                    .dwattr $C$DW$811, DW_AT_name("timerPeriod")
   12740                    .dwattr $C$DW$811, DW_AT_TI_symbol_name("timerPeriod")
   12741                    .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12742                    .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
   12743                    .dwattr $C$DW$811, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12744                    .dwattr $C$DW$811, DW_AT_decl_line(0x120)
   12745                    .dwattr $C$DW$811, DW_AT_decl_column(0x0e)
   12746            
   12747            $C$DW$812       .dwtag  DW_TAG_member
   12748                    .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$27)
   12749                    .dwattr $C$DW$812, DW_AT_name("timerInterruptEnable_TBIE")
   12750                    .dwattr $C$DW$812, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
   12751                    .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12752                    .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
   12753                    .dwattr $C$DW$812, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12754                    .dwattr $C$DW$812, DW_AT_decl_line(0x125)
   12755                    .dwattr $C$DW$812, DW_AT_decl_column(0x0e)
   12756            
   12757            $C$DW$813       .dwtag  DW_TAG_member
   12758                    .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$27)
   12759                    .dwattr $C$DW$813, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
   12760                    .dwattr $C$DW$813, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   12761                    .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  278

   12762                    .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
   12763                    .dwattr $C$DW$813, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12764                    .dwattr $C$DW$813, DW_AT_decl_line(0x12a)
   12765                    .dwattr $C$DW$813, DW_AT_decl_column(0x0e)
   12766            
   12767            $C$DW$814       .dwtag  DW_TAG_member
   12768                    .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$27)
   12769                    .dwattr $C$DW$814, DW_AT_name("timerClear")
   12770                    .dwattr $C$DW$814, DW_AT_TI_symbol_name("timerClear")
   12771                    .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12772                    .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
   12773                    .dwattr $C$DW$814, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12774                    .dwattr $C$DW$814, DW_AT_decl_line(0x130)
   12775                    .dwattr $C$DW$814, DW_AT_decl_column(0x0e)
   12776            
   12777            $C$DW$815       .dwtag  DW_TAG_member
   12778                    .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$30)
   12779                    .dwattr $C$DW$815, DW_AT_name("startTimer")
   12780                    .dwattr $C$DW$815, DW_AT_TI_symbol_name("startTimer")
   12781                    .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12782                    .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
   12783                    .dwattr $C$DW$815, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12784                    .dwattr $C$DW$815, DW_AT_decl_line(0x132)
   12785                    .dwattr $C$DW$815, DW_AT_decl_column(0x0a)
   12786            
   12787                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12788                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
   12789                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
   12790                    .dwendtag $C$DW$T$38
   12791            
   12792            $C$DW$T$72      .dwtag  DW_TAG_typedef
   12793                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
   12794                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
   12795                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
   12796                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12797                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
   12798                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
   12799            
   12800            
   12801            $C$DW$T$39      .dwtag  DW_TAG_structure_type
   12802                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
   12803                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
   12804            $C$DW$816       .dwtag  DW_TAG_member
   12805                    .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$27)
   12806                    .dwattr $C$DW$816, DW_AT_name("clockSource")
   12807                    .dwattr $C$DW$816, DW_AT_TI_symbol_name("clockSource")
   12808                    .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12809                    .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
   12810                    .dwattr $C$DW$816, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12811                    .dwattr $C$DW$816, DW_AT_decl_line(0x60)
   12812                    .dwattr $C$DW$816, DW_AT_decl_column(0x0e)
   12813            
   12814            $C$DW$817       .dwtag  DW_TAG_member
   12815                    .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$27)
   12816                    .dwattr $C$DW$817, DW_AT_name("clockSourceDivider")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  279

   12817                    .dwattr $C$DW$817, DW_AT_TI_symbol_name("clockSourceDivider")
   12818                    .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12819                    .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
   12820                    .dwattr $C$DW$817, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12821                    .dwattr $C$DW$817, DW_AT_decl_line(0x77)
   12822                    .dwattr $C$DW$817, DW_AT_decl_column(0x0e)
   12823            
   12824            $C$DW$818       .dwtag  DW_TAG_member
   12825                    .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$27)
   12826                    .dwattr $C$DW$818, DW_AT_name("timerPeriod")
   12827                    .dwattr $C$DW$818, DW_AT_TI_symbol_name("timerPeriod")
   12828                    .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12829                    .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
   12830                    .dwattr $C$DW$818, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12831                    .dwattr $C$DW$818, DW_AT_decl_line(0x7a)
   12832                    .dwattr $C$DW$818, DW_AT_decl_column(0x0e)
   12833            
   12834            $C$DW$819       .dwtag  DW_TAG_member
   12835                    .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$27)
   12836                    .dwattr $C$DW$819, DW_AT_name("timerInterruptEnable_TBIE")
   12837                    .dwattr $C$DW$819, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
   12838                    .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12839                    .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
   12840                    .dwattr $C$DW$819, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12841                    .dwattr $C$DW$819, DW_AT_decl_line(0x7f)
   12842                    .dwattr $C$DW$819, DW_AT_decl_column(0x0e)
   12843            
   12844            $C$DW$820       .dwtag  DW_TAG_member
   12845                    .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$27)
   12846                    .dwattr $C$DW$820, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
   12847                    .dwattr $C$DW$820, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   12848                    .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12849                    .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
   12850                    .dwattr $C$DW$820, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12851                    .dwattr $C$DW$820, DW_AT_decl_line(0x84)
   12852                    .dwattr $C$DW$820, DW_AT_decl_column(0x0e)
   12853            
   12854            $C$DW$821       .dwtag  DW_TAG_member
   12855                    .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$27)
   12856                    .dwattr $C$DW$821, DW_AT_name("timerClear")
   12857                    .dwattr $C$DW$821, DW_AT_TI_symbol_name("timerClear")
   12858                    .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12859                    .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
   12860                    .dwattr $C$DW$821, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12861                    .dwattr $C$DW$821, DW_AT_decl_line(0x8a)
   12862                    .dwattr $C$DW$821, DW_AT_decl_column(0x0e)
   12863            
   12864            $C$DW$822       .dwtag  DW_TAG_member
   12865                    .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$30)
   12866                    .dwattr $C$DW$822, DW_AT_name("startTimer")
   12867                    .dwattr $C$DW$822, DW_AT_TI_symbol_name("startTimer")
   12868                    .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12869                    .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
   12870                    .dwattr $C$DW$822, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12871                    .dwattr $C$DW$822, DW_AT_decl_line(0x8c)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  280

   12872                    .dwattr $C$DW$822, DW_AT_decl_column(0x0a)
   12873            
   12874                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12875                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
   12876                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
   12877                    .dwendtag $C$DW$T$39
   12878            
   12879            $C$DW$T$73      .dwtag  DW_TAG_typedef
   12880                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
   12881                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
   12882                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
   12883                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12884                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
   12885                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
   12886            
   12887            
   12888            $C$DW$T$40      .dwtag  DW_TAG_structure_type
   12889                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
   12890                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
   12891            $C$DW$823       .dwtag  DW_TAG_member
   12892                    .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$27)
   12893                    .dwattr $C$DW$823, DW_AT_name("clockSource")
   12894                    .dwattr $C$DW$823, DW_AT_TI_symbol_name("clockSource")
   12895                    .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12896                    .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
   12897                    .dwattr $C$DW$823, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12898                    .dwattr $C$DW$823, DW_AT_decl_line(0x20)
   12899                    .dwattr $C$DW$823, DW_AT_decl_column(0x0e)
   12900            
   12901            $C$DW$824       .dwtag  DW_TAG_member
   12902                    .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$27)
   12903                    .dwattr $C$DW$824, DW_AT_name("clockSourceDivider")
   12904                    .dwattr $C$DW$824, DW_AT_TI_symbol_name("clockSourceDivider")
   12905                    .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12906                    .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
   12907                    .dwattr $C$DW$824, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12908                    .dwattr $C$DW$824, DW_AT_decl_line(0x37)
   12909                    .dwattr $C$DW$824, DW_AT_decl_column(0x0e)
   12910            
   12911            $C$DW$825       .dwtag  DW_TAG_member
   12912                    .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$27)
   12913                    .dwattr $C$DW$825, DW_AT_name("timerPeriod")
   12914                    .dwattr $C$DW$825, DW_AT_TI_symbol_name("timerPeriod")
   12915                    .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12916                    .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
   12917                    .dwattr $C$DW$825, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12918                    .dwattr $C$DW$825, DW_AT_decl_line(0x39)
   12919                    .dwattr $C$DW$825, DW_AT_decl_column(0x0e)
   12920            
   12921            $C$DW$826       .dwtag  DW_TAG_member
   12922                    .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$27)
   12923                    .dwattr $C$DW$826, DW_AT_name("compareRegister")
   12924                    .dwattr $C$DW$826, DW_AT_TI_symbol_name("compareRegister")
   12925                    .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12926                    .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  281

   12927                    .dwattr $C$DW$826, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12928                    .dwattr $C$DW$826, DW_AT_decl_line(0x44)
   12929                    .dwattr $C$DW$826, DW_AT_decl_column(0x0e)
   12930            
   12931            $C$DW$827       .dwtag  DW_TAG_member
   12932                    .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$27)
   12933                    .dwattr $C$DW$827, DW_AT_name("compareOutputMode")
   12934                    .dwattr $C$DW$827, DW_AT_TI_symbol_name("compareOutputMode")
   12935                    .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12936                    .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
   12937                    .dwattr $C$DW$827, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12938                    .dwattr $C$DW$827, DW_AT_decl_line(0x4f)
   12939                    .dwattr $C$DW$827, DW_AT_decl_column(0x0e)
   12940            
   12941            $C$DW$828       .dwtag  DW_TAG_member
   12942                    .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$27)
   12943                    .dwattr $C$DW$828, DW_AT_name("dutyCycle")
   12944                    .dwattr $C$DW$828, DW_AT_TI_symbol_name("dutyCycle")
   12945                    .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12946                    .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
   12947                    .dwattr $C$DW$828, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   12948                    .dwattr $C$DW$828, DW_AT_decl_line(0x51)
   12949                    .dwattr $C$DW$828, DW_AT_decl_column(0x0e)
   12950            
   12951                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12952                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
   12953                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
   12954                    .dwendtag $C$DW$T$40
   12955            
   12956            $C$DW$T$74      .dwtag  DW_TAG_typedef
   12957                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
   12958                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
   12959                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
   12960                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   12961                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
   12962                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
   12963            
   12964            
   12965            $C$DW$T$41      .dwtag  DW_TAG_structure_type
   12966                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
   12967                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
   12968            $C$DW$829       .dwtag  DW_TAG_member
   12969                    .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$24)
   12970                    .dwattr $C$DW$829, DW_AT_name("selectClockSource")
   12971                    .dwattr $C$DW$829, DW_AT_TI_symbol_name("selectClockSource")
   12972                    .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12973                    .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
   12974                    .dwattr $C$DW$829, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   12975                    .dwattr $C$DW$829, DW_AT_decl_line(0x1c)
   12976                    .dwattr $C$DW$829, DW_AT_decl_column(0x0d)
   12977            
   12978            $C$DW$830       .dwtag  DW_TAG_member
   12979                    .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$27)
   12980                    .dwattr $C$DW$830, DW_AT_name("clockPrescalar")
   12981                    .dwattr $C$DW$830, DW_AT_TI_symbol_name("clockPrescalar")
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  282

   12982                    .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12983                    .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
   12984                    .dwattr $C$DW$830, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   12985                    .dwattr $C$DW$830, DW_AT_decl_line(0x1e)
   12986                    .dwattr $C$DW$830, DW_AT_decl_column(0x0e)
   12987            
   12988            $C$DW$831       .dwtag  DW_TAG_member
   12989                    .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$24)
   12990                    .dwattr $C$DW$831, DW_AT_name("firstModReg")
   12991                    .dwattr $C$DW$831, DW_AT_TI_symbol_name("firstModReg")
   12992                    .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12993                    .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
   12994                    .dwattr $C$DW$831, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   12995                    .dwattr $C$DW$831, DW_AT_decl_line(0x22)
   12996                    .dwattr $C$DW$831, DW_AT_decl_column(0x0d)
   12997            
   12998            $C$DW$832       .dwtag  DW_TAG_member
   12999                    .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$24)
   13000                    .dwattr $C$DW$832, DW_AT_name("secondModReg")
   13001                    .dwattr $C$DW$832, DW_AT_TI_symbol_name("secondModReg")
   13002                    .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13003                    .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
   13004                    .dwattr $C$DW$832, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13005                    .dwattr $C$DW$832, DW_AT_decl_line(0x26)
   13006                    .dwattr $C$DW$832, DW_AT_decl_column(0x0d)
   13007            
   13008            $C$DW$833       .dwtag  DW_TAG_member
   13009                    .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$24)
   13010                    .dwattr $C$DW$833, DW_AT_name("parity")
   13011                    .dwattr $C$DW$833, DW_AT_TI_symbol_name("parity")
   13012                    .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13013                    .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
   13014                    .dwattr $C$DW$833, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13015                    .dwattr $C$DW$833, DW_AT_decl_line(0x2c)
   13016                    .dwattr $C$DW$833, DW_AT_decl_column(0x0d)
   13017            
   13018            $C$DW$834       .dwtag  DW_TAG_member
   13019                    .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$24)
   13020                    .dwattr $C$DW$834, DW_AT_name("msborLsbFirst")
   13021                    .dwattr $C$DW$834, DW_AT_TI_symbol_name("msborLsbFirst")
   13022                    .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13023                    .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
   13024                    .dwattr $C$DW$834, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13025                    .dwattr $C$DW$834, DW_AT_decl_line(0x31)
   13026                    .dwattr $C$DW$834, DW_AT_decl_column(0x0d)
   13027            
   13028            $C$DW$835       .dwtag  DW_TAG_member
   13029                    .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$24)
   13030                    .dwattr $C$DW$835, DW_AT_name("numberofStopBits")
   13031                    .dwattr $C$DW$835, DW_AT_TI_symbol_name("numberofStopBits")
   13032                    .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13033                    .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
   13034                    .dwattr $C$DW$835, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13035                    .dwattr $C$DW$835, DW_AT_decl_line(0x36)
   13036                    .dwattr $C$DW$835, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  283

   13037            
   13038            $C$DW$836       .dwtag  DW_TAG_member
   13039                    .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$24)
   13040                    .dwattr $C$DW$836, DW_AT_name("uartMode")
   13041                    .dwattr $C$DW$836, DW_AT_TI_symbol_name("uartMode")
   13042                    .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13043                    .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
   13044                    .dwattr $C$DW$836, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13045                    .dwattr $C$DW$836, DW_AT_decl_line(0x3d)
   13046                    .dwattr $C$DW$836, DW_AT_decl_column(0x0d)
   13047            
   13048            $C$DW$837       .dwtag  DW_TAG_member
   13049                    .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$24)
   13050                    .dwattr $C$DW$837, DW_AT_name("overSampling")
   13051                    .dwattr $C$DW$837, DW_AT_TI_symbol_name("overSampling")
   13052                    .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13053                    .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
   13054                    .dwattr $C$DW$837, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13055                    .dwattr $C$DW$837, DW_AT_decl_line(0x42)
   13056                    .dwattr $C$DW$837, DW_AT_decl_column(0x0d)
   13057            
   13058                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   13059                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
   13060                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
   13061                    .dwendtag $C$DW$T$41
   13062            
   13063            $C$DW$T$75      .dwtag  DW_TAG_typedef
   13064                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
   13065                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
   13066                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
   13067                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   13068                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
   13069                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
   13070            
   13071            
   13072            $C$DW$T$44      .dwtag  DW_TAG_structure_type
   13073                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
   13074                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
   13075            $C$DW$838       .dwtag  DW_TAG_member
   13076                    .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$43)
   13077                    .dwattr $C$DW$838, DW_AT_name("clockSourceFrequency")
   13078                    .dwattr $C$DW$838, DW_AT_TI_symbol_name("clockSourceFrequency")
   13079                    .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13080                    .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
   13081                    .dwattr $C$DW$838, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13082                    .dwattr $C$DW$838, DW_AT_decl_line(0x31)
   13083                    .dwattr $C$DW$838, DW_AT_decl_column(0x0e)
   13084            
   13085            $C$DW$839       .dwtag  DW_TAG_member
   13086                    .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$43)
   13087                    .dwattr $C$DW$839, DW_AT_name("desiredSpiClock")
   13088                    .dwattr $C$DW$839, DW_AT_TI_symbol_name("desiredSpiClock")
   13089                    .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13090                    .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
   13091                    .dwattr $C$DW$839, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  284

   13092                    .dwattr $C$DW$839, DW_AT_decl_line(0x33)
   13093                    .dwattr $C$DW$839, DW_AT_decl_column(0x0e)
   13094            
   13095                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   13096                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
   13097                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
   13098                    .dwendtag $C$DW$T$44
   13099            
   13100            $C$DW$T$76      .dwtag  DW_TAG_typedef
   13101                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
   13102                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
   13103                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
   13104                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   13105                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
   13106                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
   13107            
   13108            
   13109            $C$DW$T$45      .dwtag  DW_TAG_structure_type
   13110                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
   13111                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
   13112            $C$DW$840       .dwtag  DW_TAG_member
   13113                    .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$24)
   13114                    .dwattr $C$DW$840, DW_AT_name("selectClockSource")
   13115                    .dwattr $C$DW$840, DW_AT_TI_symbol_name("selectClockSource")
   13116                    .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13117                    .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
   13118                    .dwattr $C$DW$840, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13119                    .dwattr $C$DW$840, DW_AT_decl_line(0x14)
   13120                    .dwattr $C$DW$840, DW_AT_decl_column(0x0d)
   13121            
   13122            $C$DW$841       .dwtag  DW_TAG_member
   13123                    .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$43)
   13124                    .dwattr $C$DW$841, DW_AT_name("clockSourceFrequency")
   13125                    .dwattr $C$DW$841, DW_AT_TI_symbol_name("clockSourceFrequency")
   13126                    .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13127                    .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
   13128                    .dwattr $C$DW$841, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13129                    .dwattr $C$DW$841, DW_AT_decl_line(0x16)
   13130                    .dwattr $C$DW$841, DW_AT_decl_column(0x0e)
   13131            
   13132            $C$DW$842       .dwtag  DW_TAG_member
   13133                    .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$43)
   13134                    .dwattr $C$DW$842, DW_AT_name("desiredSpiClock")
   13135                    .dwattr $C$DW$842, DW_AT_TI_symbol_name("desiredSpiClock")
   13136                    .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13137                    .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
   13138                    .dwattr $C$DW$842, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13139                    .dwattr $C$DW$842, DW_AT_decl_line(0x18)
   13140                    .dwattr $C$DW$842, DW_AT_decl_column(0x0e)
   13141            
   13142            $C$DW$843       .dwtag  DW_TAG_member
   13143                    .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$24)
   13144                    .dwattr $C$DW$843, DW_AT_name("msbFirst")
   13145                    .dwattr $C$DW$843, DW_AT_TI_symbol_name("msbFirst")
   13146                    .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 14:07:36 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
start.asm                                                            PAGE  285

   13147                    .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
   13148                    .dwattr $C$DW$843, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   13149                    .dwattr $C$DW$843, DW_AT_decl_line(0x1d)
   13150                    .dwattr $C$DW$843, DW_AT_decl_column(0x0d)
   13151            
