MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:02 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/TC_Fault_Check.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PDIN_H")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PDIN_H")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$87)

    4686            $C$DW$240       .dwtag  DW_TAG_enumerator
    4687                    .dwattr $C$DW$240, DW_AT_name("crc2")
    4688                    .dwattr $C$DW$240, DW_AT_const_value(0x06)
    4689                    .dwattr $C$DW$240, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4690                    .dwattr $C$DW$240, DW_AT_decl_line(0x76)
    4691                    .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    4692            
    4693            $C$DW$241       .dwtag  DW_TAG_enumerator
    4694                    .dwattr $C$DW$241, DW_AT_name("ack")
    4695                    .dwattr $C$DW$241, DW_AT_const_value(0x07)
    4696                    .dwattr $C$DW$241, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4697                    .dwattr $C$DW$241, DW_AT_decl_line(0x77)
    4698                    .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    4699            
    4700            $C$DW$242       .dwtag  DW_TAG_enumerator
    4701                    .dwattr $C$DW$242, DW_AT_name("var")
    4702                    .dwattr $C$DW$242, DW_AT_const_value(0x08)
    4703                    .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4704                    .dwattr $C$DW$242, DW_AT_decl_line(0x78)
    4705                    .dwattr $C$DW$242, DW_AT_decl_column(0x05)
    4706            
    4707            $C$DW$243       .dwtag  DW_TAG_enumerator
    4708                    .dwattr $C$DW$243, DW_AT_name("UGmsg")
    4709                    .dwattr $C$DW$243, DW_AT_const_value(0x09)
    4710                    .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4711                    .dwattr $C$DW$243, DW_AT_decl_line(0x79)
    4712                    .dwattr $C$DW$243, DW_AT_decl_column(0x05)
    4713            
    4714                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4715                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
    4716                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
    4717                    .dwendtag $C$DW$T$57
    4718            
    4719            $C$DW$T$58      .dwtag  DW_TAG_typedef
    4720                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
    4721                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    4722                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE   99

    4723                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4724                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
    4725                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4726            
    4727            
    4728            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    4729                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    4730            $C$DW$244       .dwtag  DW_TAG_enumerator
    4731                    .dwattr $C$DW$244, DW_AT_name("init")
    4732                    .dwattr $C$DW$244, DW_AT_const_value(0x00)
    4733                    .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4734                    .dwattr $C$DW$244, DW_AT_decl_line(0x80)
    4735                    .dwattr $C$DW$244, DW_AT_decl_column(0x05)
    4736            
    4737            $C$DW$245       .dwtag  DW_TAG_enumerator
    4738                    .dwattr $C$DW$245, DW_AT_name("running")
    4739                    .dwattr $C$DW$245, DW_AT_const_value(0x01)
    4740                    .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4741                    .dwattr $C$DW$245, DW_AT_decl_line(0x80)
    4742                    .dwattr $C$DW$245, DW_AT_decl_column(0x0b)
    4743            
    4744            $C$DW$246       .dwtag  DW_TAG_enumerator
    4745                    .dwattr $C$DW$246, DW_AT_name("wait")
    4746                    .dwattr $C$DW$246, DW_AT_const_value(0x02)
    4747                    .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
    4748                    .dwattr $C$DW$246, DW_AT_decl_line(0x80)
    4749                    .dwattr $C$DW$246, DW_AT_decl_column(0x14)
    4750            
    4751                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4752                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
    4753                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4754                    .dwendtag $C$DW$T$59
    4755            
    4756            $C$DW$T$60      .dwtag  DW_TAG_typedef
    4757                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
    4758                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4759                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4760                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
    4761                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
    4762                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    4763            
    4764            
    4765            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4766                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4767            $C$DW$247       .dwtag  DW_TAG_member
    4768                    .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$14)
    4769                    .dwattr $C$DW$247, DW_AT_name("__max_align1")
    4770                    .dwattr $C$DW$247, DW_AT_TI_symbol_name("__max_align1")
    4771                    .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4772                    .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4773                    .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4774                    .dwattr $C$DW$247, DW_AT_decl_line(0x7b)
    4775                    .dwattr $C$DW$247, DW_AT_decl_column(0x0c)
    4776            
    4777            $C$DW$248       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  100

    4778                    .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$18)
    4779                    .dwattr $C$DW$248, DW_AT_name("__max_align2")
    4780                    .dwattr $C$DW$248, DW_AT_TI_symbol_name("__max_align2")
    4781                    .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4782                    .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4783                    .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    4784                    .dwattr $C$DW$248, DW_AT_decl_line(0x7c)
    4785                    .dwattr $C$DW$248, DW_AT_decl_column(0x0e)
    4786            
    4787                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4788                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
    4789                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4790                    .dwendtag $C$DW$T$22
    4791            
    4792            $C$DW$T$61      .dwtag  DW_TAG_typedef
    4793                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
    4794                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    4795                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4796                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    4797                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
    4798                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    4799            
    4800            
    4801            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4802                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
    4803                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
    4804            $C$DW$249       .dwtag  DW_TAG_member
    4805                    .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$24)
    4806                    .dwattr $C$DW$249, DW_AT_name("memoryBufferControlIndex")
    4807                    .dwattr $C$DW$249, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    4808                    .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4809                    .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4810                    .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4811                    .dwattr $C$DW$249, DW_AT_decl_line(0x27)
    4812                    .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    4813            
    4814            $C$DW$250       .dwtag  DW_TAG_member
    4815                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$24)
    4816                    .dwattr $C$DW$250, DW_AT_name("inputSourceSelect")
    4817                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("inputSourceSelect")
    4818                    .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4819                    .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4820                    .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4821                    .dwattr $C$DW$250, DW_AT_decl_line(0x3b)
    4822                    .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    4823            
    4824            $C$DW$251       .dwtag  DW_TAG_member
    4825                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    4826                    .dwattr $C$DW$251, DW_AT_name("positiveRefVoltageSourceSelect")
    4827                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    4828                    .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4829                    .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4830                    .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4831                    .dwattr $C$DW$251, DW_AT_decl_line(0x42)
    4832                    .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  101

    4833            
    4834            $C$DW$252       .dwtag  DW_TAG_member
    4835                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    4836                    .dwattr $C$DW$252, DW_AT_name("negativeRefVoltageSourceSelect")
    4837                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    4838                    .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4839                    .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4840                    .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4841                    .dwattr $C$DW$252, DW_AT_decl_line(0x48)
    4842                    .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
    4843            
    4844            $C$DW$253       .dwtag  DW_TAG_member
    4845                    .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    4846                    .dwattr $C$DW$253, DW_AT_name("endOfSequence")
    4847                    .dwattr $C$DW$253, DW_AT_TI_symbol_name("endOfSequence")
    4848                    .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4849                    .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4850                    .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
    4851                    .dwattr $C$DW$253, DW_AT_decl_line(0x51)
    4852                    .dwattr $C$DW$253, DW_AT_decl_column(0x0d)
    4853            
    4854                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4855                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
    4856                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4857                    .dwendtag $C$DW$T$25
    4858            
    4859            $C$DW$T$62      .dwtag  DW_TAG_typedef
    4860                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
    4861                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
    4862                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4863                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
    4864                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
    4865                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    4866            
    4867            
    4868            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4869                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
    4870                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    4871            $C$DW$254       .dwtag  DW_TAG_member
    4872                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    4873                    .dwattr $C$DW$254, DW_AT_name("captureRegister")
    4874                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("captureRegister")
    4875                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4876                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4877                    .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4878                    .dwattr $C$DW$254, DW_AT_decl_line(0x58)
    4879                    .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    4880            
    4881            $C$DW$255       .dwtag  DW_TAG_member
    4882                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    4883                    .dwattr $C$DW$255, DW_AT_name("captureMode")
    4884                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("captureMode")
    4885                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4886                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4887                    .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  102

    4888                    .dwattr $C$DW$255, DW_AT_decl_line(0x5f)
    4889                    .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    4890            
    4891            $C$DW$256       .dwtag  DW_TAG_member
    4892                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    4893                    .dwattr $C$DW$256, DW_AT_name("captureInputSelect")
    4894                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("captureInputSelect")
    4895                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4896                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4897                    .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4898                    .dwattr $C$DW$256, DW_AT_decl_line(0x66)
    4899                    .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    4900            
    4901            $C$DW$257       .dwtag  DW_TAG_member
    4902                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    4903                    .dwattr $C$DW$257, DW_AT_name("synchronizeCaptureSource")
    4904                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    4905                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4906                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4907                    .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4908                    .dwattr $C$DW$257, DW_AT_decl_line(0x6b)
    4909                    .dwattr $C$DW$257, DW_AT_decl_column(0x0e)
    4910            
    4911            $C$DW$258       .dwtag  DW_TAG_member
    4912                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    4913                    .dwattr $C$DW$258, DW_AT_name("captureInterruptEnable")
    4914                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("captureInterruptEnable")
    4915                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4916                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4917                    .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4918                    .dwattr $C$DW$258, DW_AT_decl_line(0x70)
    4919                    .dwattr $C$DW$258, DW_AT_decl_column(0x0e)
    4920            
    4921            $C$DW$259       .dwtag  DW_TAG_member
    4922                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    4923                    .dwattr $C$DW$259, DW_AT_name("captureOutputMode")
    4924                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("captureOutputMode")
    4925                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4926                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4927                    .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4928                    .dwattr $C$DW$259, DW_AT_decl_line(0x7b)
    4929                    .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    4930            
    4931                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4932                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
    4933                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4934                    .dwendtag $C$DW$T$28
    4935            
    4936            $C$DW$T$63      .dwtag  DW_TAG_typedef
    4937                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
    4938                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
    4939                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4940                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4941                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
    4942                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  103

    4943            
    4944            
    4945            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4946                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
    4947                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4948            $C$DW$260       .dwtag  DW_TAG_member
    4949                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    4950                    .dwattr $C$DW$260, DW_AT_name("compareRegister")
    4951                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("compareRegister")
    4952                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4953                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4954                    .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4955                    .dwattr $C$DW$260, DW_AT_decl_line(0x145)
    4956                    .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    4957            
    4958            $C$DW$261       .dwtag  DW_TAG_member
    4959                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    4960                    .dwattr $C$DW$261, DW_AT_name("compareInterruptEnable")
    4961                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("compareInterruptEnable")
    4962                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4963                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4964                    .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4965                    .dwattr $C$DW$261, DW_AT_decl_line(0x14a)
    4966                    .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    4967            
    4968            $C$DW$262       .dwtag  DW_TAG_member
    4969                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    4970                    .dwattr $C$DW$262, DW_AT_name("compareOutputMode")
    4971                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("compareOutputMode")
    4972                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4973                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4974                    .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4975                    .dwattr $C$DW$262, DW_AT_decl_line(0x155)
    4976                    .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    4977            
    4978            $C$DW$263       .dwtag  DW_TAG_member
    4979                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
    4980                    .dwattr $C$DW$263, DW_AT_name("compareValue")
    4981                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("compareValue")
    4982                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4983                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4984                    .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    4985                    .dwattr $C$DW$263, DW_AT_decl_line(0x157)
    4986                    .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    4987            
    4988                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    4989                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
    4990                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4991                    .dwendtag $C$DW$T$29
    4992            
    4993            $C$DW$T$64      .dwtag  DW_TAG_typedef
    4994                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
    4995                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    4996                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4997                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  104

    4998                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
    4999                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    5000            
    5001            
    5002            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5003                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
    5004                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    5005            $C$DW$264       .dwtag  DW_TAG_member
    5006                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$27)
    5007                    .dwattr $C$DW$264, DW_AT_name("clockSource")
    5008                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("clockSource")
    5009                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5010                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5011                    .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5012                    .dwattr $C$DW$264, DW_AT_decl_line(0x20)
    5013                    .dwattr $C$DW$264, DW_AT_decl_column(0x0e)
    5014            
    5015            $C$DW$265       .dwtag  DW_TAG_member
    5016                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$27)
    5017                    .dwattr $C$DW$265, DW_AT_name("clockSourceDivider")
    5018                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("clockSourceDivider")
    5019                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5020                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5021                    .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5022                    .dwattr $C$DW$265, DW_AT_decl_line(0x37)
    5023                    .dwattr $C$DW$265, DW_AT_decl_column(0x0e)
    5024            
    5025            $C$DW$266       .dwtag  DW_TAG_member
    5026                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
    5027                    .dwattr $C$DW$266, DW_AT_name("timerInterruptEnable_TAIE")
    5028                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5029                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5030                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5031                    .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5032                    .dwattr $C$DW$266, DW_AT_decl_line(0x3c)
    5033                    .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    5034            
    5035            $C$DW$267       .dwtag  DW_TAG_member
    5036                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    5037                    .dwattr $C$DW$267, DW_AT_name("timerClear")
    5038                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("timerClear")
    5039                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5040                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5041                    .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5042                    .dwattr $C$DW$267, DW_AT_decl_line(0x42)
    5043                    .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    5044            
    5045            $C$DW$268       .dwtag  DW_TAG_member
    5046                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$30)
    5047                    .dwattr $C$DW$268, DW_AT_name("startTimer")
    5048                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("startTimer")
    5049                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5050                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5051                    .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5052                    .dwattr $C$DW$268, DW_AT_decl_line(0x44)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  105

    5053                    .dwattr $C$DW$268, DW_AT_decl_column(0x0a)
    5054            
    5055                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5056                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
    5057                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5058                    .dwendtag $C$DW$T$31
    5059            
    5060            $C$DW$T$65      .dwtag  DW_TAG_typedef
    5061                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
    5062                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
    5063                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5064                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5065                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    5066                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    5067            
    5068            
    5069            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5070                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
    5071                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    5072            $C$DW$269       .dwtag  DW_TAG_member
    5073                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    5074                    .dwattr $C$DW$269, DW_AT_name("clockSource")
    5075                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("clockSource")
    5076                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5077                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5078                    .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5079                    .dwattr $C$DW$269, DW_AT_decl_line(0x8b)
    5080                    .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    5081            
    5082            $C$DW$270       .dwtag  DW_TAG_member
    5083                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$27)
    5084                    .dwattr $C$DW$270, DW_AT_name("clockSourceDivider")
    5085                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("clockSourceDivider")
    5086                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5087                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5088                    .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5089                    .dwattr $C$DW$270, DW_AT_decl_line(0xa2)
    5090                    .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
    5091            
    5092            $C$DW$271       .dwtag  DW_TAG_member
    5093                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$27)
    5094                    .dwattr $C$DW$271, DW_AT_name("timerPeriod")
    5095                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("timerPeriod")
    5096                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5097                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5098                    .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5099                    .dwattr $C$DW$271, DW_AT_decl_line(0xa4)
    5100                    .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    5101            
    5102            $C$DW$272       .dwtag  DW_TAG_member
    5103                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$27)
    5104                    .dwattr $C$DW$272, DW_AT_name("timerInterruptEnable_TAIE")
    5105                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5106                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5107                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  106

    5108                    .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5109                    .dwattr $C$DW$272, DW_AT_decl_line(0xa9)
    5110                    .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
    5111            
    5112            $C$DW$273       .dwtag  DW_TAG_member
    5113                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$27)
    5114                    .dwattr $C$DW$273, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5115                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5116                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5117                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5118                    .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5119                    .dwattr $C$DW$273, DW_AT_decl_line(0xae)
    5120                    .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    5121            
    5122            $C$DW$274       .dwtag  DW_TAG_member
    5123                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$27)
    5124                    .dwattr $C$DW$274, DW_AT_name("timerClear")
    5125                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("timerClear")
    5126                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5127                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5128                    .dwattr $C$DW$274, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5129                    .dwattr $C$DW$274, DW_AT_decl_line(0xb4)
    5130                    .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    5131            
    5132            $C$DW$275       .dwtag  DW_TAG_member
    5133                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$30)
    5134                    .dwattr $C$DW$275, DW_AT_name("startTimer")
    5135                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("startTimer")
    5136                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5137                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5138                    .dwattr $C$DW$275, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5139                    .dwattr $C$DW$275, DW_AT_decl_line(0xb6)
    5140                    .dwattr $C$DW$275, DW_AT_decl_column(0x0a)
    5141            
    5142                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5143                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
    5144                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    5145                    .dwendtag $C$DW$T$32
    5146            
    5147            $C$DW$T$66      .dwtag  DW_TAG_typedef
    5148                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
    5149                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
    5150                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    5151                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5152                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
    5153                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    5154            
    5155            
    5156            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5157                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
    5158                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
    5159            $C$DW$276       .dwtag  DW_TAG_member
    5160                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$27)
    5161                    .dwattr $C$DW$276, DW_AT_name("clockSource")
    5162                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("clockSource")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  107

    5163                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5164                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5165                    .dwattr $C$DW$276, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5166                    .dwattr $C$DW$276, DW_AT_decl_line(0x105)
    5167                    .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    5168            
    5169            $C$DW$277       .dwtag  DW_TAG_member
    5170                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$27)
    5171                    .dwattr $C$DW$277, DW_AT_name("clockSourceDivider")
    5172                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("clockSourceDivider")
    5173                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5174                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5175                    .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5176                    .dwattr $C$DW$277, DW_AT_decl_line(0x11c)
    5177                    .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    5178            
    5179            $C$DW$278       .dwtag  DW_TAG_member
    5180                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    5181                    .dwattr $C$DW$278, DW_AT_name("timerPeriod")
    5182                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("timerPeriod")
    5183                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5184                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5185                    .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5186                    .dwattr $C$DW$278, DW_AT_decl_line(0x11f)
    5187                    .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    5188            
    5189            $C$DW$279       .dwtag  DW_TAG_member
    5190                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    5191                    .dwattr $C$DW$279, DW_AT_name("timerInterruptEnable_TAIE")
    5192                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    5193                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5194                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5195                    .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5196                    .dwattr $C$DW$279, DW_AT_decl_line(0x124)
    5197                    .dwattr $C$DW$279, DW_AT_decl_column(0x0e)
    5198            
    5199            $C$DW$280       .dwtag  DW_TAG_member
    5200                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    5201                    .dwattr $C$DW$280, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5202                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5203                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5204                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5205                    .dwattr $C$DW$280, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5206                    .dwattr $C$DW$280, DW_AT_decl_line(0x129)
    5207                    .dwattr $C$DW$280, DW_AT_decl_column(0x0e)
    5208            
    5209            $C$DW$281       .dwtag  DW_TAG_member
    5210                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    5211                    .dwattr $C$DW$281, DW_AT_name("timerClear")
    5212                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("timerClear")
    5213                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5214                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5215                    .dwattr $C$DW$281, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5216                    .dwattr $C$DW$281, DW_AT_decl_line(0x12f)
    5217                    .dwattr $C$DW$281, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  108

    5218            
    5219            $C$DW$282       .dwtag  DW_TAG_member
    5220                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$30)
    5221                    .dwattr $C$DW$282, DW_AT_name("startTimer")
    5222                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("startTimer")
    5223                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5224                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5225                    .dwattr $C$DW$282, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5226                    .dwattr $C$DW$282, DW_AT_decl_line(0x131)
    5227                    .dwattr $C$DW$282, DW_AT_decl_column(0x0a)
    5228            
    5229                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5230                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
    5231                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    5232                    .dwendtag $C$DW$T$33
    5233            
    5234            $C$DW$T$67      .dwtag  DW_TAG_typedef
    5235                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
    5236                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
    5237                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    5238                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5239                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
    5240                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    5241            
    5242            
    5243            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5244                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
    5245                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
    5246            $C$DW$283       .dwtag  DW_TAG_member
    5247                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    5248                    .dwattr $C$DW$283, DW_AT_name("clockSource")
    5249                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("clockSource")
    5250                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5251                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5252                    .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5253                    .dwattr $C$DW$283, DW_AT_decl_line(0xc5)
    5254                    .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    5255            
    5256            $C$DW$284       .dwtag  DW_TAG_member
    5257                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    5258                    .dwattr $C$DW$284, DW_AT_name("clockSourceDivider")
    5259                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("clockSourceDivider")
    5260                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5261                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5262                    .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5263                    .dwattr $C$DW$284, DW_AT_decl_line(0xdc)
    5264                    .dwattr $C$DW$284, DW_AT_decl_column(0x0e)
    5265            
    5266            $C$DW$285       .dwtag  DW_TAG_member
    5267                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    5268                    .dwattr $C$DW$285, DW_AT_name("timerPeriod")
    5269                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("timerPeriod")
    5270                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5271                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5272                    .dwattr $C$DW$285, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  109

    5273                    .dwattr $C$DW$285, DW_AT_decl_line(0xde)
    5274                    .dwattr $C$DW$285, DW_AT_decl_column(0x0e)
    5275            
    5276            $C$DW$286       .dwtag  DW_TAG_member
    5277                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    5278                    .dwattr $C$DW$286, DW_AT_name("compareRegister")
    5279                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("compareRegister")
    5280                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5281                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5282                    .dwattr $C$DW$286, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5283                    .dwattr $C$DW$286, DW_AT_decl_line(0xe9)
    5284                    .dwattr $C$DW$286, DW_AT_decl_column(0x0e)
    5285            
    5286            $C$DW$287       .dwtag  DW_TAG_member
    5287                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    5288                    .dwattr $C$DW$287, DW_AT_name("compareOutputMode")
    5289                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("compareOutputMode")
    5290                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5291                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5292                    .dwattr $C$DW$287, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5293                    .dwattr $C$DW$287, DW_AT_decl_line(0xf4)
    5294                    .dwattr $C$DW$287, DW_AT_decl_column(0x0e)
    5295            
    5296            $C$DW$288       .dwtag  DW_TAG_member
    5297                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
    5298                    .dwattr $C$DW$288, DW_AT_name("dutyCycle")
    5299                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("dutyCycle")
    5300                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5301                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5302                    .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5303                    .dwattr $C$DW$288, DW_AT_decl_line(0xf6)
    5304                    .dwattr $C$DW$288, DW_AT_decl_column(0x0e)
    5305            
    5306                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5307                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
    5308                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    5309                    .dwendtag $C$DW$T$34
    5310            
    5311            $C$DW$T$68      .dwtag  DW_TAG_typedef
    5312                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
    5313                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
    5314                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    5315                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5316                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
    5317                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    5318            
    5319            
    5320            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5321                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
    5322                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    5323            $C$DW$289       .dwtag  DW_TAG_member
    5324                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    5325                    .dwattr $C$DW$289, DW_AT_name("captureRegister")
    5326                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("captureRegister")
    5327                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  110

    5328                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5329                    .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5330                    .dwattr $C$DW$289, DW_AT_decl_line(0xa0)
    5331                    .dwattr $C$DW$289, DW_AT_decl_column(0x0e)
    5332            
    5333            $C$DW$290       .dwtag  DW_TAG_member
    5334                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$27)
    5335                    .dwattr $C$DW$290, DW_AT_name("captureMode")
    5336                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("captureMode")
    5337                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5338                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5339                    .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5340                    .dwattr $C$DW$290, DW_AT_decl_line(0xa7)
    5341                    .dwattr $C$DW$290, DW_AT_decl_column(0x0e)
    5342            
    5343            $C$DW$291       .dwtag  DW_TAG_member
    5344                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$27)
    5345                    .dwattr $C$DW$291, DW_AT_name("captureInputSelect")
    5346                    .dwattr $C$DW$291, DW_AT_TI_symbol_name("captureInputSelect")
    5347                    .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5348                    .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5349                    .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5350                    .dwattr $C$DW$291, DW_AT_decl_line(0xae)
    5351                    .dwattr $C$DW$291, DW_AT_decl_column(0x0e)
    5352            
    5353            $C$DW$292       .dwtag  DW_TAG_member
    5354                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
    5355                    .dwattr $C$DW$292, DW_AT_name("synchronizeCaptureSource")
    5356                    .dwattr $C$DW$292, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    5357                    .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5358                    .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5359                    .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5360                    .dwattr $C$DW$292, DW_AT_decl_line(0xb3)
    5361                    .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    5362            
    5363            $C$DW$293       .dwtag  DW_TAG_member
    5364                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$27)
    5365                    .dwattr $C$DW$293, DW_AT_name("captureInterruptEnable")
    5366                    .dwattr $C$DW$293, DW_AT_TI_symbol_name("captureInterruptEnable")
    5367                    .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5368                    .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5369                    .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5370                    .dwattr $C$DW$293, DW_AT_decl_line(0xb8)
    5371                    .dwattr $C$DW$293, DW_AT_decl_column(0x0e)
    5372            
    5373            $C$DW$294       .dwtag  DW_TAG_member
    5374                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$27)
    5375                    .dwattr $C$DW$294, DW_AT_name("captureOutputMode")
    5376                    .dwattr $C$DW$294, DW_AT_TI_symbol_name("captureOutputMode")
    5377                    .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5378                    .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5379                    .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5380                    .dwattr $C$DW$294, DW_AT_decl_line(0xc3)
    5381                    .dwattr $C$DW$294, DW_AT_decl_column(0x0e)
    5382            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  111

    5383                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5384                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
    5385                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    5386                    .dwendtag $C$DW$T$35
    5387            
    5388            $C$DW$T$69      .dwtag  DW_TAG_typedef
    5389                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
    5390                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    5391                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    5392                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5393                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
    5394                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    5395            
    5396            
    5397            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5398                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
    5399                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    5400            $C$DW$295       .dwtag  DW_TAG_member
    5401                    .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$27)
    5402                    .dwattr $C$DW$295, DW_AT_name("compareRegister")
    5403                    .dwattr $C$DW$295, DW_AT_TI_symbol_name("compareRegister")
    5404                    .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5405                    .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5406                    .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5407                    .dwattr $C$DW$295, DW_AT_decl_line(0x146)
    5408                    .dwattr $C$DW$295, DW_AT_decl_column(0x0e)
    5409            
    5410            $C$DW$296       .dwtag  DW_TAG_member
    5411                    .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$27)
    5412                    .dwattr $C$DW$296, DW_AT_name("compareInterruptEnable")
    5413                    .dwattr $C$DW$296, DW_AT_TI_symbol_name("compareInterruptEnable")
    5414                    .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5415                    .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5416                    .dwattr $C$DW$296, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5417                    .dwattr $C$DW$296, DW_AT_decl_line(0x14b)
    5418                    .dwattr $C$DW$296, DW_AT_decl_column(0x0e)
    5419            
    5420            $C$DW$297       .dwtag  DW_TAG_member
    5421                    .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$27)
    5422                    .dwattr $C$DW$297, DW_AT_name("compareOutputMode")
    5423                    .dwattr $C$DW$297, DW_AT_TI_symbol_name("compareOutputMode")
    5424                    .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5425                    .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5426                    .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5427                    .dwattr $C$DW$297, DW_AT_decl_line(0x156)
    5428                    .dwattr $C$DW$297, DW_AT_decl_column(0x0e)
    5429            
    5430            $C$DW$298       .dwtag  DW_TAG_member
    5431                    .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$27)
    5432                    .dwattr $C$DW$298, DW_AT_name("compareValue")
    5433                    .dwattr $C$DW$298, DW_AT_TI_symbol_name("compareValue")
    5434                    .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5435                    .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5436                    .dwattr $C$DW$298, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5437                    .dwattr $C$DW$298, DW_AT_decl_line(0x158)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  112

    5438                    .dwattr $C$DW$298, DW_AT_decl_column(0x0e)
    5439            
    5440                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5441                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
    5442                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    5443                    .dwendtag $C$DW$T$36
    5444            
    5445            $C$DW$T$70      .dwtag  DW_TAG_typedef
    5446                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
    5447                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
    5448                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    5449                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5450                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
    5451                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    5452            
    5453            
    5454            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5455                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
    5456                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    5457            $C$DW$299       .dwtag  DW_TAG_member
    5458                    .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$27)
    5459                    .dwattr $C$DW$299, DW_AT_name("clockSource")
    5460                    .dwattr $C$DW$299, DW_AT_TI_symbol_name("clockSource")
    5461                    .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5462                    .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5463                    .dwattr $C$DW$299, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5464                    .dwattr $C$DW$299, DW_AT_decl_line(0xd3)
    5465                    .dwattr $C$DW$299, DW_AT_decl_column(0x0e)
    5466            
    5467            $C$DW$300       .dwtag  DW_TAG_member
    5468                    .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$27)
    5469                    .dwattr $C$DW$300, DW_AT_name("clockSourceDivider")
    5470                    .dwattr $C$DW$300, DW_AT_TI_symbol_name("clockSourceDivider")
    5471                    .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5472                    .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5473                    .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5474                    .dwattr $C$DW$300, DW_AT_decl_line(0xea)
    5475                    .dwattr $C$DW$300, DW_AT_decl_column(0x0e)
    5476            
    5477            $C$DW$301       .dwtag  DW_TAG_member
    5478                    .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$27)
    5479                    .dwattr $C$DW$301, DW_AT_name("timerInterruptEnable_TBIE")
    5480                    .dwattr $C$DW$301, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5481                    .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5482                    .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5483                    .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5484                    .dwattr $C$DW$301, DW_AT_decl_line(0xef)
    5485                    .dwattr $C$DW$301, DW_AT_decl_column(0x0e)
    5486            
    5487            $C$DW$302       .dwtag  DW_TAG_member
    5488                    .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$27)
    5489                    .dwattr $C$DW$302, DW_AT_name("timerClear")
    5490                    .dwattr $C$DW$302, DW_AT_TI_symbol_name("timerClear")
    5491                    .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5492                    .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  113

    5493                    .dwattr $C$DW$302, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5494                    .dwattr $C$DW$302, DW_AT_decl_line(0xf5)
    5495                    .dwattr $C$DW$302, DW_AT_decl_column(0x0e)
    5496            
    5497            $C$DW$303       .dwtag  DW_TAG_member
    5498                    .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$30)
    5499                    .dwattr $C$DW$303, DW_AT_name("startTimer")
    5500                    .dwattr $C$DW$303, DW_AT_TI_symbol_name("startTimer")
    5501                    .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5502                    .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5503                    .dwattr $C$DW$303, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5504                    .dwattr $C$DW$303, DW_AT_decl_line(0xf7)
    5505                    .dwattr $C$DW$303, DW_AT_decl_column(0x0a)
    5506            
    5507                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5508                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
    5509                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5510                    .dwendtag $C$DW$T$37
    5511            
    5512            $C$DW$T$71      .dwtag  DW_TAG_typedef
    5513                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
    5514                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    5515                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    5516                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5517                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
    5518                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    5519            
    5520            
    5521            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5522                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
    5523                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    5524            $C$DW$304       .dwtag  DW_TAG_member
    5525                    .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$27)
    5526                    .dwattr $C$DW$304, DW_AT_name("clockSource")
    5527                    .dwattr $C$DW$304, DW_AT_TI_symbol_name("clockSource")
    5528                    .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5529                    .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5530                    .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5531                    .dwattr $C$DW$304, DW_AT_decl_line(0x107)
    5532                    .dwattr $C$DW$304, DW_AT_decl_column(0x0e)
    5533            
    5534            $C$DW$305       .dwtag  DW_TAG_member
    5535                    .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$27)
    5536                    .dwattr $C$DW$305, DW_AT_name("clockSourceDivider")
    5537                    .dwattr $C$DW$305, DW_AT_TI_symbol_name("clockSourceDivider")
    5538                    .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5539                    .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5540                    .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5541                    .dwattr $C$DW$305, DW_AT_decl_line(0x11e)
    5542                    .dwattr $C$DW$305, DW_AT_decl_column(0x0e)
    5543            
    5544            $C$DW$306       .dwtag  DW_TAG_member
    5545                    .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$27)
    5546                    .dwattr $C$DW$306, DW_AT_name("timerPeriod")
    5547                    .dwattr $C$DW$306, DW_AT_TI_symbol_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  114

    5548                    .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5549                    .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5550                    .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5551                    .dwattr $C$DW$306, DW_AT_decl_line(0x120)
    5552                    .dwattr $C$DW$306, DW_AT_decl_column(0x0e)
    5553            
    5554            $C$DW$307       .dwtag  DW_TAG_member
    5555                    .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$27)
    5556                    .dwattr $C$DW$307, DW_AT_name("timerInterruptEnable_TBIE")
    5557                    .dwattr $C$DW$307, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5558                    .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5559                    .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5560                    .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5561                    .dwattr $C$DW$307, DW_AT_decl_line(0x125)
    5562                    .dwattr $C$DW$307, DW_AT_decl_column(0x0e)
    5563            
    5564            $C$DW$308       .dwtag  DW_TAG_member
    5565                    .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$27)
    5566                    .dwattr $C$DW$308, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5567                    .dwattr $C$DW$308, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5568                    .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5569                    .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5570                    .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5571                    .dwattr $C$DW$308, DW_AT_decl_line(0x12a)
    5572                    .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    5573            
    5574            $C$DW$309       .dwtag  DW_TAG_member
    5575                    .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$27)
    5576                    .dwattr $C$DW$309, DW_AT_name("timerClear")
    5577                    .dwattr $C$DW$309, DW_AT_TI_symbol_name("timerClear")
    5578                    .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5579                    .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5580                    .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5581                    .dwattr $C$DW$309, DW_AT_decl_line(0x130)
    5582                    .dwattr $C$DW$309, DW_AT_decl_column(0x0e)
    5583            
    5584            $C$DW$310       .dwtag  DW_TAG_member
    5585                    .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$30)
    5586                    .dwattr $C$DW$310, DW_AT_name("startTimer")
    5587                    .dwattr $C$DW$310, DW_AT_TI_symbol_name("startTimer")
    5588                    .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5589                    .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5590                    .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5591                    .dwattr $C$DW$310, DW_AT_decl_line(0x132)
    5592                    .dwattr $C$DW$310, DW_AT_decl_column(0x0a)
    5593            
    5594                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5595                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
    5596                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    5597                    .dwendtag $C$DW$T$38
    5598            
    5599            $C$DW$T$72      .dwtag  DW_TAG_typedef
    5600                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
    5601                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    5602                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  115

    5603                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5604                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
    5605                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    5606            
    5607            
    5608            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5609                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    5610                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    5611            $C$DW$311       .dwtag  DW_TAG_member
    5612                    .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$27)
    5613                    .dwattr $C$DW$311, DW_AT_name("clockSource")
    5614                    .dwattr $C$DW$311, DW_AT_TI_symbol_name("clockSource")
    5615                    .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5616                    .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5617                    .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5618                    .dwattr $C$DW$311, DW_AT_decl_line(0x60)
    5619                    .dwattr $C$DW$311, DW_AT_decl_column(0x0e)
    5620            
    5621            $C$DW$312       .dwtag  DW_TAG_member
    5622                    .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    5623                    .dwattr $C$DW$312, DW_AT_name("clockSourceDivider")
    5624                    .dwattr $C$DW$312, DW_AT_TI_symbol_name("clockSourceDivider")
    5625                    .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5626                    .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5627                    .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5628                    .dwattr $C$DW$312, DW_AT_decl_line(0x77)
    5629                    .dwattr $C$DW$312, DW_AT_decl_column(0x0e)
    5630            
    5631            $C$DW$313       .dwtag  DW_TAG_member
    5632                    .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$27)
    5633                    .dwattr $C$DW$313, DW_AT_name("timerPeriod")
    5634                    .dwattr $C$DW$313, DW_AT_TI_symbol_name("timerPeriod")
    5635                    .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5636                    .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5637                    .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5638                    .dwattr $C$DW$313, DW_AT_decl_line(0x7a)
    5639                    .dwattr $C$DW$313, DW_AT_decl_column(0x0e)
    5640            
    5641            $C$DW$314       .dwtag  DW_TAG_member
    5642                    .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$27)
    5643                    .dwattr $C$DW$314, DW_AT_name("timerInterruptEnable_TBIE")
    5644                    .dwattr $C$DW$314, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    5645                    .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5646                    .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5647                    .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5648                    .dwattr $C$DW$314, DW_AT_decl_line(0x7f)
    5649                    .dwattr $C$DW$314, DW_AT_decl_column(0x0e)
    5650            
    5651            $C$DW$315       .dwtag  DW_TAG_member
    5652                    .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$27)
    5653                    .dwattr $C$DW$315, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    5654                    .dwattr $C$DW$315, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    5655                    .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5656                    .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5657                    .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  116

    5658                    .dwattr $C$DW$315, DW_AT_decl_line(0x84)
    5659                    .dwattr $C$DW$315, DW_AT_decl_column(0x0e)
    5660            
    5661            $C$DW$316       .dwtag  DW_TAG_member
    5662                    .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$27)
    5663                    .dwattr $C$DW$316, DW_AT_name("timerClear")
    5664                    .dwattr $C$DW$316, DW_AT_TI_symbol_name("timerClear")
    5665                    .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5666                    .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5667                    .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5668                    .dwattr $C$DW$316, DW_AT_decl_line(0x8a)
    5669                    .dwattr $C$DW$316, DW_AT_decl_column(0x0e)
    5670            
    5671            $C$DW$317       .dwtag  DW_TAG_member
    5672                    .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$30)
    5673                    .dwattr $C$DW$317, DW_AT_name("startTimer")
    5674                    .dwattr $C$DW$317, DW_AT_TI_symbol_name("startTimer")
    5675                    .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5676                    .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5677                    .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5678                    .dwattr $C$DW$317, DW_AT_decl_line(0x8c)
    5679                    .dwattr $C$DW$317, DW_AT_decl_column(0x0a)
    5680            
    5681                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5682                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    5683                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    5684                    .dwendtag $C$DW$T$39
    5685            
    5686            $C$DW$T$73      .dwtag  DW_TAG_typedef
    5687                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
    5688                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
    5689                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5690                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5691                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
    5692                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    5693            
    5694            
    5695            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5696                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
    5697                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    5698            $C$DW$318       .dwtag  DW_TAG_member
    5699                    .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$27)
    5700                    .dwattr $C$DW$318, DW_AT_name("clockSource")
    5701                    .dwattr $C$DW$318, DW_AT_TI_symbol_name("clockSource")
    5702                    .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5703                    .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5704                    .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5705                    .dwattr $C$DW$318, DW_AT_decl_line(0x20)
    5706                    .dwattr $C$DW$318, DW_AT_decl_column(0x0e)
    5707            
    5708            $C$DW$319       .dwtag  DW_TAG_member
    5709                    .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$27)
    5710                    .dwattr $C$DW$319, DW_AT_name("clockSourceDivider")
    5711                    .dwattr $C$DW$319, DW_AT_TI_symbol_name("clockSourceDivider")
    5712                    .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  117

    5713                    .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5714                    .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5715                    .dwattr $C$DW$319, DW_AT_decl_line(0x37)
    5716                    .dwattr $C$DW$319, DW_AT_decl_column(0x0e)
    5717            
    5718            $C$DW$320       .dwtag  DW_TAG_member
    5719                    .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$27)
    5720                    .dwattr $C$DW$320, DW_AT_name("timerPeriod")
    5721                    .dwattr $C$DW$320, DW_AT_TI_symbol_name("timerPeriod")
    5722                    .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5723                    .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5724                    .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5725                    .dwattr $C$DW$320, DW_AT_decl_line(0x39)
    5726                    .dwattr $C$DW$320, DW_AT_decl_column(0x0e)
    5727            
    5728            $C$DW$321       .dwtag  DW_TAG_member
    5729                    .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$27)
    5730                    .dwattr $C$DW$321, DW_AT_name("compareRegister")
    5731                    .dwattr $C$DW$321, DW_AT_TI_symbol_name("compareRegister")
    5732                    .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5733                    .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5734                    .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5735                    .dwattr $C$DW$321, DW_AT_decl_line(0x44)
    5736                    .dwattr $C$DW$321, DW_AT_decl_column(0x0e)
    5737            
    5738            $C$DW$322       .dwtag  DW_TAG_member
    5739                    .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    5740                    .dwattr $C$DW$322, DW_AT_name("compareOutputMode")
    5741                    .dwattr $C$DW$322, DW_AT_TI_symbol_name("compareOutputMode")
    5742                    .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5743                    .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5744                    .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5745                    .dwattr $C$DW$322, DW_AT_decl_line(0x4f)
    5746                    .dwattr $C$DW$322, DW_AT_decl_column(0x0e)
    5747            
    5748            $C$DW$323       .dwtag  DW_TAG_member
    5749                    .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    5750                    .dwattr $C$DW$323, DW_AT_name("dutyCycle")
    5751                    .dwattr $C$DW$323, DW_AT_TI_symbol_name("dutyCycle")
    5752                    .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5753                    .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5754                    .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
    5755                    .dwattr $C$DW$323, DW_AT_decl_line(0x51)
    5756                    .dwattr $C$DW$323, DW_AT_decl_column(0x0e)
    5757            
    5758                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
    5759                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
    5760                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    5761                    .dwendtag $C$DW$T$40
    5762            
    5763            $C$DW$T$74      .dwtag  DW_TAG_typedef
    5764                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
    5765                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
    5766                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5767                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  118

    5768                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
    5769                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    5770            
    5771            
    5772            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5773                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
    5774                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    5775            $C$DW$324       .dwtag  DW_TAG_member
    5776                    .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$24)
    5777                    .dwattr $C$DW$324, DW_AT_name("selectClockSource")
    5778                    .dwattr $C$DW$324, DW_AT_TI_symbol_name("selectClockSource")
    5779                    .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5780                    .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5781                    .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5782                    .dwattr $C$DW$324, DW_AT_decl_line(0x1c)
    5783                    .dwattr $C$DW$324, DW_AT_decl_column(0x0d)
    5784            
    5785            $C$DW$325       .dwtag  DW_TAG_member
    5786                    .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$27)
    5787                    .dwattr $C$DW$325, DW_AT_name("clockPrescalar")
    5788                    .dwattr $C$DW$325, DW_AT_TI_symbol_name("clockPrescalar")
    5789                    .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5790                    .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5791                    .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5792                    .dwattr $C$DW$325, DW_AT_decl_line(0x1e)
    5793                    .dwattr $C$DW$325, DW_AT_decl_column(0x0e)
    5794            
    5795            $C$DW$326       .dwtag  DW_TAG_member
    5796                    .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$24)
    5797                    .dwattr $C$DW$326, DW_AT_name("firstModReg")
    5798                    .dwattr $C$DW$326, DW_AT_TI_symbol_name("firstModReg")
    5799                    .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5800                    .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5801                    .dwattr $C$DW$326, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5802                    .dwattr $C$DW$326, DW_AT_decl_line(0x22)
    5803                    .dwattr $C$DW$326, DW_AT_decl_column(0x0d)
    5804            
    5805            $C$DW$327       .dwtag  DW_TAG_member
    5806                    .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$24)
    5807                    .dwattr $C$DW$327, DW_AT_name("secondModReg")
    5808                    .dwattr $C$DW$327, DW_AT_TI_symbol_name("secondModReg")
    5809                    .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5810                    .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5811                    .dwattr $C$DW$327, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5812                    .dwattr $C$DW$327, DW_AT_decl_line(0x26)
    5813                    .dwattr $C$DW$327, DW_AT_decl_column(0x0d)
    5814            
    5815            $C$DW$328       .dwtag  DW_TAG_member
    5816                    .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$24)
    5817                    .dwattr $C$DW$328, DW_AT_name("parity")
    5818                    .dwattr $C$DW$328, DW_AT_TI_symbol_name("parity")
    5819                    .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5820                    .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5821                    .dwattr $C$DW$328, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5822                    .dwattr $C$DW$328, DW_AT_decl_line(0x2c)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  119

    5823                    .dwattr $C$DW$328, DW_AT_decl_column(0x0d)
    5824            
    5825            $C$DW$329       .dwtag  DW_TAG_member
    5826                    .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$24)
    5827                    .dwattr $C$DW$329, DW_AT_name("msborLsbFirst")
    5828                    .dwattr $C$DW$329, DW_AT_TI_symbol_name("msborLsbFirst")
    5829                    .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5830                    .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5831                    .dwattr $C$DW$329, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5832                    .dwattr $C$DW$329, DW_AT_decl_line(0x31)
    5833                    .dwattr $C$DW$329, DW_AT_decl_column(0x0d)
    5834            
    5835            $C$DW$330       .dwtag  DW_TAG_member
    5836                    .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$24)
    5837                    .dwattr $C$DW$330, DW_AT_name("numberofStopBits")
    5838                    .dwattr $C$DW$330, DW_AT_TI_symbol_name("numberofStopBits")
    5839                    .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5840                    .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5841                    .dwattr $C$DW$330, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5842                    .dwattr $C$DW$330, DW_AT_decl_line(0x36)
    5843                    .dwattr $C$DW$330, DW_AT_decl_column(0x0d)
    5844            
    5845            $C$DW$331       .dwtag  DW_TAG_member
    5846                    .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$24)
    5847                    .dwattr $C$DW$331, DW_AT_name("uartMode")
    5848                    .dwattr $C$DW$331, DW_AT_TI_symbol_name("uartMode")
    5849                    .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5850                    .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5851                    .dwattr $C$DW$331, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5852                    .dwattr $C$DW$331, DW_AT_decl_line(0x3d)
    5853                    .dwattr $C$DW$331, DW_AT_decl_column(0x0d)
    5854            
    5855            $C$DW$332       .dwtag  DW_TAG_member
    5856                    .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$24)
    5857                    .dwattr $C$DW$332, DW_AT_name("overSampling")
    5858                    .dwattr $C$DW$332, DW_AT_TI_symbol_name("overSampling")
    5859                    .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5860                    .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5861                    .dwattr $C$DW$332, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5862                    .dwattr $C$DW$332, DW_AT_decl_line(0x42)
    5863                    .dwattr $C$DW$332, DW_AT_decl_column(0x0d)
    5864            
    5865                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5866                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
    5867                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5868                    .dwendtag $C$DW$T$41
    5869            
    5870            $C$DW$T$75      .dwtag  DW_TAG_typedef
    5871                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
    5872                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    5873                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    5874                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5875                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
    5876                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    5877            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  120

    5878            
    5879            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5880                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5881                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    5882            $C$DW$333       .dwtag  DW_TAG_member
    5883                    .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$43)
    5884                    .dwattr $C$DW$333, DW_AT_name("clockSourceFrequency")
    5885                    .dwattr $C$DW$333, DW_AT_TI_symbol_name("clockSourceFrequency")
    5886                    .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5887                    .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5888                    .dwattr $C$DW$333, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5889                    .dwattr $C$DW$333, DW_AT_decl_line(0x31)
    5890                    .dwattr $C$DW$333, DW_AT_decl_column(0x0e)
    5891            
    5892            $C$DW$334       .dwtag  DW_TAG_member
    5893                    .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$43)
    5894                    .dwattr $C$DW$334, DW_AT_name("desiredSpiClock")
    5895                    .dwattr $C$DW$334, DW_AT_TI_symbol_name("desiredSpiClock")
    5896                    .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5897                    .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5898                    .dwattr $C$DW$334, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5899                    .dwattr $C$DW$334, DW_AT_decl_line(0x33)
    5900                    .dwattr $C$DW$334, DW_AT_decl_column(0x0e)
    5901            
    5902                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5903                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
    5904                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    5905                    .dwendtag $C$DW$T$44
    5906            
    5907            $C$DW$T$76      .dwtag  DW_TAG_typedef
    5908                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
    5909                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
    5910                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5911                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
    5912                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
    5913                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    5914            
    5915            
    5916            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5917                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
    5918                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    5919            $C$DW$335       .dwtag  DW_TAG_member
    5920                    .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$24)
    5921                    .dwattr $C$DW$335, DW_AT_name("selectClockSource")
    5922                    .dwattr $C$DW$335, DW_AT_TI_symbol_name("selectClockSource")
    5923                    .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5924                    .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5925                    .dwattr $C$DW$335, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5926                    .dwattr $C$DW$335, DW_AT_decl_line(0x14)
    5927                    .dwattr $C$DW$335, DW_AT_decl_column(0x0d)
    5928            
    5929            $C$DW$336       .dwtag  DW_TAG_member
    5930                    .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$43)
    5931                    .dwattr $C$DW$336, DW_AT_name("clockSourceFrequency")
    5932                    .dwattr $C$DW$336, DW_AT_TI_symbol_name("clockSourceFrequency")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:02 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
TC_Fault_Check.asm                                                   PAGE  121

    5933                    .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5934                    .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5935                    .dwattr $C$DW$336, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5936                    .dwattr $C$DW$336, DW_AT_decl_line(0x16)
    5937                    .dwattr $C$DW$336, DW_AT_decl_column(0x0e)
    5938            
    5939            $C$DW$337       .dwtag  DW_TAG_member
    5940                    .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$43)
    5941                    .dwattr $C$DW$337, DW_AT_name("desiredSpiClock")
    5942                    .dwattr $C$DW$337, DW_AT_TI_symbol_name("desiredSpiClock")
    5943                    .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5944                    .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5945                    .dwattr $C$DW$337, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5946                    .dwattr $C$DW$337, DW_AT_decl_line(0x18)
    5947                    .dwattr $C$DW$337, DW_AT_decl_column(0x0e)
    5948            
    5949            $C$DW$338       .dwtag  DW_TAG_member
    5950                    .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$24)
    5951                    .dwattr $C$DW$338, DW_AT_name("msbFirst")
    5952                    .dwattr $C$DW$338, DW_AT_TI_symbol_name("msbFirst")
    5953                    .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5954                    .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5955                    .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
    5956                    .dwattr $C$DW$338, DW_AT_decl_line(0x1d)
    5957                    .dwattr $C$DW$338, DW_AT_decl_column(0x0d)
