MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Dec 20 13:46:02 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../src/Timing.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MCourson\workspace_v11\MZERO_HB50Board\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("PAIN_L")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("PAIN_L")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$93)

   10294            $C$DW$594       .dwtag  DW_TAG_enumerator
   10295                    .dwattr $C$DW$594, DW_AT_name("crc2")
   10296                    .dwattr $C$DW$594, DW_AT_const_value(0x06)
   10297                    .dwattr $C$DW$594, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   10298                    .dwattr $C$DW$594, DW_AT_decl_line(0x76)
   10299                    .dwattr $C$DW$594, DW_AT_decl_column(0x05)
   10300            
   10301            $C$DW$595       .dwtag  DW_TAG_enumerator
   10302                    .dwattr $C$DW$595, DW_AT_name("ack")
   10303                    .dwattr $C$DW$595, DW_AT_const_value(0x07)
   10304                    .dwattr $C$DW$595, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   10305                    .dwattr $C$DW$595, DW_AT_decl_line(0x77)
   10306                    .dwattr $C$DW$595, DW_AT_decl_column(0x05)
   10307            
   10308            $C$DW$596       .dwtag  DW_TAG_enumerator
   10309                    .dwattr $C$DW$596, DW_AT_name("var")
   10310                    .dwattr $C$DW$596, DW_AT_const_value(0x08)
   10311                    .dwattr $C$DW$596, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   10312                    .dwattr $C$DW$596, DW_AT_decl_line(0x78)
   10313                    .dwattr $C$DW$596, DW_AT_decl_column(0x05)
   10314            
   10315            $C$DW$597       .dwtag  DW_TAG_enumerator
   10316                    .dwattr $C$DW$597, DW_AT_name("UGmsg")
   10317                    .dwattr $C$DW$597, DW_AT_const_value(0x09)
   10318                    .dwattr $C$DW$597, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   10319                    .dwattr $C$DW$597, DW_AT_decl_line(0x79)
   10320                    .dwattr $C$DW$597, DW_AT_decl_column(0x05)
   10321            
   10322                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   10323                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
   10324                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x0e)
   10325                    .dwendtag $C$DW$T$57
   10326            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  214

   10327            $C$DW$T$58      .dwtag  DW_TAG_typedef
   10328                    .dwattr $C$DW$T$58, DW_AT_name("MessageFields")
   10329                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
   10330                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
   10331                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   10332                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x7a)
   10333                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
   10334            
   10335            
   10336            $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
   10337                    .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
   10338            $C$DW$598       .dwtag  DW_TAG_enumerator
   10339                    .dwattr $C$DW$598, DW_AT_name("init")
   10340                    .dwattr $C$DW$598, DW_AT_const_value(0x00)
   10341                    .dwattr $C$DW$598, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   10342                    .dwattr $C$DW$598, DW_AT_decl_line(0x80)
   10343                    .dwattr $C$DW$598, DW_AT_decl_column(0x05)
   10344            
   10345            $C$DW$599       .dwtag  DW_TAG_enumerator
   10346                    .dwattr $C$DW$599, DW_AT_name("running")
   10347                    .dwattr $C$DW$599, DW_AT_const_value(0x01)
   10348                    .dwattr $C$DW$599, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   10349                    .dwattr $C$DW$599, DW_AT_decl_line(0x80)
   10350                    .dwattr $C$DW$599, DW_AT_decl_column(0x0b)
   10351            
   10352            $C$DW$600       .dwtag  DW_TAG_enumerator
   10353                    .dwattr $C$DW$600, DW_AT_name("wait")
   10354                    .dwattr $C$DW$600, DW_AT_const_value(0x02)
   10355                    .dwattr $C$DW$600, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/Ma
   10356                    .dwattr $C$DW$600, DW_AT_decl_line(0x80)
   10357                    .dwattr $C$DW$600, DW_AT_decl_column(0x14)
   10358            
   10359                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   10360                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x7f)
   10361                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
   10362                    .dwendtag $C$DW$T$59
   10363            
   10364            $C$DW$T$60      .dwtag  DW_TAG_typedef
   10365                    .dwattr $C$DW$T$60, DW_AT_name("StatusFields")
   10366                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
   10367                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
   10368                    .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/M
   10369                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x81)
   10370                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
   10371            
   10372            
   10373            $C$DW$T$22      .dwtag  DW_TAG_structure_type
   10374                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
   10375            $C$DW$601       .dwtag  DW_TAG_member
   10376                    .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$14)
   10377                    .dwattr $C$DW$601, DW_AT_name("__max_align1")
   10378                    .dwattr $C$DW$601, DW_AT_TI_symbol_name("__max_align1")
   10379                    .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10380                    .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
   10381                    .dwattr $C$DW$601, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  215

   10382                    .dwattr $C$DW$601, DW_AT_decl_line(0x7b)
   10383                    .dwattr $C$DW$601, DW_AT_decl_column(0x0c)
   10384            
   10385            $C$DW$602       .dwtag  DW_TAG_member
   10386                    .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$18)
   10387                    .dwattr $C$DW$602, DW_AT_name("__max_align2")
   10388                    .dwattr $C$DW$602, DW_AT_TI_symbol_name("__max_align2")
   10389                    .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10390                    .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
   10391                    .dwattr $C$DW$602, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
   10392                    .dwattr $C$DW$602, DW_AT_decl_line(0x7c)
   10393                    .dwattr $C$DW$602, DW_AT_decl_column(0x0e)
   10394            
   10395                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   10396                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x7a)
   10397                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
   10398                    .dwendtag $C$DW$T$22
   10399            
   10400            $C$DW$T$61      .dwtag  DW_TAG_typedef
   10401                    .dwattr $C$DW$T$61, DW_AT_name("__max_align_t")
   10402                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
   10403                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   10404                    .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
   10405                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x7d)
   10406                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
   10407            
   10408            
   10409            $C$DW$T$25      .dwtag  DW_TAG_structure_type
   10410                    .dwattr $C$DW$T$25, DW_AT_name("ADC12_A_configureMemoryParam")
   10411                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x05)
   10412            $C$DW$603       .dwtag  DW_TAG_member
   10413                    .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$24)
   10414                    .dwattr $C$DW$603, DW_AT_name("memoryBufferControlIndex")
   10415                    .dwattr $C$DW$603, DW_AT_TI_symbol_name("memoryBufferControlIndex")
   10416                    .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10417                    .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
   10418                    .dwattr $C$DW$603, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   10419                    .dwattr $C$DW$603, DW_AT_decl_line(0x27)
   10420                    .dwattr $C$DW$603, DW_AT_decl_column(0x0d)
   10421            
   10422            $C$DW$604       .dwtag  DW_TAG_member
   10423                    .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$24)
   10424                    .dwattr $C$DW$604, DW_AT_name("inputSourceSelect")
   10425                    .dwattr $C$DW$604, DW_AT_TI_symbol_name("inputSourceSelect")
   10426                    .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10427                    .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
   10428                    .dwattr $C$DW$604, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   10429                    .dwattr $C$DW$604, DW_AT_decl_line(0x3b)
   10430                    .dwattr $C$DW$604, DW_AT_decl_column(0x0d)
   10431            
   10432            $C$DW$605       .dwtag  DW_TAG_member
   10433                    .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$24)
   10434                    .dwattr $C$DW$605, DW_AT_name("positiveRefVoltageSourceSelect")
   10435                    .dwattr $C$DW$605, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
   10436                    .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  216

   10437                    .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
   10438                    .dwattr $C$DW$605, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   10439                    .dwattr $C$DW$605, DW_AT_decl_line(0x42)
   10440                    .dwattr $C$DW$605, DW_AT_decl_column(0x0d)
   10441            
   10442            $C$DW$606       .dwtag  DW_TAG_member
   10443                    .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$24)
   10444                    .dwattr $C$DW$606, DW_AT_name("negativeRefVoltageSourceSelect")
   10445                    .dwattr $C$DW$606, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
   10446                    .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10447                    .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
   10448                    .dwattr $C$DW$606, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   10449                    .dwattr $C$DW$606, DW_AT_decl_line(0x48)
   10450                    .dwattr $C$DW$606, DW_AT_decl_column(0x0d)
   10451            
   10452            $C$DW$607       .dwtag  DW_TAG_member
   10453                    .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$24)
   10454                    .dwattr $C$DW$607, DW_AT_name("endOfSequence")
   10455                    .dwattr $C$DW$607, DW_AT_TI_symbol_name("endOfSequence")
   10456                    .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10457                    .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
   10458                    .dwattr $C$DW$607, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ad
   10459                    .dwattr $C$DW$607, DW_AT_decl_line(0x51)
   10460                    .dwattr $C$DW$607, DW_AT_decl_column(0x0d)
   10461            
   10462                    .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
   10463                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x14)
   10464                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
   10465                    .dwendtag $C$DW$T$25
   10466            
   10467            $C$DW$T$62      .dwtag  DW_TAG_typedef
   10468                    .dwattr $C$DW$T$62, DW_AT_name("ADC12_A_configureMemoryParam")
   10469                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$25)
   10470                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   10471                    .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/a
   10472                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x52)
   10473                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
   10474            
   10475            
   10476            $C$DW$T$28      .dwtag  DW_TAG_structure_type
   10477                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initCaptureModeParam")
   10478                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
   10479            $C$DW$608       .dwtag  DW_TAG_member
   10480                    .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$27)
   10481                    .dwattr $C$DW$608, DW_AT_name("captureRegister")
   10482                    .dwattr $C$DW$608, DW_AT_TI_symbol_name("captureRegister")
   10483                    .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10484                    .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
   10485                    .dwattr $C$DW$608, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10486                    .dwattr $C$DW$608, DW_AT_decl_line(0x58)
   10487                    .dwattr $C$DW$608, DW_AT_decl_column(0x0e)
   10488            
   10489            $C$DW$609       .dwtag  DW_TAG_member
   10490                    .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$27)
   10491                    .dwattr $C$DW$609, DW_AT_name("captureMode")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  217

   10492                    .dwattr $C$DW$609, DW_AT_TI_symbol_name("captureMode")
   10493                    .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10494                    .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
   10495                    .dwattr $C$DW$609, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10496                    .dwattr $C$DW$609, DW_AT_decl_line(0x5f)
   10497                    .dwattr $C$DW$609, DW_AT_decl_column(0x0e)
   10498            
   10499            $C$DW$610       .dwtag  DW_TAG_member
   10500                    .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$27)
   10501                    .dwattr $C$DW$610, DW_AT_name("captureInputSelect")
   10502                    .dwattr $C$DW$610, DW_AT_TI_symbol_name("captureInputSelect")
   10503                    .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10504                    .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
   10505                    .dwattr $C$DW$610, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10506                    .dwattr $C$DW$610, DW_AT_decl_line(0x66)
   10507                    .dwattr $C$DW$610, DW_AT_decl_column(0x0e)
   10508            
   10509            $C$DW$611       .dwtag  DW_TAG_member
   10510                    .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$27)
   10511                    .dwattr $C$DW$611, DW_AT_name("synchronizeCaptureSource")
   10512                    .dwattr $C$DW$611, DW_AT_TI_symbol_name("synchronizeCaptureSource")
   10513                    .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10514                    .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
   10515                    .dwattr $C$DW$611, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10516                    .dwattr $C$DW$611, DW_AT_decl_line(0x6b)
   10517                    .dwattr $C$DW$611, DW_AT_decl_column(0x0e)
   10518            
   10519            $C$DW$612       .dwtag  DW_TAG_member
   10520                    .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$27)
   10521                    .dwattr $C$DW$612, DW_AT_name("captureInterruptEnable")
   10522                    .dwattr $C$DW$612, DW_AT_TI_symbol_name("captureInterruptEnable")
   10523                    .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10524                    .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
   10525                    .dwattr $C$DW$612, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10526                    .dwattr $C$DW$612, DW_AT_decl_line(0x70)
   10527                    .dwattr $C$DW$612, DW_AT_decl_column(0x0e)
   10528            
   10529            $C$DW$613       .dwtag  DW_TAG_member
   10530                    .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$27)
   10531                    .dwattr $C$DW$613, DW_AT_name("captureOutputMode")
   10532                    .dwattr $C$DW$613, DW_AT_TI_symbol_name("captureOutputMode")
   10533                    .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10534                    .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
   10535                    .dwattr $C$DW$613, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10536                    .dwattr $C$DW$613, DW_AT_decl_line(0x7b)
   10537                    .dwattr $C$DW$613, DW_AT_decl_column(0x0e)
   10538            
   10539                    .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10540                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x4d)
   10541                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
   10542                    .dwendtag $C$DW$T$28
   10543            
   10544            $C$DW$T$63      .dwtag  DW_TAG_typedef
   10545                    .dwattr $C$DW$T$63, DW_AT_name("Timer_A_initCaptureModeParam")
   10546                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$28)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  218

   10547                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   10548                    .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10549                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x7c)
   10550                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
   10551            
   10552            
   10553            $C$DW$T$29      .dwtag  DW_TAG_structure_type
   10554                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initCompareModeParam")
   10555                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
   10556            $C$DW$614       .dwtag  DW_TAG_member
   10557                    .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$27)
   10558                    .dwattr $C$DW$614, DW_AT_name("compareRegister")
   10559                    .dwattr $C$DW$614, DW_AT_TI_symbol_name("compareRegister")
   10560                    .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10561                    .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
   10562                    .dwattr $C$DW$614, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10563                    .dwattr $C$DW$614, DW_AT_decl_line(0x145)
   10564                    .dwattr $C$DW$614, DW_AT_decl_column(0x0e)
   10565            
   10566            $C$DW$615       .dwtag  DW_TAG_member
   10567                    .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$27)
   10568                    .dwattr $C$DW$615, DW_AT_name("compareInterruptEnable")
   10569                    .dwattr $C$DW$615, DW_AT_TI_symbol_name("compareInterruptEnable")
   10570                    .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10571                    .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
   10572                    .dwattr $C$DW$615, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10573                    .dwattr $C$DW$615, DW_AT_decl_line(0x14a)
   10574                    .dwattr $C$DW$615, DW_AT_decl_column(0x0e)
   10575            
   10576            $C$DW$616       .dwtag  DW_TAG_member
   10577                    .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$27)
   10578                    .dwattr $C$DW$616, DW_AT_name("compareOutputMode")
   10579                    .dwattr $C$DW$616, DW_AT_TI_symbol_name("compareOutputMode")
   10580                    .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10581                    .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
   10582                    .dwattr $C$DW$616, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10583                    .dwattr $C$DW$616, DW_AT_decl_line(0x155)
   10584                    .dwattr $C$DW$616, DW_AT_decl_column(0x0e)
   10585            
   10586            $C$DW$617       .dwtag  DW_TAG_member
   10587                    .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$27)
   10588                    .dwattr $C$DW$617, DW_AT_name("compareValue")
   10589                    .dwattr $C$DW$617, DW_AT_TI_symbol_name("compareValue")
   10590                    .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10591                    .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
   10592                    .dwattr $C$DW$617, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10593                    .dwattr $C$DW$617, DW_AT_decl_line(0x157)
   10594                    .dwattr $C$DW$617, DW_AT_decl_column(0x0e)
   10595            
   10596                    .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10597                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x13a)
   10598                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
   10599                    .dwendtag $C$DW$T$29
   10600            
   10601            $C$DW$T$64      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  219

   10602                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCompareModeParam")
   10603                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
   10604                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   10605                    .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10606                    .dwattr $C$DW$T$64, DW_AT_decl_line(0x158)
   10607                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
   10608            
   10609            
   10610            $C$DW$T$31      .dwtag  DW_TAG_structure_type
   10611                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initContinuousModeParam")
   10612                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
   10613            $C$DW$618       .dwtag  DW_TAG_member
   10614                    .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$27)
   10615                    .dwattr $C$DW$618, DW_AT_name("clockSource")
   10616                    .dwattr $C$DW$618, DW_AT_TI_symbol_name("clockSource")
   10617                    .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10618                    .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
   10619                    .dwattr $C$DW$618, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10620                    .dwattr $C$DW$618, DW_AT_decl_line(0x20)
   10621                    .dwattr $C$DW$618, DW_AT_decl_column(0x0e)
   10622            
   10623            $C$DW$619       .dwtag  DW_TAG_member
   10624                    .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$27)
   10625                    .dwattr $C$DW$619, DW_AT_name("clockSourceDivider")
   10626                    .dwattr $C$DW$619, DW_AT_TI_symbol_name("clockSourceDivider")
   10627                    .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10628                    .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
   10629                    .dwattr $C$DW$619, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10630                    .dwattr $C$DW$619, DW_AT_decl_line(0x37)
   10631                    .dwattr $C$DW$619, DW_AT_decl_column(0x0e)
   10632            
   10633            $C$DW$620       .dwtag  DW_TAG_member
   10634                    .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$27)
   10635                    .dwattr $C$DW$620, DW_AT_name("timerInterruptEnable_TAIE")
   10636                    .dwattr $C$DW$620, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
   10637                    .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10638                    .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
   10639                    .dwattr $C$DW$620, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10640                    .dwattr $C$DW$620, DW_AT_decl_line(0x3c)
   10641                    .dwattr $C$DW$620, DW_AT_decl_column(0x0e)
   10642            
   10643            $C$DW$621       .dwtag  DW_TAG_member
   10644                    .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$27)
   10645                    .dwattr $C$DW$621, DW_AT_name("timerClear")
   10646                    .dwattr $C$DW$621, DW_AT_TI_symbol_name("timerClear")
   10647                    .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10648                    .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
   10649                    .dwattr $C$DW$621, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10650                    .dwattr $C$DW$621, DW_AT_decl_line(0x42)
   10651                    .dwattr $C$DW$621, DW_AT_decl_column(0x0e)
   10652            
   10653            $C$DW$622       .dwtag  DW_TAG_member
   10654                    .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$30)
   10655                    .dwattr $C$DW$622, DW_AT_name("startTimer")
   10656                    .dwattr $C$DW$622, DW_AT_TI_symbol_name("startTimer")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  220

   10657                    .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10658                    .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
   10659                    .dwattr $C$DW$622, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10660                    .dwattr $C$DW$622, DW_AT_decl_line(0x44)
   10661                    .dwattr $C$DW$622, DW_AT_decl_column(0x0a)
   10662            
   10663                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10664                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x19)
   10665                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
   10666                    .dwendtag $C$DW$T$31
   10667            
   10668            $C$DW$T$65      .dwtag  DW_TAG_typedef
   10669                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initContinuousModeParam")
   10670                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$31)
   10671                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   10672                    .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10673                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
   10674                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
   10675            
   10676            
   10677            $C$DW$T$32      .dwtag  DW_TAG_structure_type
   10678                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initUpDownModeParam")
   10679                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
   10680            $C$DW$623       .dwtag  DW_TAG_member
   10681                    .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$27)
   10682                    .dwattr $C$DW$623, DW_AT_name("clockSource")
   10683                    .dwattr $C$DW$623, DW_AT_TI_symbol_name("clockSource")
   10684                    .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10685                    .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
   10686                    .dwattr $C$DW$623, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10687                    .dwattr $C$DW$623, DW_AT_decl_line(0x8b)
   10688                    .dwattr $C$DW$623, DW_AT_decl_column(0x0e)
   10689            
   10690            $C$DW$624       .dwtag  DW_TAG_member
   10691                    .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$27)
   10692                    .dwattr $C$DW$624, DW_AT_name("clockSourceDivider")
   10693                    .dwattr $C$DW$624, DW_AT_TI_symbol_name("clockSourceDivider")
   10694                    .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10695                    .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
   10696                    .dwattr $C$DW$624, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10697                    .dwattr $C$DW$624, DW_AT_decl_line(0xa2)
   10698                    .dwattr $C$DW$624, DW_AT_decl_column(0x0e)
   10699            
   10700            $C$DW$625       .dwtag  DW_TAG_member
   10701                    .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$27)
   10702                    .dwattr $C$DW$625, DW_AT_name("timerPeriod")
   10703                    .dwattr $C$DW$625, DW_AT_TI_symbol_name("timerPeriod")
   10704                    .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10705                    .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
   10706                    .dwattr $C$DW$625, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10707                    .dwattr $C$DW$625, DW_AT_decl_line(0xa4)
   10708                    .dwattr $C$DW$625, DW_AT_decl_column(0x0e)
   10709            
   10710            $C$DW$626       .dwtag  DW_TAG_member
   10711                    .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  221

   10712                    .dwattr $C$DW$626, DW_AT_name("timerInterruptEnable_TAIE")
   10713                    .dwattr $C$DW$626, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
   10714                    .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10715                    .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
   10716                    .dwattr $C$DW$626, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10717                    .dwattr $C$DW$626, DW_AT_decl_line(0xa9)
   10718                    .dwattr $C$DW$626, DW_AT_decl_column(0x0e)
   10719            
   10720            $C$DW$627       .dwtag  DW_TAG_member
   10721                    .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$27)
   10722                    .dwattr $C$DW$627, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
   10723                    .dwattr $C$DW$627, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   10724                    .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10725                    .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
   10726                    .dwattr $C$DW$627, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10727                    .dwattr $C$DW$627, DW_AT_decl_line(0xae)
   10728                    .dwattr $C$DW$627, DW_AT_decl_column(0x0e)
   10729            
   10730            $C$DW$628       .dwtag  DW_TAG_member
   10731                    .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$27)
   10732                    .dwattr $C$DW$628, DW_AT_name("timerClear")
   10733                    .dwattr $C$DW$628, DW_AT_TI_symbol_name("timerClear")
   10734                    .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10735                    .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
   10736                    .dwattr $C$DW$628, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10737                    .dwattr $C$DW$628, DW_AT_decl_line(0xb4)
   10738                    .dwattr $C$DW$628, DW_AT_decl_column(0x0e)
   10739            
   10740            $C$DW$629       .dwtag  DW_TAG_member
   10741                    .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$30)
   10742                    .dwattr $C$DW$629, DW_AT_name("startTimer")
   10743                    .dwattr $C$DW$629, DW_AT_TI_symbol_name("startTimer")
   10744                    .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10745                    .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
   10746                    .dwattr $C$DW$629, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10747                    .dwattr $C$DW$629, DW_AT_decl_line(0xb6)
   10748                    .dwattr $C$DW$629, DW_AT_decl_column(0x0a)
   10749            
   10750                    .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10751                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x84)
   10752                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
   10753                    .dwendtag $C$DW$T$32
   10754            
   10755            $C$DW$T$66      .dwtag  DW_TAG_typedef
   10756                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initUpDownModeParam")
   10757                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)
   10758                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   10759                    .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10760                    .dwattr $C$DW$T$66, DW_AT_decl_line(0xb7)
   10761                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
   10762            
   10763            
   10764            $C$DW$T$33      .dwtag  DW_TAG_structure_type
   10765                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initUpModeParam")
   10766                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0e)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  222

   10767            $C$DW$630       .dwtag  DW_TAG_member
   10768                    .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$27)
   10769                    .dwattr $C$DW$630, DW_AT_name("clockSource")
   10770                    .dwattr $C$DW$630, DW_AT_TI_symbol_name("clockSource")
   10771                    .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10772                    .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
   10773                    .dwattr $C$DW$630, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10774                    .dwattr $C$DW$630, DW_AT_decl_line(0x105)
   10775                    .dwattr $C$DW$630, DW_AT_decl_column(0x0e)
   10776            
   10777            $C$DW$631       .dwtag  DW_TAG_member
   10778                    .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$27)
   10779                    .dwattr $C$DW$631, DW_AT_name("clockSourceDivider")
   10780                    .dwattr $C$DW$631, DW_AT_TI_symbol_name("clockSourceDivider")
   10781                    .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10782                    .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
   10783                    .dwattr $C$DW$631, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10784                    .dwattr $C$DW$631, DW_AT_decl_line(0x11c)
   10785                    .dwattr $C$DW$631, DW_AT_decl_column(0x0e)
   10786            
   10787            $C$DW$632       .dwtag  DW_TAG_member
   10788                    .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$27)
   10789                    .dwattr $C$DW$632, DW_AT_name("timerPeriod")
   10790                    .dwattr $C$DW$632, DW_AT_TI_symbol_name("timerPeriod")
   10791                    .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10792                    .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
   10793                    .dwattr $C$DW$632, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10794                    .dwattr $C$DW$632, DW_AT_decl_line(0x11f)
   10795                    .dwattr $C$DW$632, DW_AT_decl_column(0x0e)
   10796            
   10797            $C$DW$633       .dwtag  DW_TAG_member
   10798                    .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$27)
   10799                    .dwattr $C$DW$633, DW_AT_name("timerInterruptEnable_TAIE")
   10800                    .dwattr $C$DW$633, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
   10801                    .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10802                    .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
   10803                    .dwattr $C$DW$633, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10804                    .dwattr $C$DW$633, DW_AT_decl_line(0x124)
   10805                    .dwattr $C$DW$633, DW_AT_decl_column(0x0e)
   10806            
   10807            $C$DW$634       .dwtag  DW_TAG_member
   10808                    .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$27)
   10809                    .dwattr $C$DW$634, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
   10810                    .dwattr $C$DW$634, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   10811                    .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10812                    .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
   10813                    .dwattr $C$DW$634, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10814                    .dwattr $C$DW$634, DW_AT_decl_line(0x129)
   10815                    .dwattr $C$DW$634, DW_AT_decl_column(0x0e)
   10816            
   10817            $C$DW$635       .dwtag  DW_TAG_member
   10818                    .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$27)
   10819                    .dwattr $C$DW$635, DW_AT_name("timerClear")
   10820                    .dwattr $C$DW$635, DW_AT_TI_symbol_name("timerClear")
   10821                    .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  223

   10822                    .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
   10823                    .dwattr $C$DW$635, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10824                    .dwattr $C$DW$635, DW_AT_decl_line(0x12f)
   10825                    .dwattr $C$DW$635, DW_AT_decl_column(0x0e)
   10826            
   10827            $C$DW$636       .dwtag  DW_TAG_member
   10828                    .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$30)
   10829                    .dwattr $C$DW$636, DW_AT_name("startTimer")
   10830                    .dwattr $C$DW$636, DW_AT_TI_symbol_name("startTimer")
   10831                    .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10832                    .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
   10833                    .dwattr $C$DW$636, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10834                    .dwattr $C$DW$636, DW_AT_decl_line(0x131)
   10835                    .dwattr $C$DW$636, DW_AT_decl_column(0x0a)
   10836            
   10837                    .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10838                    .dwattr $C$DW$T$33, DW_AT_decl_line(0xfe)
   10839                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
   10840                    .dwendtag $C$DW$T$33
   10841            
   10842            $C$DW$T$67      .dwtag  DW_TAG_typedef
   10843                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpModeParam")
   10844                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$33)
   10845                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   10846                    .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10847                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x132)
   10848                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
   10849            
   10850            
   10851            $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10852                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_outputPWMParam")
   10853                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
   10854            $C$DW$637       .dwtag  DW_TAG_member
   10855                    .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$27)
   10856                    .dwattr $C$DW$637, DW_AT_name("clockSource")
   10857                    .dwattr $C$DW$637, DW_AT_TI_symbol_name("clockSource")
   10858                    .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10859                    .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
   10860                    .dwattr $C$DW$637, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10861                    .dwattr $C$DW$637, DW_AT_decl_line(0xc5)
   10862                    .dwattr $C$DW$637, DW_AT_decl_column(0x0e)
   10863            
   10864            $C$DW$638       .dwtag  DW_TAG_member
   10865                    .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$27)
   10866                    .dwattr $C$DW$638, DW_AT_name("clockSourceDivider")
   10867                    .dwattr $C$DW$638, DW_AT_TI_symbol_name("clockSourceDivider")
   10868                    .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10869                    .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
   10870                    .dwattr $C$DW$638, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10871                    .dwattr $C$DW$638, DW_AT_decl_line(0xdc)
   10872                    .dwattr $C$DW$638, DW_AT_decl_column(0x0e)
   10873            
   10874            $C$DW$639       .dwtag  DW_TAG_member
   10875                    .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$27)
   10876                    .dwattr $C$DW$639, DW_AT_name("timerPeriod")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  224

   10877                    .dwattr $C$DW$639, DW_AT_TI_symbol_name("timerPeriod")
   10878                    .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10879                    .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
   10880                    .dwattr $C$DW$639, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10881                    .dwattr $C$DW$639, DW_AT_decl_line(0xde)
   10882                    .dwattr $C$DW$639, DW_AT_decl_column(0x0e)
   10883            
   10884            $C$DW$640       .dwtag  DW_TAG_member
   10885                    .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$27)
   10886                    .dwattr $C$DW$640, DW_AT_name("compareRegister")
   10887                    .dwattr $C$DW$640, DW_AT_TI_symbol_name("compareRegister")
   10888                    .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10889                    .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
   10890                    .dwattr $C$DW$640, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10891                    .dwattr $C$DW$640, DW_AT_decl_line(0xe9)
   10892                    .dwattr $C$DW$640, DW_AT_decl_column(0x0e)
   10893            
   10894            $C$DW$641       .dwtag  DW_TAG_member
   10895                    .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$27)
   10896                    .dwattr $C$DW$641, DW_AT_name("compareOutputMode")
   10897                    .dwattr $C$DW$641, DW_AT_TI_symbol_name("compareOutputMode")
   10898                    .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10899                    .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
   10900                    .dwattr $C$DW$641, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10901                    .dwattr $C$DW$641, DW_AT_decl_line(0xf4)
   10902                    .dwattr $C$DW$641, DW_AT_decl_column(0x0e)
   10903            
   10904            $C$DW$642       .dwtag  DW_TAG_member
   10905                    .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$27)
   10906                    .dwattr $C$DW$642, DW_AT_name("dutyCycle")
   10907                    .dwattr $C$DW$642, DW_AT_TI_symbol_name("dutyCycle")
   10908                    .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10909                    .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
   10910                    .dwattr $C$DW$642, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10911                    .dwattr $C$DW$642, DW_AT_decl_line(0xf6)
   10912                    .dwattr $C$DW$642, DW_AT_decl_column(0x0e)
   10913            
   10914                    .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10915                    .dwattr $C$DW$T$34, DW_AT_decl_line(0xbe)
   10916                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
   10917                    .dwendtag $C$DW$T$34
   10918            
   10919            $C$DW$T$68      .dwtag  DW_TAG_typedef
   10920                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_outputPWMParam")
   10921                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$34)
   10922                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   10923                    .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10924                    .dwattr $C$DW$T$68, DW_AT_decl_line(0xf7)
   10925                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
   10926            
   10927            
   10928            $C$DW$T$35      .dwtag  DW_TAG_structure_type
   10929                    .dwattr $C$DW$T$35, DW_AT_name("Timer_B_initCaptureModeParam")
   10930                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
   10931            $C$DW$643       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  225

   10932                    .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$27)
   10933                    .dwattr $C$DW$643, DW_AT_name("captureRegister")
   10934                    .dwattr $C$DW$643, DW_AT_TI_symbol_name("captureRegister")
   10935                    .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10936                    .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
   10937                    .dwattr $C$DW$643, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10938                    .dwattr $C$DW$643, DW_AT_decl_line(0xa0)
   10939                    .dwattr $C$DW$643, DW_AT_decl_column(0x0e)
   10940            
   10941            $C$DW$644       .dwtag  DW_TAG_member
   10942                    .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$27)
   10943                    .dwattr $C$DW$644, DW_AT_name("captureMode")
   10944                    .dwattr $C$DW$644, DW_AT_TI_symbol_name("captureMode")
   10945                    .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10946                    .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
   10947                    .dwattr $C$DW$644, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10948                    .dwattr $C$DW$644, DW_AT_decl_line(0xa7)
   10949                    .dwattr $C$DW$644, DW_AT_decl_column(0x0e)
   10950            
   10951            $C$DW$645       .dwtag  DW_TAG_member
   10952                    .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$27)
   10953                    .dwattr $C$DW$645, DW_AT_name("captureInputSelect")
   10954                    .dwattr $C$DW$645, DW_AT_TI_symbol_name("captureInputSelect")
   10955                    .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10956                    .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
   10957                    .dwattr $C$DW$645, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10958                    .dwattr $C$DW$645, DW_AT_decl_line(0xae)
   10959                    .dwattr $C$DW$645, DW_AT_decl_column(0x0e)
   10960            
   10961            $C$DW$646       .dwtag  DW_TAG_member
   10962                    .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$27)
   10963                    .dwattr $C$DW$646, DW_AT_name("synchronizeCaptureSource")
   10964                    .dwattr $C$DW$646, DW_AT_TI_symbol_name("synchronizeCaptureSource")
   10965                    .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10966                    .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
   10967                    .dwattr $C$DW$646, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10968                    .dwattr $C$DW$646, DW_AT_decl_line(0xb3)
   10969                    .dwattr $C$DW$646, DW_AT_decl_column(0x0e)
   10970            
   10971            $C$DW$647       .dwtag  DW_TAG_member
   10972                    .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$27)
   10973                    .dwattr $C$DW$647, DW_AT_name("captureInterruptEnable")
   10974                    .dwattr $C$DW$647, DW_AT_TI_symbol_name("captureInterruptEnable")
   10975                    .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10976                    .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
   10977                    .dwattr $C$DW$647, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10978                    .dwattr $C$DW$647, DW_AT_decl_line(0xb8)
   10979                    .dwattr $C$DW$647, DW_AT_decl_column(0x0e)
   10980            
   10981            $C$DW$648       .dwtag  DW_TAG_member
   10982                    .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$27)
   10983                    .dwattr $C$DW$648, DW_AT_name("captureOutputMode")
   10984                    .dwattr $C$DW$648, DW_AT_TI_symbol_name("captureOutputMode")
   10985                    .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10986                    .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  226

   10987                    .dwattr $C$DW$648, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   10988                    .dwattr $C$DW$648, DW_AT_decl_line(0xc3)
   10989                    .dwattr $C$DW$648, DW_AT_decl_column(0x0e)
   10990            
   10991                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   10992                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x95)
   10993                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
   10994                    .dwendtag $C$DW$T$35
   10995            
   10996            $C$DW$T$69      .dwtag  DW_TAG_typedef
   10997                    .dwattr $C$DW$T$69, DW_AT_name("Timer_B_initCaptureModeParam")
   10998                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
   10999                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   11000                    .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11001                    .dwattr $C$DW$T$69, DW_AT_decl_line(0xc4)
   11002                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
   11003            
   11004            
   11005            $C$DW$T$36      .dwtag  DW_TAG_structure_type
   11006                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initCompareModeParam")
   11007                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
   11008            $C$DW$649       .dwtag  DW_TAG_member
   11009                    .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$27)
   11010                    .dwattr $C$DW$649, DW_AT_name("compareRegister")
   11011                    .dwattr $C$DW$649, DW_AT_TI_symbol_name("compareRegister")
   11012                    .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11013                    .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
   11014                    .dwattr $C$DW$649, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11015                    .dwattr $C$DW$649, DW_AT_decl_line(0x146)
   11016                    .dwattr $C$DW$649, DW_AT_decl_column(0x0e)
   11017            
   11018            $C$DW$650       .dwtag  DW_TAG_member
   11019                    .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$27)
   11020                    .dwattr $C$DW$650, DW_AT_name("compareInterruptEnable")
   11021                    .dwattr $C$DW$650, DW_AT_TI_symbol_name("compareInterruptEnable")
   11022                    .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11023                    .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
   11024                    .dwattr $C$DW$650, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11025                    .dwattr $C$DW$650, DW_AT_decl_line(0x14b)
   11026                    .dwattr $C$DW$650, DW_AT_decl_column(0x0e)
   11027            
   11028            $C$DW$651       .dwtag  DW_TAG_member
   11029                    .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$27)
   11030                    .dwattr $C$DW$651, DW_AT_name("compareOutputMode")
   11031                    .dwattr $C$DW$651, DW_AT_TI_symbol_name("compareOutputMode")
   11032                    .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11033                    .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
   11034                    .dwattr $C$DW$651, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11035                    .dwattr $C$DW$651, DW_AT_decl_line(0x156)
   11036                    .dwattr $C$DW$651, DW_AT_decl_column(0x0e)
   11037            
   11038            $C$DW$652       .dwtag  DW_TAG_member
   11039                    .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$27)
   11040                    .dwattr $C$DW$652, DW_AT_name("compareValue")
   11041                    .dwattr $C$DW$652, DW_AT_TI_symbol_name("compareValue")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  227

   11042                    .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11043                    .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
   11044                    .dwattr $C$DW$652, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11045                    .dwattr $C$DW$652, DW_AT_decl_line(0x158)
   11046                    .dwattr $C$DW$652, DW_AT_decl_column(0x0e)
   11047            
   11048                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11049                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x13b)
   11050                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
   11051                    .dwendtag $C$DW$T$36
   11052            
   11053            $C$DW$T$70      .dwtag  DW_TAG_typedef
   11054                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCompareModeParam")
   11055                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$36)
   11056                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   11057                    .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11058                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x159)
   11059                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
   11060            
   11061            
   11062            $C$DW$T$37      .dwtag  DW_TAG_structure_type
   11063                    .dwattr $C$DW$T$37, DW_AT_name("Timer_B_initContinuousModeParam")
   11064                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
   11065            $C$DW$653       .dwtag  DW_TAG_member
   11066                    .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$27)
   11067                    .dwattr $C$DW$653, DW_AT_name("clockSource")
   11068                    .dwattr $C$DW$653, DW_AT_TI_symbol_name("clockSource")
   11069                    .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11070                    .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
   11071                    .dwattr $C$DW$653, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11072                    .dwattr $C$DW$653, DW_AT_decl_line(0xd3)
   11073                    .dwattr $C$DW$653, DW_AT_decl_column(0x0e)
   11074            
   11075            $C$DW$654       .dwtag  DW_TAG_member
   11076                    .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$27)
   11077                    .dwattr $C$DW$654, DW_AT_name("clockSourceDivider")
   11078                    .dwattr $C$DW$654, DW_AT_TI_symbol_name("clockSourceDivider")
   11079                    .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11080                    .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
   11081                    .dwattr $C$DW$654, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11082                    .dwattr $C$DW$654, DW_AT_decl_line(0xea)
   11083                    .dwattr $C$DW$654, DW_AT_decl_column(0x0e)
   11084            
   11085            $C$DW$655       .dwtag  DW_TAG_member
   11086                    .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$27)
   11087                    .dwattr $C$DW$655, DW_AT_name("timerInterruptEnable_TBIE")
   11088                    .dwattr $C$DW$655, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
   11089                    .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11090                    .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
   11091                    .dwattr $C$DW$655, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11092                    .dwattr $C$DW$655, DW_AT_decl_line(0xef)
   11093                    .dwattr $C$DW$655, DW_AT_decl_column(0x0e)
   11094            
   11095            $C$DW$656       .dwtag  DW_TAG_member
   11096                    .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  228

   11097                    .dwattr $C$DW$656, DW_AT_name("timerClear")
   11098                    .dwattr $C$DW$656, DW_AT_TI_symbol_name("timerClear")
   11099                    .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11100                    .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
   11101                    .dwattr $C$DW$656, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11102                    .dwattr $C$DW$656, DW_AT_decl_line(0xf5)
   11103                    .dwattr $C$DW$656, DW_AT_decl_column(0x0e)
   11104            
   11105            $C$DW$657       .dwtag  DW_TAG_member
   11106                    .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$30)
   11107                    .dwattr $C$DW$657, DW_AT_name("startTimer")
   11108                    .dwattr $C$DW$657, DW_AT_TI_symbol_name("startTimer")
   11109                    .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11110                    .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
   11111                    .dwattr $C$DW$657, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11112                    .dwattr $C$DW$657, DW_AT_decl_line(0xf7)
   11113                    .dwattr $C$DW$657, DW_AT_decl_column(0x0a)
   11114            
   11115                    .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11116                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xcc)
   11117                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
   11118                    .dwendtag $C$DW$T$37
   11119            
   11120            $C$DW$T$71      .dwtag  DW_TAG_typedef
   11121                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initContinuousModeParam")
   11122                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
   11123                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
   11124                    .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11125                    .dwattr $C$DW$T$71, DW_AT_decl_line(0xf8)
   11126                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
   11127            
   11128            
   11129            $C$DW$T$38      .dwtag  DW_TAG_structure_type
   11130                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initUpDownModeParam")
   11131                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
   11132            $C$DW$658       .dwtag  DW_TAG_member
   11133                    .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$27)
   11134                    .dwattr $C$DW$658, DW_AT_name("clockSource")
   11135                    .dwattr $C$DW$658, DW_AT_TI_symbol_name("clockSource")
   11136                    .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11137                    .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
   11138                    .dwattr $C$DW$658, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11139                    .dwattr $C$DW$658, DW_AT_decl_line(0x107)
   11140                    .dwattr $C$DW$658, DW_AT_decl_column(0x0e)
   11141            
   11142            $C$DW$659       .dwtag  DW_TAG_member
   11143                    .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$27)
   11144                    .dwattr $C$DW$659, DW_AT_name("clockSourceDivider")
   11145                    .dwattr $C$DW$659, DW_AT_TI_symbol_name("clockSourceDivider")
   11146                    .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11147                    .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
   11148                    .dwattr $C$DW$659, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11149                    .dwattr $C$DW$659, DW_AT_decl_line(0x11e)
   11150                    .dwattr $C$DW$659, DW_AT_decl_column(0x0e)
   11151            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  229

   11152            $C$DW$660       .dwtag  DW_TAG_member
   11153                    .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$27)
   11154                    .dwattr $C$DW$660, DW_AT_name("timerPeriod")
   11155                    .dwattr $C$DW$660, DW_AT_TI_symbol_name("timerPeriod")
   11156                    .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11157                    .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
   11158                    .dwattr $C$DW$660, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11159                    .dwattr $C$DW$660, DW_AT_decl_line(0x120)
   11160                    .dwattr $C$DW$660, DW_AT_decl_column(0x0e)
   11161            
   11162            $C$DW$661       .dwtag  DW_TAG_member
   11163                    .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$27)
   11164                    .dwattr $C$DW$661, DW_AT_name("timerInterruptEnable_TBIE")
   11165                    .dwattr $C$DW$661, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
   11166                    .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11167                    .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
   11168                    .dwattr $C$DW$661, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11169                    .dwattr $C$DW$661, DW_AT_decl_line(0x125)
   11170                    .dwattr $C$DW$661, DW_AT_decl_column(0x0e)
   11171            
   11172            $C$DW$662       .dwtag  DW_TAG_member
   11173                    .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$27)
   11174                    .dwattr $C$DW$662, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
   11175                    .dwattr $C$DW$662, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   11176                    .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11177                    .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
   11178                    .dwattr $C$DW$662, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11179                    .dwattr $C$DW$662, DW_AT_decl_line(0x12a)
   11180                    .dwattr $C$DW$662, DW_AT_decl_column(0x0e)
   11181            
   11182            $C$DW$663       .dwtag  DW_TAG_member
   11183                    .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$27)
   11184                    .dwattr $C$DW$663, DW_AT_name("timerClear")
   11185                    .dwattr $C$DW$663, DW_AT_TI_symbol_name("timerClear")
   11186                    .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11187                    .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
   11188                    .dwattr $C$DW$663, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11189                    .dwattr $C$DW$663, DW_AT_decl_line(0x130)
   11190                    .dwattr $C$DW$663, DW_AT_decl_column(0x0e)
   11191            
   11192            $C$DW$664       .dwtag  DW_TAG_member
   11193                    .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$30)
   11194                    .dwattr $C$DW$664, DW_AT_name("startTimer")
   11195                    .dwattr $C$DW$664, DW_AT_TI_symbol_name("startTimer")
   11196                    .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11197                    .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
   11198                    .dwattr $C$DW$664, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11199                    .dwattr $C$DW$664, DW_AT_decl_line(0x132)
   11200                    .dwattr $C$DW$664, DW_AT_decl_column(0x0a)
   11201            
   11202                    .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11203                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x100)
   11204                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
   11205                    .dwendtag $C$DW$T$38
   11206            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  230

   11207            $C$DW$T$72      .dwtag  DW_TAG_typedef
   11208                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initUpDownModeParam")
   11209                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
   11210                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
   11211                    .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11212                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x133)
   11213                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
   11214            
   11215            
   11216            $C$DW$T$39      .dwtag  DW_TAG_structure_type
   11217                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
   11218                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
   11219            $C$DW$665       .dwtag  DW_TAG_member
   11220                    .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$27)
   11221                    .dwattr $C$DW$665, DW_AT_name("clockSource")
   11222                    .dwattr $C$DW$665, DW_AT_TI_symbol_name("clockSource")
   11223                    .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11224                    .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
   11225                    .dwattr $C$DW$665, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11226                    .dwattr $C$DW$665, DW_AT_decl_line(0x60)
   11227                    .dwattr $C$DW$665, DW_AT_decl_column(0x0e)
   11228            
   11229            $C$DW$666       .dwtag  DW_TAG_member
   11230                    .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$27)
   11231                    .dwattr $C$DW$666, DW_AT_name("clockSourceDivider")
   11232                    .dwattr $C$DW$666, DW_AT_TI_symbol_name("clockSourceDivider")
   11233                    .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11234                    .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
   11235                    .dwattr $C$DW$666, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11236                    .dwattr $C$DW$666, DW_AT_decl_line(0x77)
   11237                    .dwattr $C$DW$666, DW_AT_decl_column(0x0e)
   11238            
   11239            $C$DW$667       .dwtag  DW_TAG_member
   11240                    .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$27)
   11241                    .dwattr $C$DW$667, DW_AT_name("timerPeriod")
   11242                    .dwattr $C$DW$667, DW_AT_TI_symbol_name("timerPeriod")
   11243                    .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11244                    .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
   11245                    .dwattr $C$DW$667, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11246                    .dwattr $C$DW$667, DW_AT_decl_line(0x7a)
   11247                    .dwattr $C$DW$667, DW_AT_decl_column(0x0e)
   11248            
   11249            $C$DW$668       .dwtag  DW_TAG_member
   11250                    .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$27)
   11251                    .dwattr $C$DW$668, DW_AT_name("timerInterruptEnable_TBIE")
   11252                    .dwattr $C$DW$668, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
   11253                    .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11254                    .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
   11255                    .dwattr $C$DW$668, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11256                    .dwattr $C$DW$668, DW_AT_decl_line(0x7f)
   11257                    .dwattr $C$DW$668, DW_AT_decl_column(0x0e)
   11258            
   11259            $C$DW$669       .dwtag  DW_TAG_member
   11260                    .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$27)
   11261                    .dwattr $C$DW$669, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  231

   11262                    .dwattr $C$DW$669, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
   11263                    .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11264                    .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
   11265                    .dwattr $C$DW$669, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11266                    .dwattr $C$DW$669, DW_AT_decl_line(0x84)
   11267                    .dwattr $C$DW$669, DW_AT_decl_column(0x0e)
   11268            
   11269            $C$DW$670       .dwtag  DW_TAG_member
   11270                    .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$27)
   11271                    .dwattr $C$DW$670, DW_AT_name("timerClear")
   11272                    .dwattr $C$DW$670, DW_AT_TI_symbol_name("timerClear")
   11273                    .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11274                    .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
   11275                    .dwattr $C$DW$670, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11276                    .dwattr $C$DW$670, DW_AT_decl_line(0x8a)
   11277                    .dwattr $C$DW$670, DW_AT_decl_column(0x0e)
   11278            
   11279            $C$DW$671       .dwtag  DW_TAG_member
   11280                    .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$30)
   11281                    .dwattr $C$DW$671, DW_AT_name("startTimer")
   11282                    .dwattr $C$DW$671, DW_AT_TI_symbol_name("startTimer")
   11283                    .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11284                    .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
   11285                    .dwattr $C$DW$671, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11286                    .dwattr $C$DW$671, DW_AT_decl_line(0x8c)
   11287                    .dwattr $C$DW$671, DW_AT_decl_column(0x0a)
   11288            
   11289                    .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11290                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
   11291                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
   11292                    .dwendtag $C$DW$T$39
   11293            
   11294            $C$DW$T$73      .dwtag  DW_TAG_typedef
   11295                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpModeParam")
   11296                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$39)
   11297                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
   11298                    .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11299                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8d)
   11300                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
   11301            
   11302            
   11303            $C$DW$T$40      .dwtag  DW_TAG_structure_type
   11304                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_outputPWMParam")
   11305                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
   11306            $C$DW$672       .dwtag  DW_TAG_member
   11307                    .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$27)
   11308                    .dwattr $C$DW$672, DW_AT_name("clockSource")
   11309                    .dwattr $C$DW$672, DW_AT_TI_symbol_name("clockSource")
   11310                    .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11311                    .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
   11312                    .dwattr $C$DW$672, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11313                    .dwattr $C$DW$672, DW_AT_decl_line(0x20)
   11314                    .dwattr $C$DW$672, DW_AT_decl_column(0x0e)
   11315            
   11316            $C$DW$673       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  232

   11317                    .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$27)
   11318                    .dwattr $C$DW$673, DW_AT_name("clockSourceDivider")
   11319                    .dwattr $C$DW$673, DW_AT_TI_symbol_name("clockSourceDivider")
   11320                    .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11321                    .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
   11322                    .dwattr $C$DW$673, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11323                    .dwattr $C$DW$673, DW_AT_decl_line(0x37)
   11324                    .dwattr $C$DW$673, DW_AT_decl_column(0x0e)
   11325            
   11326            $C$DW$674       .dwtag  DW_TAG_member
   11327                    .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$27)
   11328                    .dwattr $C$DW$674, DW_AT_name("timerPeriod")
   11329                    .dwattr $C$DW$674, DW_AT_TI_symbol_name("timerPeriod")
   11330                    .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11331                    .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
   11332                    .dwattr $C$DW$674, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11333                    .dwattr $C$DW$674, DW_AT_decl_line(0x39)
   11334                    .dwattr $C$DW$674, DW_AT_decl_column(0x0e)
   11335            
   11336            $C$DW$675       .dwtag  DW_TAG_member
   11337                    .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$27)
   11338                    .dwattr $C$DW$675, DW_AT_name("compareRegister")
   11339                    .dwattr $C$DW$675, DW_AT_TI_symbol_name("compareRegister")
   11340                    .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11341                    .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
   11342                    .dwattr $C$DW$675, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11343                    .dwattr $C$DW$675, DW_AT_decl_line(0x44)
   11344                    .dwattr $C$DW$675, DW_AT_decl_column(0x0e)
   11345            
   11346            $C$DW$676       .dwtag  DW_TAG_member
   11347                    .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$27)
   11348                    .dwattr $C$DW$676, DW_AT_name("compareOutputMode")
   11349                    .dwattr $C$DW$676, DW_AT_TI_symbol_name("compareOutputMode")
   11350                    .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11351                    .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
   11352                    .dwattr $C$DW$676, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11353                    .dwattr $C$DW$676, DW_AT_decl_line(0x4f)
   11354                    .dwattr $C$DW$676, DW_AT_decl_column(0x0e)
   11355            
   11356            $C$DW$677       .dwtag  DW_TAG_member
   11357                    .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$27)
   11358                    .dwattr $C$DW$677, DW_AT_name("dutyCycle")
   11359                    .dwattr $C$DW$677, DW_AT_TI_symbol_name("dutyCycle")
   11360                    .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11361                    .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
   11362                    .dwattr $C$DW$677, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/ti
   11363                    .dwattr $C$DW$677, DW_AT_decl_line(0x51)
   11364                    .dwattr $C$DW$677, DW_AT_decl_column(0x0e)
   11365            
   11366                    .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11367                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x19)
   11368                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
   11369                    .dwendtag $C$DW$T$40
   11370            
   11371            $C$DW$T$74      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  233

   11372                    .dwattr $C$DW$T$74, DW_AT_name("Timer_B_outputPWMParam")
   11373                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$40)
   11374                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
   11375                    .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/t
   11376                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x52)
   11377                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
   11378            
   11379            
   11380            $C$DW$T$41      .dwtag  DW_TAG_structure_type
   11381                    .dwattr $C$DW$T$41, DW_AT_name("USCI_A_UART_initParam")
   11382                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
   11383            $C$DW$678       .dwtag  DW_TAG_member
   11384                    .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
   11385                    .dwattr $C$DW$678, DW_AT_name("selectClockSource")
   11386                    .dwattr $C$DW$678, DW_AT_TI_symbol_name("selectClockSource")
   11387                    .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11388                    .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
   11389                    .dwattr $C$DW$678, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11390                    .dwattr $C$DW$678, DW_AT_decl_line(0x1c)
   11391                    .dwattr $C$DW$678, DW_AT_decl_column(0x0d)
   11392            
   11393            $C$DW$679       .dwtag  DW_TAG_member
   11394                    .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$27)
   11395                    .dwattr $C$DW$679, DW_AT_name("clockPrescalar")
   11396                    .dwattr $C$DW$679, DW_AT_TI_symbol_name("clockPrescalar")
   11397                    .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11398                    .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
   11399                    .dwattr $C$DW$679, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11400                    .dwattr $C$DW$679, DW_AT_decl_line(0x1e)
   11401                    .dwattr $C$DW$679, DW_AT_decl_column(0x0e)
   11402            
   11403            $C$DW$680       .dwtag  DW_TAG_member
   11404                    .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
   11405                    .dwattr $C$DW$680, DW_AT_name("firstModReg")
   11406                    .dwattr $C$DW$680, DW_AT_TI_symbol_name("firstModReg")
   11407                    .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11408                    .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
   11409                    .dwattr $C$DW$680, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11410                    .dwattr $C$DW$680, DW_AT_decl_line(0x22)
   11411                    .dwattr $C$DW$680, DW_AT_decl_column(0x0d)
   11412            
   11413            $C$DW$681       .dwtag  DW_TAG_member
   11414                    .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$24)
   11415                    .dwattr $C$DW$681, DW_AT_name("secondModReg")
   11416                    .dwattr $C$DW$681, DW_AT_TI_symbol_name("secondModReg")
   11417                    .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11418                    .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
   11419                    .dwattr $C$DW$681, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11420                    .dwattr $C$DW$681, DW_AT_decl_line(0x26)
   11421                    .dwattr $C$DW$681, DW_AT_decl_column(0x0d)
   11422            
   11423            $C$DW$682       .dwtag  DW_TAG_member
   11424                    .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
   11425                    .dwattr $C$DW$682, DW_AT_name("parity")
   11426                    .dwattr $C$DW$682, DW_AT_TI_symbol_name("parity")
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  234

   11427                    .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11428                    .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
   11429                    .dwattr $C$DW$682, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11430                    .dwattr $C$DW$682, DW_AT_decl_line(0x2c)
   11431                    .dwattr $C$DW$682, DW_AT_decl_column(0x0d)
   11432            
   11433            $C$DW$683       .dwtag  DW_TAG_member
   11434                    .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$24)
   11435                    .dwattr $C$DW$683, DW_AT_name("msborLsbFirst")
   11436                    .dwattr $C$DW$683, DW_AT_TI_symbol_name("msborLsbFirst")
   11437                    .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11438                    .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
   11439                    .dwattr $C$DW$683, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11440                    .dwattr $C$DW$683, DW_AT_decl_line(0x31)
   11441                    .dwattr $C$DW$683, DW_AT_decl_column(0x0d)
   11442            
   11443            $C$DW$684       .dwtag  DW_TAG_member
   11444                    .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$24)
   11445                    .dwattr $C$DW$684, DW_AT_name("numberofStopBits")
   11446                    .dwattr $C$DW$684, DW_AT_TI_symbol_name("numberofStopBits")
   11447                    .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11448                    .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
   11449                    .dwattr $C$DW$684, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11450                    .dwattr $C$DW$684, DW_AT_decl_line(0x36)
   11451                    .dwattr $C$DW$684, DW_AT_decl_column(0x0d)
   11452            
   11453            $C$DW$685       .dwtag  DW_TAG_member
   11454                    .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
   11455                    .dwattr $C$DW$685, DW_AT_name("uartMode")
   11456                    .dwattr $C$DW$685, DW_AT_TI_symbol_name("uartMode")
   11457                    .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11458                    .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
   11459                    .dwattr $C$DW$685, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11460                    .dwattr $C$DW$685, DW_AT_decl_line(0x3d)
   11461                    .dwattr $C$DW$685, DW_AT_decl_column(0x0d)
   11462            
   11463            $C$DW$686       .dwtag  DW_TAG_member
   11464                    .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
   11465                    .dwattr $C$DW$686, DW_AT_name("overSampling")
   11466                    .dwattr $C$DW$686, DW_AT_TI_symbol_name("overSampling")
   11467                    .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11468                    .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
   11469                    .dwattr $C$DW$686, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11470                    .dwattr $C$DW$686, DW_AT_decl_line(0x42)
   11471                    .dwattr $C$DW$686, DW_AT_decl_column(0x0d)
   11472            
   11473                    .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   11474                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
   11475                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
   11476                    .dwendtag $C$DW$T$41
   11477            
   11478            $C$DW$T$75      .dwtag  DW_TAG_typedef
   11479                    .dwattr $C$DW$T$75, DW_AT_name("USCI_A_UART_initParam")
   11480                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
   11481                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  235

   11482                    .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   11483                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x43)
   11484                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
   11485            
   11486            
   11487            $C$DW$T$44      .dwtag  DW_TAG_structure_type
   11488                    .dwattr $C$DW$T$44, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
   11489                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
   11490            $C$DW$687       .dwtag  DW_TAG_member
   11491                    .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$43)
   11492                    .dwattr $C$DW$687, DW_AT_name("clockSourceFrequency")
   11493                    .dwattr $C$DW$687, DW_AT_TI_symbol_name("clockSourceFrequency")
   11494                    .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11495                    .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
   11496                    .dwattr $C$DW$687, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11497                    .dwattr $C$DW$687, DW_AT_decl_line(0x31)
   11498                    .dwattr $C$DW$687, DW_AT_decl_column(0x0e)
   11499            
   11500            $C$DW$688       .dwtag  DW_TAG_member
   11501                    .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$43)
   11502                    .dwattr $C$DW$688, DW_AT_name("desiredSpiClock")
   11503                    .dwattr $C$DW$688, DW_AT_TI_symbol_name("desiredSpiClock")
   11504                    .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11505                    .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
   11506                    .dwattr $C$DW$688, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11507                    .dwattr $C$DW$688, DW_AT_decl_line(0x33)
   11508                    .dwattr $C$DW$688, DW_AT_decl_column(0x0e)
   11509            
   11510                    .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   11511                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2f)
   11512                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
   11513                    .dwendtag $C$DW$T$44
   11514            
   11515            $C$DW$T$76      .dwtag  DW_TAG_typedef
   11516                    .dwattr $C$DW$T$76, DW_AT_name("USCI_B_SPI_changeMasterClockParam")
   11517                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$44)
   11518                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
   11519                    .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/u
   11520                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x34)
   11521                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
   11522            
   11523            
   11524            $C$DW$T$45      .dwtag  DW_TAG_structure_type
   11525                    .dwattr $C$DW$T$45, DW_AT_name("USCI_B_SPI_initMasterParam")
   11526                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
   11527            $C$DW$689       .dwtag  DW_TAG_member
   11528                    .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$24)
   11529                    .dwattr $C$DW$689, DW_AT_name("selectClockSource")
   11530                    .dwattr $C$DW$689, DW_AT_TI_symbol_name("selectClockSource")
   11531                    .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11532                    .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
   11533                    .dwattr $C$DW$689, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11534                    .dwattr $C$DW$689, DW_AT_decl_line(0x14)
   11535                    .dwattr $C$DW$689, DW_AT_decl_column(0x0d)
   11536            
MSP430 Assembler PC v21.6.1 Tue Dec 20 13:46:03 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
Timing.asm                                                           PAGE  236

   11537            $C$DW$690       .dwtag  DW_TAG_member
   11538                    .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$43)
   11539                    .dwattr $C$DW$690, DW_AT_name("clockSourceFrequency")
   11540                    .dwattr $C$DW$690, DW_AT_TI_symbol_name("clockSourceFrequency")
   11541                    .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11542                    .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
   11543                    .dwattr $C$DW$690, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11544                    .dwattr $C$DW$690, DW_AT_decl_line(0x16)
   11545                    .dwattr $C$DW$690, DW_AT_decl_column(0x0e)
   11546            
   11547            $C$DW$691       .dwtag  DW_TAG_member
   11548                    .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$43)
   11549                    .dwattr $C$DW$691, DW_AT_name("desiredSpiClock")
   11550                    .dwattr $C$DW$691, DW_AT_TI_symbol_name("desiredSpiClock")
   11551                    .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11552                    .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
   11553                    .dwattr $C$DW$691, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11554                    .dwattr $C$DW$691, DW_AT_decl_line(0x18)
   11555                    .dwattr $C$DW$691, DW_AT_decl_column(0x0e)
   11556            
   11557            $C$DW$692       .dwtag  DW_TAG_member
   11558                    .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
   11559                    .dwattr $C$DW$692, DW_AT_name("msbFirst")
   11560                    .dwattr $C$DW$692, DW_AT_TI_symbol_name("msbFirst")
   11561                    .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11562                    .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
   11563                    .dwattr $C$DW$692, DW_AT_decl_file("C:/Users/MCourson/workspace_v11/MZERO_HB50Board/include/us
   11564                    .dwattr $C$DW$692, DW_AT_decl_line(0x1d)
   11565                    .dwattr $C$DW$692, DW_AT_decl_column(0x0d)
   11566            
